SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
COPY public.wilayas (wilaya_id, wilaya_ar, wilaya_fr, wilaya_latitude, wilaya_longitude) FROM stdin;
1	أدرار	Adrar	26.4888155	-1.3582442
2	الشلف	Chlef	36.20342	1.2680696
3	الأغواط	Laghouat	33.7504405	2.6431094
4	أم البواقي	Oum El Bouaghi	35.8105805	7.0184178
5	باتنة	Batna	35.3384291	5.7315453
6	بجاية	Béjaïa	36.5569005	4.7858925
7	بسكرة	Biskra	34.7845635	5.8124353
8	بشار	Béchar	31.385726	-2.0115958
9	البليدة	Blida	36.5012595	2.9517666
10	البويرة	Bouira	36.2316481	3.9082579
11	تمنراست	Tamanrasset	24.3753438	4.3208436
12	تبسة	Tébessa	35.124945	7.9011735
13	تلمسان	Tlemcen	34.667468	-1.2978132
14	تيارت	Tiaret	34.8947575	1.5945792
15	تيزي وزو	Tizi Ouzou	36.6816175	4.237186
16	الجزائر	Alger	36.700051	3.0291266
17	الجلفة	Djelfa	34.342841	3.2172531
18	جيجل	Jijel	36.7292188	5.9607776
19	سطيف	Sétif	36.105661	5.5620276
20	سعيدة	Saïda	34.743349	0.2440764
21	سكيكدة	Skikda	36.7545115	6.8856255
22	سيدي بلعباس	Sidi Bel Abbès	34.682268	-0.4357555
23	عنابة	Annaba	36.8438878	7.5983068
24	قالمة	Guelma	36.3491635	7.409499
25	قسنطينة	Constantine	36.3584165	6.6671674
26	المدية	Médéa	35.9752045	3.0123504
27	مستغانم	Mostaganem	36.0026915	0.3686867
28	المسيلة	M'Sila	35.1300205	4.2003107
29	معسكر	Mascara	35.3978385	0.2430195
30	ورقلة	Ouargla	31.92823306	5.27516681
31	وهران	Oran	35.6215862	-0.7016143
32	البيض	El Bayadh	32.570303	1.1259581
33	إليزي	Illizi	27.8528505	7.8189636
34	برج بوعريريج	Bordj Bou Arreridj	36.0962029	4.6602742
35	بومرداس	Boumerdès	36.7358032	3.6163046
36	الطارف	El Tarf	36.6713563	8.070134
37	تندوف	Tindouf	27.543907	-6.2399251
38	تيسمسيلت	Tissemsilt	35.7858975	1.8340957
39	الوادي	El Oued	33.215441	7.1553214
40	خنشلة	Khenchela	34.9133455	6.9059431
41	سوق أهراس	Souk Ahras	36.1378681	7.8262426
42	تيبازة	Tipaza	36.527157	2.1672012
43	ميلة	Mila	36.2502135	6.1652163
44	عين الدفلة	Aïn Defla	36.1586843	2.0842817
45	النعامة	Naâma	33.2336851	-0.8151958
46	عين تيموشنت	Aïn Témouchent	35.3651297	-0.9452171
47	غرداية	Ghardaïa	32.440827	3.5618209
48	غليزان	Relizane	35.8363185	0.9118537
49	تيميمون	Timimoun	29.26631963	0.23483276
50	برج باجي مختار	Bordj Badji Mokhtar	21.32437224	0.94928741
51	بني عباس	Beni Abbes	30.1317426	-2.169031
52	أولاد جلال	Ouled Djellal	34.4254103	5.0644342
53	عين صالح	In Salah	27.19902208	2.48016357
54	عين قزام	In Guezzam	19.5704491	5.76953888
55	تقرت	Touggourt	33.1098968	6.066102
56	جانت	Djanet	24.55149974	9.48669434
57	المغير	El Mghair	33.9496809	5.921089
58	المنيعة	El Menia	30.5841144	2.88219452
\.
COPY public.dairas (daira_id, wilaya_id, daira_ar, daira_fr, daira_name, daira_latitude, daira_longitude) FROM stdin;
1	1	أدرار	Adrar	دائرة أدرار, أدرار, الجزائر	27.9324975	-1.423011
3	1	رقان	Reggane	دائرة رقان, أدرار, 01200, الجزائر	25.531637	-2.0991725
4	1	تسابيت	Tsabit	دائرة تسابيت, أدرار, 01015, الجزائر	28.498805	-1.1266723
6	1	زاوية كنتة	Zaouiat Kounta	دائرة زاوية كنتة, أدرار, 01030, الجزائر	27.169876	-1.2954415
7	1	أولف	Aoulef	دائرة اولف, أدرار, 01003, الجزائر	27.4162788	1.1090215
8	1	فنوغيل	Fenoughil	دائرة فنوغيل, أدرار, الجزائر	27.894138	0.3728227
14	2	الشلف	Chlef	دائرة الشلف, الشلف, الجزائر	36.095845	1.372285
15	2	تنس	Tenes	دائرة تنس, الشلف, الجزائر	36.4676923	1.2898896
16	2	الكريمية	El Karimia	دائرة الكريمية, الشلف, 02008, الجزائر	36.0433196	1.5921056
17	2	تاوقريت	Taougrit	دائرة تاوقريت, الشلف, الجزائر	36.2796744	0.8655982
18	2	بني حواء	Beni Haoua	دائرة بني حواء, الشلف, 02017, الجزائر	36.4761114	1.5354487
19	2	أولاد فارس	Ouled Fares	دائرة أولاد فارس, الشلف, الجزائر	36.2289304	1.2096561
20	2	بوقادير	Boukadir	دائرة بوقادير, الشلف, الجزائر	36.063252	1.097299
21	2	الزبوجة	Zeboudja	دائرة الزبوجة, الشلف, الجزائر	36.3854909	1.4348674
22	2	أبو الحسن	Abou El Hassane	دائرة أبو الحسن, الشلف, الجزائر	36.362058	1.1215169
23	2	المرسى	El Marsa	دائرة المرسى, الشلف, الجزائر	36.3837949	0.968834
24	2	وادي الفضة	Oued Fodda	دائرة وادي الفضة, الشلف, الجزائر	36.2565732	1.5219576
25	2	أولاد بن عبد القادر	Ouled Ben Abdelkader	دائرة أولاد بن عبد القادر, الشلف, الجزائر	35.9681195	1.391059
26	2	عين مران	Ain Merane	دائرة عين مران, الشلف, الجزائر	36.2162695	1.0288994
27	3	الأغواط	Laghouat	دائرة الأغواط, الأغواط, الجزائر	33.8425798	2.8423727
28	3	قصر الحيران	Ksar El Hirane	دائرة قصر الحيران, الأغواط, 03100, الجزائر	33.5291537	3.0421425
29	3	سيدي مخلوف	Sidi Makhlouf	دائرة سيدي مخلوف, الأغواط, الجزائر	34.046571	2.8749804
30	3	حاسي الرمل	Hassi R'mel	دائرة حاسي الرمل, الأغواط, الجزائر	33.307776	3.8168612
31	3	عين ماضي	Ain Madhi	دائرة عين ماضي, الأغواط, الجزائر	33.7171891	2.5318515
32	3	قتلة سيدي سعيد	Gueltat Sidi Saad	دائرة قلتة سيدي سعد, الأغواط, 03013, الجزائر	34.3701844	1.9095807
33	3	بريدة	Brida	دائرة بريدة, الأغواط, الجزائر	33.956751	1.6351982
34	3	الغيشة	El Ghicha	دائرةالغيشة, الأغواط, الجزائر	33.8750888	2.1395264
35	3	أفلو	Aflou	دائرة آفلو, الأغواط, 03400, الجزائر	34.1526188	2.0496633
36	3	وادي مرة	Oued Morra	دائرة وادي مرة, الأغواط, الجزائر	34.1171561	2.318211
37	4	أم البواقي	Oum El Bouaghi	دائرة أم البواقي, أم البواقي, الجزائر	35.7525703	7.0748459
38	4	عين البيضاء	Ain Beida	دائرة عين البيضاء, أم البواقي, الجزائر	35.880591	7.3824519
39	4	عين مليلة	Ain M'lila	دائرة عين مليلة, أم البواقي, الجزائر	36.0484805	6.5700453
40	4	سيقوس	Sigus	دائرة سيقوس, أم البواقي, الجزائر	36.0967	6.8361696
41	4	عين ببوش	Ain Babouche	دائرة عين بابوش, أم البواقي, الجزائر	35.9969954	7.1005567
42	4	الضلعة	Dhalaa	دائرة دهالة, أم البواقي, الجزائر	35.587189	7.5525326
43	4	عين كرشة	Ain Kercha	دائرة عين كرشة, أم البواقي, 04006, الجزائر	35.8959742	6.6672585
44	4	فكيرينة	F'kirina	دائرة فكرينة, أم البواقي, الجزائر	35.6529375	7.3525414
45	4	سوق نعمان	Souk Naamane	دائرة سوق نعمان, أم البواقي, الجزائر	35.895078	6.3482734
46	4	قصر الصباحي	Ksar Sbahi	دائرة قصر صباحي, أم البواقي, 04018, الجزائر	36.0614655	7.2530315
47	4	مسكيانة	Meskiana	دائرة مسكيانة, أم البواقي, الجزائر	35.6972555	7.6966612
48	4	عين فكرون	Ain Fekroun	دائرة عين فكرون, أم البواقي, الجزائر	35.8608627	6.8700198
49	5	باتنة	Batna	دائرة باتنة, باتنة, الجزائر	35.5492346	6.1160382
50	5	مروانة	Merouana	دائرة مروانة, باتنة, الجزائر	35.6139266	5.9912696
51	5	سريانة	Seriana	دائرة سريانة, باتنة, الجزائر	35.7612701	6.1786513
52	5	منعة	Menaa	دائرة منعة, باتنة, الجزائر	35.0926941	6.013753
53	5	المعذر	El Madher	دائرة المعذر, باتنة, 05015, الجزائر	35.7326804	6.4286648
54	5	تازولت	Tazoult	دائرة تازولت, باتنة, 05011, الجزائر	35.4999607	6.3065991
55	5	نقاوس	N'gaous	دائرة نقاوس, باتنة, الجزائر	35.4893963	5.5686692
56	5	أريس	Arris	دائرة أريس, باتنة, الجزائر	35.2642867	6.3300231
57	5	عين جاسر	Ain Djasser	دائرة عين جاسر, باتنة, الجزائر	35.815384	5.9671049
58	5	سقانة	Seggana	دائرة سقانة, باتنة, الجزائر	35.3133717	5.6294881
59	5	إشمول	Ichemoul	دائرة اشمول, باتنة, الجزائر	35.3359979	6.5101798
60	5	بوزينة	Bouzina	دائرة بوزينة, باتنة, 05041, الجزائر	35.2962402	6.1255154
61	5	الشمرة	Chemora	دائرة الشمرة, باتنة, الجزائر	35.6789667	6.6679525
62	5	بريكة	Barika	دائرة بريكة, باتنة, الجزائر	35.237667	5.266017
63	5	الجزار	Djezzar	دائرة الجزار, باتنة, الجزائر	35.3706718	5.0309871
64	5	تكوت	Tkout	دائرة تكوت, باتنة, الجزائر	35.0006385	6.490104
65	5	عين التوتة	Ain Touta	دائرة عين التوتة, باتنة, الجزائر	35.3773022	5.9790395
66	5	ثنية العابد	Theniet El Abed	دائرة ثنية العابد, باتنة, 05108, الجزائر	35.3334048	6.317364
67	5	تيمقاد	Timgad	دائرة تيمقاد, باتنة, 05023, الجزائر	35.5421069	6.6049122
68	5	رأس العيون	Ras El Aioun	دائرة راس لعيون, باتنة, الجزائر	35.6952131	5.6256922
69	5	أولاد سي سليمان	Ouled Si Slimane	دائرة اولاد سي سليمان, باتنة, 05066, الجزائر	35.5692966	5.7614618
70	6	بجاية	Bejaia	دائرة بجاية, بجاية, 06000, الجزائر	36.7568604	5.0216572
71	6	أميزور	Amizour	دائرة أميزور, بجاية, 06000, الجزائر	36.6143069	4.8626178
72	6	تيمزريت	Timezrit	دائرة تيمزريت, بجاية, 06000, الجزائر	36.6155736	4.7683245
73	6	سوق الإثنين	Souk El Tenine	دائرة سوق الإثنين, بجاية, 06000, الجزائر	36.5986538	5.4070431
74	6	تيشي	Tichy	دائرة تيشي, بجاية, 06000, الجزائر	36.6476406	5.1065496
75	6	إغيل علي	Ighil Ali	دائرة إغيل علي, بجاية, 06000, الجزائر	36.3238011	4.5313559
76	6	درقينة	Darguina	دائرة درقينة, بجاية, 06000, الجزائر	36.551274	5.315835
77	6	أوقاس	Aokas	دائرة أوقاس, بجاية, 06000, الجزائر	36.5961802	5.2278578
78	6	أدكار	Adekar	دائرة آدكار, بجاية, 06000, الجزائر	36.7856316	4.7083208
79	6	أقبو	Akbou	دائرة آقبو, بجاية, 06000, الجزائر	36.4727606	4.4987583
80	6	صدوق	Seddouk	دائرة صدوق, بجاية, 06000, الجزائر	36.4976826	4.6585242
81	6	تازملت	Tazmalt	دائرة ثازمالت, بجاية, 06000, الجزائر	36.3671572	4.4325466
82	6	شميني	Chemini	دائرة شميني, بجاية, 06000, الجزائر	36.6254537	4.6039391
83	6	برباشة	Barbacha	دائرة برباشة, بجاية, 06000, الجزائر	36.5638848	4.9909684
84	6	إفري أوزلاقن	Ifri Ouzellaguene	إفري, أوزلاقن, دائرة أوزلاقن, بجاية, 06010, الجزائر	36.5503357	4.5527421
85	6	سيدي عيش	Sidi Aich	دائرة سيدي عيش, بجاية, 06000, الجزائر	36.635692	4.6981202
86	6	القصر	El Kseur	دائرة القصر, بجاية, 06000, الجزائر	36.756047	4.8604519
87	6	خراطة	Kherrata	دائرة خراطة, بجاية, 06000, الجزائر	36.44549	5.2543799
88	6	بني معوش	Beni Maouche	دائرة بني معوش, بجاية, 06000, الجزائر	36.4878512	4.787552
89	7	بسكرة	Biskra	دائرة بسكرة, بسكرة, الجزائر	34.809602	5.6865144
92	7	سيدي عقبة	Sidi Okba	دائرة سيدي عقبة, بسكرة, الجزائر	34.6598134	6.0922343
93	7	مشونش	Mechouneche	دائرة مشونش, بسكرة, الجزائر	34.9069849	6.0033889
94	7	زريبة الوادي	Zeribet El Oued	دائرة زريبة الوادي, بسكرة, الجزائر	34.6821741	6.5479674
95	7	القنطرة	El Kantara	دائرة القنطرة, بسكرة, الجزائر	35.187214	5.7124197
96	7	الوطاية	El Outaya	دائرة لوطاية, بسكرة, الجزائر	34.9803702	5.5539311
97	7	جمورة	Djemorah	دائرة جمورة, بسكرة, 07008, الجزائر	35.0330776	5.7407906
98	7	طولقة	Tolga	دائرة طولقة, بسكرة, الجزائر	34.888308	5.2458229
99	7	أورلال	Ourlal	دائرة أورلال, بسكرة, الجزائر	34.586717	5.6071113
100	7	فوغالة	Foughala	دائرة فوغالة, بسكرة, 07027, الجزائر	34.7183818	5.263117
102	8	بشار	Bechar	دائرة بشار, بشار, 08000, الجزائر	31.622981	-1.914199
104	8	لحمر	Lahmar	دائرة الأحمر, بشار, الجزائر	31.9388923	-2.4585431
106	8	القنادسة	Kenadsa	دائرة القنادسة, بشار, 08011, الجزائر	31.4893171	-2.9902171
109	8	تاغيت	Taghit	دائرة تاغيت, بشار, 08030, الجزائر	31.0739148	-1.6640932
111	8	العبادلة	Abadla	دائرة العبادلة, بشار, 08027, الجزائر	30.8953795	-2.9850034
113	8	بني ونيف	Beni Ounif	دائرة بني ونيف, بشار, 08100, الجزائر	31.561312	-0.8942721
115	9	البليدة	Blida	دائرة البليدة, البليدة, 09000, الجزائر	36.4399731	2.7972312
116	9	بوعينان	Bouinan	دائرة بوينان, البليدة, 09450, الجزائر	36.5462479	3.0058182
117	9	وادي العلايق	Oued El Alleug	دائرة وادي العلايق, البليدة, الجزائر	36.5728343	2.8026584
118	9	أولاد يعيش	Ouled Yaich	دائرة أولاد يعيش, البليدة, الجزائر	36.4700515	2.9475493
119	9	العفرون	El Affroun	دائرة العفرون, البليدة, الجزائر	36.4458113	2.5818026
120	9	موزاية	Mouzaia	دائرة موزاية, البليدة, الجزائر	36.4570051	2.6999007
121	9	مفتاح	Meftah	دائرة مفتاح, البليدة, الجزائر	36.6091701	3.2316018
122	9	بوفاريك	Boufarik	دائرة بوفاريك, البليدة, الجزائر	36.5354413	2.9107359
123	9	الأربعاء	Larbaa	الاربعاء, دائرة الأربعاء, البليدة, 09300, الجزائر	36.5596677	3.154512
124	9	بوقرة	Bougara	دائرة بوقرة, البليدة, الجزائر	36.4715533	3.0750194
125	10	البويرة	Bouira	دائرة البويرة, البويرة, الجزائر	36.390165	3.8722194
126	10	سوق الخميس	Souk El Khemis	دائرة سوق الخميس, البويرة, 10420, الجزائر	36.4075795	3.6213248
127	10	القادرية	Kadiria	دائرة قادرية, البويرة, 10006, الجزائر	36.504034	3.7169558
128	10	الحيزر	Haizer	دائرة حيزر, البويرة, الجزائر	36.4075465	4.0065795
129	10	الأخضرية	Lakhdaria	دائرة الأخضرية, البويرة, 10002, الجزائر	36.507499	3.4581464
130	10	الهاشمية	El Hachimia	دائرة الهاشمية, البويرة, الجزائر	36.2269075	3.8483464
131	10	برج أوخريص	Bordj Okhriss	دائرة برج أوخريص, البويرة, الجزائر	36.0051456	3.9383982
132	10	بشلول	Bechloul	دائرة بشلول, البويرة, الجزائر	36.293068	4.0483004
133	10	عين بسام	Ain Bessem	دائرة عين بسام, البويرة, الجزائر	36.3363168	3.7353614
134	10	بئر غبالو	Bir Ghbalou	دائرة بئر غبالو, البويرة, الجزائر	36.2533661	3.6161053
135	10	مشد الله	M'chedallah	دائرة مشدا الله, البويرة, الجزائر	36.327971	4.2641212
136	10	سور الغزلان	Sour El Ghozlane	دائرة سور الغزلان, البويرة, الجزائر	36.0802648	3.6384224
137	11	تمنراست	Tamanrasset	دائرة تمنراست, تمنراست, الجزائر	23.7343525	3.4371685
138	11	سيلت	Silet	سيلت, أبلسة, دائرة أبلسة, تمنراست, الجزائر	22.657237	4.569521
141	11	تاظروك	Tazrouk	دائرة تاظروك, تمنراست, الجزائر	24.2264705	6.4976577
146	12	تبسة	Tebessa	دائرة تبسة, تبسة, 12000, الجزائر	35.3983243	8.0885005
147	12	بئر العاتر	Bir El Ater	دائرة بئر العاتر, تبسة, الجزائر	34.8740648	7.994285
148	12	الشريعة	Cheria	دائرة الشريعة, تبسة, الجزائر	34.9133935	7.7865755
149	12	العوينات	El Aouinet	دائرة العوينات, تبسة, الجزائر	35.837995	7.9500012
150	12	نقرين	Negrine	دائرة نقرين, تبسة, 12024, الجزائر	34.4662635	7.4658857
151	12	بئر مقدم	Bir Mokadem	دائرة بئر مقدم, تبسة, الجزائر	35.4438693	7.7944173
152	12	الكويف	El Kouif	دائرة الكويف, تبسة, الجزائر	35.4746663	8.2139831
153	12	مرسط	Morsott	دائرة مرسط, تبسة, الجزائر	35.6216535	7.9758922
154	12	العقلة	El Ogla	دائرة العقلة, تبسة, الجزائر	34.954677	7.4864813
155	12	الونزة	Ouenza	دائرة الونزة, تبسة, 12003, الجزائر	35.7612511	8.2013326
156	12	الماء الابيض	El Malabiod	دائرة الماء الأبيض, تبسة, الجزائر	35.2498575	8.2349532
157	12	أم علي	Oum Ali	دائرة أم على, تبسة, الجزائر	34.9746524	8.2051019
158	13	تلمسان	Tlemcen	دائرة تلمسان, تلمسان, 13000, الجزائر	34.8962002	-1.3154008
159	13	عين تالوت	Ain Tellout	دائرة عين تالوت, تلمسان, 13012, الجزائر	34.8181296	-0.936015
160	13	الرمشي	Remchi	دائرة الرمشي, تلمسان, الجزائر	35.1140087	-1.4366186
161	13	صبرة	Sabra	دائرة صبرة, تلمسان, الجزائر	34.8356861	-1.5656402
162	13	الغزوات	Ghazaouet	دائرة الغزوات, تلمسان, الجزائر	35.0590813	-1.885509
163	13	أولاد ميمون	Ouled Mimoun	دائرة أولاد ميمون, تلمسان, 13010, الجزائر	34.8273153	-1.1049524
164	13	بني سنوس	Beni Snous	دائرة بني سنوس, تلمسان, الجزائر	34.6250566	-1.5009988
165	13	باب العسة	Bab El Assa	دائرة باب العسة, تلمسان, الجزائر	34.9801266	-1.9819739
166	13	فلاوسن	Fellaoucene	دائرة فلاوسن, تلمسان, الجزائر	35.0070341	-1.6242393
167	13	بن سكران	Bensekrane	دائرة بن سكران, تلمسان, الجزائر	35.0524585	-1.1117785
168	13	الحناية	Hennaya	دائرة الحناية, تلمسان, 13009, الجزائر	34.9685441	-1.4480305
169	13	مغنية	Maghnia	دائرة مغنية, تلمسان, الجزائر	34.8721863	-1.8023183
170	13	سبدو	Sebdou	دائرة سبدو, تلمسان, الجزائر	34.4677753	-1.1256164
171	13	بني بوسعيد	Beni Boussaid	دائرة بني بوسعيد, تلمسان, الجزائر	34.652333	-1.7259973
172	13	مرسى بن مهيدي	Marsa Ben Mehdi	دائرة مرسى بن مهيدي, تلمسان, الجزائر	35.0301174	-2.1133662
173	13	ندرومة	Nedroma	دائرة ندرومة, تلمسان, الجزائر	35.0052256	-1.7804644
174	13	سيدي الجيلالي	Sidi Djillali	دائرة سيدي جيلالي, تلمسان, الجزائر	34.3473587	-1.537928
175	13	هنين	Honnaine	دائرة هنين, تلمسان, الجزائر	35.1729562	-1.6183012
176	13	شتوان	Chetouane	دائرة شتوان, تلمسان, الجزائر	34.9515497	-1.2462615
177	13	منصورة	Mansourah	دائرة منصورة, تلمسان, 13061, الجزائر	34.8123516	-1.3391476
178	14	تيارت	Tiaret	دائرة تيارت, تيارت, الجزائر	35.3468431	1.3351707
179	14	مدروسة	Medroussa	دائرة مدروسة, تيارت, الجزائر	35.204433	1.092302
180	14	عين الذهب	Ain Deheb	دائرة عين الذهب, تيارت, الجزائر	34.6139599	1.6541736
181	14	دحموني	Dahmouni	دائرة الدحموني, تيارت, 14040, الجزائر	35.3979774	1.461084
182	14	رحوية	Rahouia	دائرة رحوية, تيارت, الجزائر	35.493047	1.040172
183	14	مهدية	Mahdia	دائرة المهدية, تيارت, الجزائر	35.3121189	1.8188386
184	14	السوقر	Sougueur	دائرة السوقر, تيارت, الجزائر	34.9651795	1.921502
185	14	مغيلة	Meghila	دائرة مغيلة, تيارت, الجزائر	35.578525	1.4948605
186	14	فرندة	Frenda	دائرة فرندة, تيارت, الجزائر	35.1190225	0.8203587
187	14	عين كرمس	Ain Kermes	دائرة عين كرمس, تيارت, 14013, الجزائر	34.6104509	0.9987252
188	14	قصر الشلالة	Ksar Chellala	دائرة قصر الشلالة, تيارت, الجزائر	35.06186	2.3750879
189	14	وادي ليلي	Oued Lili	دائرة وادى ليلى, تيارت, الجزائر	35.5418145	1.25997
190	14	مشرع الصفا	Mechraa Sfa	دائرة مشرع الصفاء, تيارت, 14145, الجزائر	35.3532769	1.0727312
191	14	حمادية	Hamadia	دائرة الحمادية, تيارت, الجزائر	35.3689805	2.0755466
192	15	تيزي وزو	Tizi Ouzou	دائرة تيزي وزو, تيزي وزو, الجزائر	36.6997906	4.0551053
193	15	عين الحمام	Ain El Hammam	عین الحمام, تيزي وزو, الجزائر	36.5523717	4.3032016
194	15	ماكودة	Makouda	ماكودة, تيزي وزو, الجزائر	36.7945077	4.0956555
195	15	ذراع الميزان	Draa El Mizan	ذراع الميزان, تيزي وزو, 15056, الجزائر	36.5741345	3.8724324
196	15	تيزي غنيف	Tizi-Ghenif	تيزي غنيف, تيزي وزو, 15020, الجزائر	36.607605	3.7879506
197	15	إفرحونان	Iferhounene	إيفرحونن, تيزي وزو, الجزائر	36.539074	4.3828093
198	15	عزازقة	Azazga	دائرة عزازڨة, تيزي وزو, الجزائر	36.7399825	4.4125744
199	15	الأربعاء ناث إيراثن	Larbaa Nath Iraten	الأربعاء نايث إيراثن, تيزي وزو, 15002, الجزائر	36.6374918	4.2028466
200	15	تيزي راشد	Tizi Rached	تيزي راشد, تيزي وزو, الجزائر	36.6684396	4.2082486
201	15	واقنون	Ouaguenoun	واقنون, تيزي وزو, الجزائر	36.7831077	4.2349478
202	15	معاتقة	Maatkas	المعاتقة, تيزي وزو, الجزائر	36.6059613	3.9812946
203	15	بني دوالة	Beni Douala	بني دوالة, تيزي وزو, الجزائر	36.6335991	4.0850524
204	15	بوزقن	Bouzeguene	بوزغن, تيزي وزو, 15327, الجزائر	36.6170412	4.477024
205	15	واضية	Ouadhias	واضية, تيزي وزو, 15058, الجزائر	36.5262715	4.0806292
206	15	أزفون	Azeffoun	أزفون, تيزي وزو, الجزائر	36.8380544	4.4239397
207	15	تيقزيرت	Tigzirt	تيقزيرت, تيزي وزو, الجزائر	36.8657436	4.1567067
208	15	بوغني	Boghni	دائرة بوغني, تيزي وزو, الجزائر	36.5142355	3.9723516
209	15	ذراع بن خدة	Draa Ben Khedda	ذراع بن خدة, تيزي وزو, الجزائر	36.7209806	3.9223308
210	15	واسيف	Ouacif	واسيف, تيزي وزو, 15015, الجزائر	36.5141609	4.1856564
211	15	مقلع	Mekla	مقلع, تيزي وزو, الجزائر	36.6767519	4.3053549
212	15	بني يني	Benni Yenni	بني يني, تيزي وزو, الجزائر	36.5326627	4.2645955
213	16	سيدي امحمد	Sidi M'hamed	دائرة سيدي امحمد, الجزائر	36.7585625	3.0563069
214	16	باب الوادي	Bab El Oued	دائرة باب الوادي, الجزائر	36.7970835	3.0445088
215	16	بئر مراد رايس	Bir Mourad Rais	دائرة بئر مراد رايس, الجزائر	36.707037	3.0407515
216	16	بوزريعة	Bouzareah	دائرة بوزريعة, الجزائر	36.7775203	2.9970653
217	16	الحراش	El Harrach	دائرة الحراش, الجزائر	36.7212307	3.1374104
218	16	براقي	Baraki	دائرة براقي, الجزائر	36.6420653	3.1084322
219	16	حسين داي	Hussein Dey	دائرة حسين داي, الجزائر	36.7304133	3.087835
220	16	الدار البيضاء	Dar El Beida	دائرة الدار البيضاء, الجزائر	36.7410334	3.1876652
221	16	بئر توتة	Birtouta	دائرة بئر توتة, الجزائر, 16118, الجزائر	36.6239334	2.9728456
222	16	الرويبة	Rouiba	دائرة الرويبة, الجزائر	36.7426507	3.3106214
223	16	زرالدة	Zeralda	دائرة زرالدة, الجزائر	36.6992818	2.8672842
224	16	الدرارية	Draria	دائرة درارية, الجزائر	36.6895704	2.9735389
225	16	الشراقة	Cheraga	دائرة شراقة, الجزائر	36.7589451	2.9454588
226	17	الجلفة	Djelfa	دائرة الجلفة, الجلفة, الجزائر	34.6659265	3.2103769
227	17	حاسي بحبح	Hassi Bahbah	دائرة حاسي بحبح, الجلفة, الجزائر	34.8699921	3.0253197
228	17	فيض البطمة	Faidh El Botma	دائرة فيض البطمة, الجلفة, الجزائر	33.919874	4.0920806
229	17	بيرين	Birine	دائرة البيرين, الجلفة, 17014, الجزائر	35.5309204	3.1636632
230	17	الادريسية	El Idrissia	دائرة الادريسية, الجلفة, 17020, الجزائر	34.3203516	2.61448
231	17	مسعد	Messaad	مسعد, دائرة مسعد, الجلفة, 17400, الجزائر	34.1515242	3.491664
232	17	سيدي لعجال	Sidi Laadjel	دائرة سيدي لعجال, الجلفة, 17215, الجزائر	35.4048325	2.4987844
233	17	حد الصحاري	Had Sahary	دائرة حد الصحارى, الجلفة, 17001, الجزائر	35.341257	3.4294373
234	17	دار الشيوخ	Dar Chioukh	دائرة دار الشيوخ, الجلفة, 17006, الجزائر	34.873586	3.4349708
235	17	الشارف	Charef	دائرة الشارف, الجلفة, 17015, الجزائر	34.6386995	2.6176778
236	17	عين الإبل	Ain El Ibel	دائرة عين الإبل, الجلفة, الجزائر	34.37955	3.0635186
237	17	عين وسارة	Ain Oussera	دائرة عين وسارة, الجلفة, الجزائر	35.4322271	2.8991312
238	18	جيجل	Jijel	دائرة جيجل, جيجل, الجزائر	36.7952003	5.7416087
239	18	العوانة	El Aouana	دائرة العوانة, جيجل, الجزائر	36.6950874	5.6369784
240	18	زيامة منصورية	Ziamah Mansouriah	دائرة زيامة منصورية, جيجل, الجزائر	36.6151346	5.5122066
241	18	الطاهير	Taher	دائرة الطاهير, جيجل, الجزائر	36.712611	5.9040524
242	18	الشقفة	Chekfa	دائرة الشقفة, جيجل, الجزائر	36.783823	5.9854174
243	18	الميلية	El Milia	دائرة الميلية, جيجل, الجزائر	36.7902981	6.291339
244	18	سيدي معروف	Sidi Marouf	دائرة سيدي معروف, جيجل, 18018, الجزائر	36.6294205	6.2226507
245	18	السطارة	Settara	دائرة السطارة, جيجل, 18113, الجزائر	36.663388	6.4227471
246	18	العنصر	El Ancer	دائرة العنصر, جيجل, 18029, الجزائر	36.7772902	6.1550375
247	18	جيملة	Djimla	دائرة جيملة, جيجل, الجزائر	36.584693	5.8220091
248	18	تاكسنة	Texenna	دائرة تاكسنة, جيجل, الجزائر	36.6956642	5.7708896
249	19	سطيف	Setif	دائرة سطيف, سطيف, 19000, الجزائر	36.1907645	5.4178902
250	19	عين الكبيرة	Ain El Kebira	دائرة عين الكبيرة, سطيف, الجزائر	36.373048	5.5754552
251	19	بني عزيز	Beni Aziz	دائرة بني عزيز, سطيف, 19033, الجزائر	36.4307425	5.7050268
252	19	بئر العرش	Bir El Arch	دائرة بير العرش, سطيف, 19670, الجزائر	36.152718	5.8452003
253	19	بابور	Babor	دائرة بابور, سطيف, الجزائر	36.4975145	5.5493347
254	19	قجال	Guidjel	دائرة قجال, سطيف, الجزائر	36.131926	5.5238577
255	19	العلمة	El Eulma	دائرة العلمة, سطيف, الجزائر	36.135515	5.6950819
256	19	جميلة	Djemila	دائرة جميلة, سطيف, 19023, الجزائر	36.3230875	5.7774303
257	19	بني ورتيلان	Beni Ourtilane	دائرة بني ورتيﻻن, سطيف, الجزائر	36.450559	4.857765
258	19	عين أرنات	Ain Arnat	دائرة عين ارنات, سطيف, الجزائر	36.2167755	5.2502765
259	19	عموشة	Amoucha	دائرة عموشة, سطيف, 19068, الجزائر	36.427017	5.3782664
260	19	عين ولمان	Ain Oulmene	دائرة عين ولمان, سطيف, الجزائر	35.9694754	5.2456326
261	19	بوعنداس	Bouandas	دائرة بوعنداس, سطيف, 19124, الجزائر	36.5190805	5.1195444
262	19	حمام السخنة	Hammam Sokhna	دائرة حمام السخنة, سطيف, 19066, الجزائر	35.9354985	5.8306743
263	19	صالح باي	Salah Bey	دائرة صالح باي, سطيف, الجزائر	35.759599	5.2213285
264	19	عين أزال	Ain Azel	دائرة عين آزال, سطيف, الجزائر	35.896251	5.5815374
265	19	قنزات	Guenzet	دائرة قنزات, سطيف, الجزائر	36.345226	4.8798443
266	19	بوقاعة	Bougaa	دائرة بوقاعة, سطيف, الجزائر	36.303059	5.1467851
267	19	حمام قرقور	Hammam Guergour	دائرة حمام قرقور, سطيف, 19029, الجزائر	36.375821	4.9879952
268	19	ماوكلان	Maoklane	دائرة موكلان, سطيف, الجزائر	36.424463	5.1138394
269	20	سعيدة	Saida	دائرة سعيدة, سعيدة, الجزائر	34.8436667	0.128284
270	20	عين الحجر	Ain El Hadjar	دائرة عين الحجر, سعيدة, الجزائر	34.5933955	0.1726177
271	20	يوب	Youb	دائرة يوب, سعيدة, الجزائر	34.8856024	-0.1325325
272	20	سيدي بوبكر	Sidi Boubekeur	دائرة سيدي بوبكر, سعيدة, 20004, الجزائر	34.9890487	0.0785656
273	20	الحساسنة	El Hassasna	دائرة الحساسنة, سعيدة, الجزائر	34.6129565	0.5811997
274	20	أولاد ابراهيم	Ouled Brahim	أولاد ابراھيم, دائرة أولاد براهيم, سعيدة, 20221, الجزائر	34.9853876	0.4786462
275	21	سكيكدة	Skikda	دائرة سكيكدة, سكيكدة, الجزائر	36.8604805	6.964892
276	21	الحدائق	El Hadaiek	دائرة الحدائق, سكيكدة, الجزائر	36.8580032	6.7988041
277	21	عزابة	Azzaba	دائرة عزابة, سكيكدة, الجزائر	36.7361437	7.1589517
278	21	بن عزوز	Ben Azzouz	دائرة بن عزوز, سكيكدة, الجزائر	36.8425767	7.29675
279	21	القل	Collo	دائرة القل, سكيكدة, الجزائر	36.9723552	6.5440995
280	21	أولاد عطية	Ouled Attia	دائرة أوالد عطية, سكيكدة, 21012, الجزائر	36.9652571	6.3380911
281	21	الزيتونة	Zitouna	دائرة الزيتونة, سكيكدة, الجزائر	37.0155817	6.4466054
282	21	الحروش	El Harrouch	دائرة الحروش, سكيكدة, الجزائر	36.5961607	6.8675494
283	21	سيدي مزغيش	Sidi Mezghiche	دائرة سيدي مزغيش, سكيكدة, الجزائر	36.66909	6.6708892
284	21	رمضان جمال	Ramdane Djamel	دائرة رمضان جمال, سكيكدة, 21425, الجزائر	36.7684084	6.9061613
285	21	تمالوس	Tamalous	دائرة تمالوس, سكيكدة, الجزائر	36.8626523	6.6519287
286	21	عين قشرة	Ain Kechra	دائرة عين كرشة, أم البواقي, 04006, الجزائر	35.8959742	6.6672585
287	21	أم الطوب	Oum Toub	دائرة أم الطوب, سكيكدة, الجزائر	36.7003588	6.5076167
288	22	سيدي بلعباس	Sidi Bel Abbes	دائرة سيدي بلعباس, سيدي بلعباس, الجزائر	35.205684	-0.62854
289	22	تسالة	Tessala	دائرة تسالة, سيدي بلعباس, الجزائر	35.2620465	-0.7493467
290	22	مصطفى بن ابراهيم	Mostefa Ben Brahim	دائرة مصطفى بن إبراهيم, سيدي بلعباس, 22068, الجزائر	35.1861523	-0.4284265
291	22	تلاغ	Telagh	دائرة تلاغ, سيدي بلعباس, الجزائر	34.7515998	-0.554549
292	22	سيدي علي بوسيدي	Sidi Ali Boussidi	دائرة سيدي علي بوسيدي, سيدي بلعباس, الجزائر	35.102023	-0.8842591
293	22	مرحوم	Marhoum	دائرة مرحوم, سيدي بلعباس, الجزائر	34.2883425	-0.2466109
294	22	سيدي لحسن	Sidi Lahcene	دائرة سيدي لحسن, سيدي بلعباس, الجزائر	35.1345915	-0.6953402
295	22	تنيرة	Tenira	دائرة تنيرة, سيدي بلعباس, الجزائر	35.0165167	-0.4368861
296	22	مولاي سليسن	Moulay Slissen	دائرة مولاى سليسن, سيدي بلعباس, الجزائر	34.7792051	-0.7907443
297	22	مرين	Merine	دائرة مرين, سيدي بلعباس, الجزائر	34.67029	-0.3186243
298	22	راس الماء	Ras El Ma	دائرة رأس الماء, سيدي بلعباس, 22005, الجزائر	34.4447788	-0.7645686
299	22	عين البرد	Ain El Berd	دائرة عين البرد, سيدي بلعباس, الجزائر	35.3441495	-0.5079279
300	22	سفيزف	Sfisef	دائرة سفيزف, سيدي بلعباس, الجزائر	35.2358879	-0.264477
301	22	بن باديس	Ben Badis	دائرة بن باديس, سيدي بلعباس, الجزائر	34.9695291	-0.8724313
302	22	سيدي علي بن يوب	Sidi Ali Ben Youb	دائرة سيدي على بن يوب, سيدي بلعباس, 22008, الجزائر	34.9976899	-0.7166299
303	23	عنابة	Annaba	دائرة عنابة, عنابة, 23000, الجزائر	36.9388757	7.6638355
304	23	برحال	Berrahal	برحال, عنابة, 23009, الجزائر	36.8930255	7.4790502
305	23	الحجار	El Hadjar	دائرة عين الحجر, سعيدة, الجزائر	34.5933955	0.1726177
306	23	البوني	El Bouni	البوني, عنابة, الجزائر	36.8409039	7.7474307
307	23	عين الباردة	Ain El Berda	عين الباردة, عنابة, الجزائر	36.6973685	7.517287
308	23	شطايبي	Chetaibi	شطايبي, عنابة, الجزائر	37.0119395	7.4025879
309	24	قالمة	Guelma	دائرة قالمة, قالمة, الجزائر	36.4172653	7.3734767
310	24	وادي الزناتي	Oued Zenati	دائرة وادي الزناتي, قالمة, 24300, الجزائر	36.3426106	7.0971678
311	24	عين مخلوف	Ain Makhlouf	دائرة عين مخلوف, قالمة, الجزائر	36.1922955	7.1612139
312	24	خزارة	Khezaras	لخزارة, دائرة لخزارة, قالمة, 24016, الجزائر	36.3681295	7.5278729
313	24	قلعة بوصبع	Guelaat Bousbaa	دائرة قلعة بوصبع, قالمة, الجزائر	36.5138038	7.5521246
314	24	حمام دباغ	Hammam Debagh	دائرة حمام دباغ, قالمة, الجزائر	36.5323045	7.1880466
315	24	حمام النبايل	Hammam N'bails	دائرة حمام النبايل, قالمة, الجزائر	36.3225863	7.7165513
316	24	بوشقوف	Bouchegouf	دائرة بوشقوف, قالمة, الجزائر	36.5262661	7.7964995
317	24	هيليوبوليس	Heliopolis	دائرة هيليوبوليس, قالمة, الجزائر	36.5667145	7.3658787
318	24	هواري بومدين	Houari Boumédiène	دائرة هواري بومدين, قالمة, 24025, الجزائر	36.4080945	7.2495686
319	25	قسنطينة	Constantine	دائرة قسنطينة, قسنطينة, الجزائر	36.3539864	6.6051127
320	25	حامة بوزيان	Hamma Bouziane	حامة بوزيان, قسنطينة, الجزائر	36.446551	6.621544
321	25	زيغود يوسف	Zighoud Youcef	زيغود يوسف, قسنطينة, 25200, الجزائر	36.5290345	6.669693
322	25	الخروب	El Khroub	الخروب, قسنطينة, الجزائر	36.2546825	6.6115435
323	25	عين عبيد	Ain Abid	عين عبيد, قسنطينة, 25015, الجزائر	36.2956436	6.9048084
324	25	ابن زياد	Ibn Ziad	ابن زياد, قسنطينة, الجزائر	36.4047075	6.4396157
325	26	المدية	Medea	دائرة المدية, المدية, الجزائر	36.3003697	2.7014108
326	26	وزرة	Ouzera	دائرة وزرة, المدية, 26140, الجزائر	36.2752109	2.886575
327	26	عين بوسيف	Ain Boucif	دائرة عين بوسيف, المدية, 26500, الجزائر	35.8269355	3.186027
328	26	العمارية	El Omaria	دائرة العمارية, المدية, الجزائر	36.3062932	3.0086889
329	26	القلب الكبير	Guelb El Kebir	دائرة القلب الكبير, المدية, الجزائر	36.2359996	3.4671985
330	26	شلالة العذاورة	Chellalat El Adhaoura	دائرة شلالة العذاورة, المدية, الجزائر	35.8481355	3.4804545
331	26	سيدي نعمان	Sidi Naamane	دائرة سيدي نعمان, المدية, الجزائر	36.2247317	3.104867
332	26	عزيز	Aziz	دائرة عزيز, المدية, 26040, الجزائر	35.7692065	2.4679614
333	26	السواقي	Souaghi	دائرة السواقي, المدية, 26020, الجزائر	36.0695155	3.3086262
334	26	قصر البخاري	Ksar El Boukhari	دائرة قصر البخاري, المدية, 26300, الجزائر	35.8774648	2.8460591
335	26	العزيزية	El Azizia	دائرة العزيزية, المدية, 26018, الجزائر	36.3670131	3.4751784
336	26	الشهبونية	Chahbounia	دائرة الشهبونية, المدية, الجزائر	35.6373505	2.718092
337	26	عوامري	Ouamri	دائرة وامري, المدية, 26043, الجزائر	36.219671	2.6079296
338	26	سي المحجوب	Si Mahdjoub	دائرة سي المحجوب, المدية, الجزائر	36.1324366	2.6971521
339	26	بني سليمان	Beni Slimane	دائرة بني سليمان, المدية, 26001, الجزائر	36.2208771	3.2663293
340	26	البرواقية	Berrouaghia	دائرة البرواقية, المدية, الجزائر	36.0834816	3.0682653
341	26	سغوان	Seghouane	دائرة سغوان, المدية, الجزائر	36.0269302	2.9051898
342	26	تابلاط	Tablat	دائرة تابلاط, المدية, الجزائر	36.4032295	3.2882622
343	26	أولاد عنتر	Ouled Antar	دائرة أولاد عنتر, المدية, الجزائر	35.9722484	2.6095488
344	27	مستغانم	Mostaganem	دائرة مستغانم, مستغانم, 27000, الجزائر	35.9746418	0.1082708
345	27	عين نويسي	Ain Nouicy	دائرة عين نويسي, مستغانم, 27020, الجزائر	35.7593033	0.0198239
346	27	حاسي ماماش	Hassi Mameche	دائرة حاسي مماش, مستغانم, الجزائر	35.845365	0.0658157
347	27	عين تادلس	Ain Tedeles	دائرة عين تادلس, مستغانم, الجزائر	35.9808608	0.3423111
348	27	خير الدين	Kheir Eddine	دائرة خير الدين, مستغانم, الجزائر	35.952711	0.1572338
349	27	سيدي علي	Sidi Ali	سيدي على, دائرة سيدي علي, مستغانم, 27002, الجزائر	36.0935918	0.4189805
350	27	سيدي لخضر	Sidi Lakhdar	دائرة سيدي لخضر, مستغانم, الجزائر	36.1318887	0.3232878
351	27	عشعاشة	Achaacha	دائرة عشعاشة, مستغانم, 27027, الجزائر	36.2326083	0.5945339
352	27	بوقيراط	Bouguirat	دائرة بوقيراط, مستغانم, الجزائر	35.8014465	0.2925261
353	27	ماسرة	Mesra	دائرة ماسرى, مستغانم, الجزائر	35.8438773	0.2034498
354	28	المسيلة	M'sila	دائرة المسيلة, المسيلة, 28000, الجزائر	35.7226139	4.50622
355	28	حمام الضلعة	Hammam Dalaa	دائرة حمام الضلعة, المسيلة, الجزائر	35.8397499	4.2818023
356	28	أولاد دراج	Ouled Derradj	دائرة أولاد دراج, المسيلة, الجزائر	35.6216653	4.7400851
357	28	خبانة	Khoubana	دائرة خبانة, المسيلة, الجزائر	35.2522051	4.5748521
358	28	شلال	Chellal	دائرة شلال, المسيلة, الجزائر	35.5555777	4.4130881
359	28	مقرة	Magra	دائرة مقرة, المسيلة, الجزائر	35.6272267	5.1380762
360	28	سيدي عيسى	Sidi Aissa	دائرة سيدي عيسى, المسيلة, 28003, الجزائر	35.7267446	3.6990687
361	28	عين الحجل	Ain El Hadjel	دائرة عين الحجل, المسيلة, الجزائر	35.7004463	4.0001918
362	28	بوسعادة	Bousaada	دائرة بوسعادة, المسيلة, الجزائر	35.1899041	4.1669275
363	28	أولاد سيدي ابراهيم	Ouled Sidi Brahim	دائرة أولاد سيدي ابراھيم, المسيلة, الجزائر	35.430761	4.0937083
364	28	سيدي عامر	Sidi Ameur	دائرة سيدي عامر, المسيلة, الجزائر	35.2975285	3.866271
365	28	بن سرور	Ben Srour	دائرة بن سرور, المسيلة, الجزائر	34.9629595	4.6449641
366	28	عين الملح	Ain El Melh	دائرة عين الملح, المسيلة, 28066, الجزائر	34.5716748	4.0611957
367	28	امجدل	Medjedel	دائرة مجدل, المسيلة, 28016, الجزائر	35.0874251	3.6892153
368	28	جبل مساعد	Djebel Messaad	دائرة جبل مسعد, المسيلة, الجزائر	34.9654047	4.053512
369	29	معسكر	Mascara	دائرة معسكر, معسكر, الجزائر	35.3828213	0.1535005
370	29	بوحنيفية	Bouhanifia	دائرة بوحنيفية, معسكر, الجزائر	35.3766731	-0.0808919
371	29	تيزي	Tizi	تيزي, دائرة تيزي, معسكر, الجزائر	35.3115859	0.0742378
372	29	تيغنيف	Tighennif	دائرة تيغنيف, معسكر, الجزائر	35.3922379	0.341667
373	29	الحشم	Hachem	دائرة الهاشم, معسكر, الجزائر	35.3046887	0.5256924
374	29	وادي الأبطال	Oued El Abtal	دائرة وادي الأبطال, معسكر, الجزائر	35.3992681	0.7863922
375	29	غريس	Ghriss	دائرة غريس, معسكر, 29006, الجزائر	35.2858596	0.2474324
376	29	البرج	El Bordj	البرج, دائرة البرج, معسكر, الجزائر	35.4981797	0.3344689
377	29	عين فكان	Ain Fekan	دائرة عين فكان, معسكر, الجزائر	35.179092	-0.0729621
378	29	وادي التاغية	Oued Taria	دائرة وادي التاغية, معسكر, الجزائر	35.1539648	0.1293149
379	29	عوف	Aouf	دائرة عوف, معسكر, 29021, الجزائر	35.1118064	0.3395349
380	29	عين فارس	Ain Fares	دائرة عين فارس, معسكر, الجزائر	35.4747089	0.1966172
381	29	سيق	Sig	دائرة سيق, معسكر, الجزائر	35.48092	-0.162281
382	29	عقاز	Oggaz	دائرة عقاز, معسكر, الجزائر	35.6167613	-0.2450417
383	29	زهانة	Zahana	دائرة زهانة, معسكر, الجزائر	35.4664155	-0.3702866
384	29	المحمدية	Mohammadia	دائرة المحمدية, معسكر, 29002, الجزائر	35.6415385	0.0615856
385	30	ورقلة	Ouargla	دائرة ورقلة, ورقلة, الجزائر	31.7588075	4.8867005
386	30	انقوسة	N'goussa	دائرة النقوسة, ورقلة, 30000, الجزائر	32.3433899	5.3404048
387	30	حاسي مسعود	Hassi Messaoud	دائرة حاسي مسعود, ورقلة, الجزائر	30.5588473	5.4530912
388	30	سيدي خويلد	Sidi Khouiled	دائرة سيدي خويلد, ورقلة, الجزائر	31.9807462	5.6822798
390	55	الحجيرة	El-Hadjira	دائرة الحجيرة, ورقلة, 30053, الجزائر	32.948529	5.4640147
394	30	البرمة	El Borma	دائرة البرمة, ورقلة, الجزائر	31.1770225	7.9951119
396	31	وهران	Oran	دائرة وهران, وهران, الجزائر	35.7074027	-0.6337145
397	31	قديل	Gdyel	دائرة قديل, وهران, الجزائر	35.7743601	-0.4228291
398	31	بئر الجير	Bir El Djir	دائرة بئر الجير, وهران, الجزائر	35.7255779	-0.5173109
399	31	السانية	Es Senia	دائرة السانية, وهران, الجزائر	35.6106068	-0.6145113
400	31	أرزيو	Arzew	دائرة أرزيو, وهران, 31200, الجزائر	35.8540549	-0.381833
401	31	بطيوة	Bethioua	دائرة بطيوة, وهران, الجزائر	35.742801	-0.2245085
402	31	عين الترك	Ain Turk	دائرة عين الترك, وهران, الجزائر	35.7019967	-0.855404
403	31	وادي تليلات	Oued Tlelat	دائرة وادي تليلات, وهران, 31070, الجزائر	35.522331	-0.537262
404	31	بوتليليس	Boutlelis	دائرة بوتليليس, وهران, الجزائر	35.5746152	-0.7972154
405	32	البيض	El Bayadh	دائرة البيض, البيض, الجزائر	33.6378523	1.0122039
406	32	رقاصة	Rogassa	دائرة الرقاصة, البيض, الجزائر	34.0220315	0.8846063
407	32	بريزينة	Brezina	دائرة برزينة, البيض, الجزائر	32.6720105	1.7174419
408	32	بوعلام	Boualem	دائرة بوعلام, البيض, الجزائر	33.651497	1.4969876
409	32	الأبيض سيدي الشيخ	Labiodh Sidi Cheikh	دائرة الأبيض سيدي الشيخ, البيض, الجزائر	32.1364055	0.6643316
410	32	بوقطب	Bougtob	دائرة بوقطب, البيض, 32010, الجزائر	33.9706367	0.2792788
411	32	بوسمغون	Boussemghoun	دائرة بوسمغون, البيض, 32014, الجزائر	32.8081869	0.0635802
412	32	شلالة	Chellala	شلالة, دائرة شلالة, البيض, الجزائر	33.0087595	0.0894028
413	33	إيليزي	Illizi	دائرة إليزي, إليزي, 33000, الجزائر	26.4880835	8.3571492
415	33	إن أمناس	In Amenas	دائرة عين أمناس, إليزي, الجزائر	28.4114685	7.7865255
417	34	برج بوعريريج	Bordj Bou Arreridj	دائرة برج بوعريريج, برج بوعريريج, الجزائر	36.0677603	4.7453289
418	34	رأس الوادي	Ras El Oued	دائرة رأس الوادي, برج بوعريريج, 34001, الجزائر	35.9703362	5.0245131
419	34	برج زمورة	Bordj Zemmoura	دائرة برج زمورة, برج بوعريريج, الجزائر	36.2544936	4.8466147
420	34	المنصورة	Mansourah	منصورة, دائرة المنصورة, برج بوعريريج, الجزائر	36.0764868	4.4642629
421	34	عين تاغروت	Ain Taghrout	دائرة عين تاغروت, برج بوعريريج, الجزائر	36.0941029	5.1137753
422	34	برج الغدير	Bordj Ghedir	دائرة برج الغدير, برج بوعريريج, الجزائر	35.9194499	4.9184805
423	34	الحمادية	El Hamadia	دائرة الحمادية, برج بوعريريج, 34050, الجزائر	35.9223341	4.6934349
424	34	مجانة	Medjana	دائرة مجانة, برج بوعريريج, الجزائر	36.1374901	4.7060543
425	34	جعافرة	Djaafra	دائرة الجعافرة, برج بوعريريج, 34018, الجزائر	36.3166651	4.6805524
426	34	بئر قاصد علي	Bir Kasdali	دائرة بئر قصد علي, برج بوعريريج, الجزائر	36.176575	4.9903214
427	35	بومرداس	Boumerdes	دائرة بومرداس, بومرداس, الجزائر	36.7255762	3.4738909
428	35	بودواو	Boudouaou	دائرة بودواو, بومرداس, الجزائر	36.665054	3.446206
429	35	برج منايل	Bordj Menaiel	دائرة برج منايل, بومرداس, الجزائر	36.7881131	3.6725105
430	35	بغلية	Baghlia	دائرة بغلية, بومرداس, 35055, الجزائر	36.8317993	3.8744318
431	35	الناصرية	Naciria	دائرة الناصرية, بومرداس, الجزائر	36.755494	3.8180122
432	35	يسر	Isser	دائرة يسر, بومرداس, الجزائر	36.6705537	3.7334201
433	35	الثنية	Thenia	دائرة الثنية, بومرداس, 35006, الجزائر	36.68812	3.5777167
434	35	دلس	Dellys	دائرة دلس, بومرداس, الجزائر	36.865675	3.9531068
435	35	خميس الخشنة	Khemis El Khechna	دائرة خميس الخشنة, بومرداس, الجزائر	36.6349652	3.3423554
436	36	الطارف	El Tarf	دائرة الطارف, الطارف, الجزائر	36.6955206	8.3407578
437	36	بوحجار	Bouhadjar	دائرة بوحجار, الطارف, الجزائر	36.5094512	8.0586867
438	36	بن مهيدي	Ben M'hidi	دائرة بن مهيدي, الطارف, الجزائر	36.801506	7.9247431
439	36	القالة	El Kala	دائرة القالة, الطارف, الجزائر	36.8624675	8.4341963
440	36	بوثلجة	Bouteldja	دائرة بوثلجة, الطارف, الجزائر	36.718572	8.1272982
441	36	الذرعان	Drean	الذرعان, الطارف, الجزائر	36.655211	7.8218487
442	36	البسباس	Besbes	البسباس, الطارف, الجزائر	36.6765165	7.9711008
443	37	تندوف	Tindouf	دائرة تندوف, تندوف, الجزائر	27.543907	-6.2399251
444	38	تيسمسيلت	Tissemsilt	دائرة تسمسيلت, تسمسيلت, 38000, الجزائر	35.6474289	1.8300235
445	38	برج بونعامة	Bordj Bounaama	دائرة برج بونعامة, تسمسيلت, 38001, الجزائر	35.8244638	1.7280284
446	38	ثنية الاحد	Theniet El Had	دائرة ثنية الأحد, تسمسيلت, 38200, الجزائر	35.8470198	1.9670612
447	38	الأزهرية	Lazharia	دائرة الأزهرية, تسمسيلت, 38005, الجزائر	35.9502535	1.5647287
448	38	لرجام	Lardjem	دائرة لرجام, تسمسيلت, الجزائر	35.760659	1.4502798
449	38	برج الأمير عبد القادر	Bordj Emir Abdelkader	دائرة برج الأمير عبد القادر, تسمسيلت, الجزائر	35.8412285	2.2167871
450	38	خميستي	Khemisti	دائرة خميستى, تسمسيلت, 38100, الجزائر	35.6733874	2.0108996
451	38	عماري	Ammari	دائرة عماري, تسمسيلت, الجزائر	35.6606452	1.6421827
452	16	الوادي	El Oued	دائرة باب الوادي, الجزائر	36.7970835	3.0445088
453	39	الرباح	Robbah	الرباح, دائرة الرباح, الوادي, الجزائر	32.9931021	7.1091516
454	39	البياضة	Bayadha	الرباح, دائرة البياضة, الوادي, 39150, الجزائر	33.3124053	6.8992412
455	39	قمار	Guemar	دائرة قمار, الوادي, الجزائر	33.7011649	6.7465826
456	39	الرقيبة	Reguiba	دائرة الرقيبة, الوادي, الجزائر	33.9575465	6.3609636
457	39	الدبيلة	Debila	دائرة الدبيلة, الوادي, الجزائر	33.4898309	6.9152254
458	39	حاسي خليفة	Hassi Khalifa	دائرة حاسي خليفة, الوادي, الجزائر	33.5951494	7.0921889
459	39	الطالب العربي	Taleb Larbi	دائرة الطالب العربي, الوادي, الجزائر	33.171028	7.605877
460	39	المقرن	Magrane	دائرة المقرن, الوادي, الجزائر	33.8516951	6.862935
461	39	اميه وانسة	Mih Ouensa	دائرة اميه ونسة, الوادي, الجزائر	33.0130525	6.7203581
465	40	خنشلة	Khenchela	دائرة خنشلة, خنشلة, الجزائر	35.4362273	7.1400045
466	40	قايس	Kais	دائرة قايس, خنشلة, الجزائر	35.5160029	6.8831538
467	40	الحامة	El Hamma	دائرة الحامة, خنشلة, الجزائر	35.3526066	7.0010964
468	40	عين الطويلة	Ain Touila	دائرة عين الطويلة, خنشلة, الجزائر	35.5086405	7.3701257
469	40	بوحمامة	Bouhmama	دائرة بوحمامة, خنشلة, 40007, الجزائر	35.2590539	6.7045304
470	40	ششار	Chechar	دائرة ششار, خنشلة, الجزائر	34.9366055	6.8930011
471	40	بابار	Babar	دائرة بابار, خنشلة, 40006, الجزائر	34.7635956	7.2845989
472	40	أولاد رشاش	Ouled Rechache	دائرة اولاد رشاش, خنشلة, الجزائر	35.244524	7.3041995
473	41	سوق أهراس	Souk Ahras	دائرة سوق أهراس, سوق أهراس, 41000, الجزائر	36.2825665	7.963197
474	41	سدراتة	Sedrata	دائرة سدراتة, سوق أهراس, 41200, الجزائر	36.1467205	7.546656
475	41	المشروحة	Mechroha	دائرة المشروحة, سوق أهراس, الجزائر	36.3348865	7.9015494
476	41	أولاد إدريس	Ouled Driss	دائرة اولاد إدريس, سوق أهراس, الجزائر	36.3793372	8.1283146
477	41	تاورة	Taoura	دائرة تاورة, سوق أهراس, الجزائر	36.1149684	7.9628931
478	41	الحدادة	Haddada	المراهنة, دائرة المراهنة, سوق أهراس, 41005, الجزائر	36.2665136	8.249488
479	41	المراهنة	Merahna	دائرة المراهنة, سوق أهراس, 41005, الجزائر	36.1541226	8.1710709
480	41	بئر بوحوش	Bir Bouhouche	دائرة بئر بوحوش, سوق أهراس, الجزائر	36.0329191	7.4691075
481	41	مداوروش	M'daourouche	دائرة مداوروش, سوق أهراس, الجزائر	36.1149684	7.7196545
482	41	أم العظايم	Oum El Adhaim	دائرة أم الغظائم, سوق أهراس, 41019, الجزائر	35.9502198	7.7517415
483	42	تيبازة	Tipaza	دائرة تيبازة, تيبازة, 42000, الجزائر	36.5968983	2.3969364
484	42	حجوط	Hadjout	دائرة حجوط, تيبازة, الجزائر	36.486171	2.3931656
485	42	سيدي أعمر	Sidi Amar	دائرة سيدي عمار, تيبازة, الجزائر	36.5197291	2.2357214
486	42	قوراية	Gouraya	دائرة قوراية, تيبازة, 42007, الجزائر	36.4949056	1.9365075
487	42	شرشال	Cherchell	دائرة شرشال, تيبازة, الجزائر	36.5263623	2.1206488
488	42	الداموس	Damous	دائرة الداموس, تيبازة, 42014, الجزائر	36.4630203	1.7291255
489	42	فوكة	Fouka	دائرة فوكة, تيبازة, الجزائر	36.6704983	2.774461
490	42	بواسماعيل	Bou Ismail	دائرة بو إسماعيل, تيبازة, الجزائر	36.6194458	2.6793707
491	42	أحمر العين	Ahmar El Ain	دائرة حمر العين, تيبازة, الجزائر	36.4963454	2.5293745
492	42	القليعة	Kolea	دائرة القليعة, تيبازة, الجزائر	36.5868041	2.7059642
493	43	ميلة	Mila	دائرة ميلة, ميلة, الجزائر	36.451941	6.262331
494	43	فرجيوة	Ferdjioua	دائرة فرجيوة, ميلة, الجزائر	36.40473	5.9627452
495	43	شلغوم العيد	Chelghoum Laid	دائرة شلغوم العيد, ميلة, الجزائر	36.221681	6.2295973
496	43	التلاغمة	Teleghma	تلاغمة, ميلة, الجزائر	36.0939555	6.3221003
497	43	تاجنانت	Tadjenanet	دائرة تاجنانت, ميلة, الجزائر	36.0751375	6.0871127
498	43	وادي النجاء	Oued Endja	دائرة وادي النجاء, ميلة, الجزائر	36.4092595	6.13139
499	43	بوحاتم	Bouhatem	دائرة بوحاتم, ميلة, 43001, الجزائر	36.308022	5.9829181
500	43	الرواشد	Rouached	دائرة الرواشد, ميلة, الجزائر	36.439737	6.0249627
501	43	القرارم قوقة	Grarem Gouga	دائرة القرارم قوقة, ميلة, الجزائر	36.5555585	6.387377
502	43	سيدي مروان	Sidi Merouane	دائرة سيدي مروان, ميلة, الجزائر	36.5498025	6.2348668
503	43	تسدان حدادة	Tassadane Haddada	دائرة تسدان حدادة, ميلة, 43036, الجزائر	36.5150072	5.8459182
504	43	ترعي باينان	Terrai Bainen	دائرة ترعي باينان, ميلة, الجزائر	36.552894	6.0842574
505	43	عين البيضاء أحريش	Ain Beida Harriche	دائرة عين البيضاء حريش, ميلة, الجزائر	36.414357	5.851766
506	44	عين الدفلى	Ain Defla	دائرة عين الدفلى, عين الدفلى, 44000, الجزائر	36.2539307	1.9535879
507	44	مليانة	Miliana	دائرة مليانة, عين الدفلى, الجزائر	36.3503353	2.1702679
508	44	بومدفع	Boumedfaa	دائرة بومدفع, عين الدفلى, الجزائر	36.3388696	2.5170447
509	44	خميس	Khemis	دائرة خميس مليانة, عين الدفلى, الجزائر	36.2574793	2.1838657
510	44	حمام ريغة	Hammam Righa	دائرة حمام ريغة, عين الدفلى, الجزائر	36.3484573	2.3272551
511	44	جليدة	Djelida	دائرة جليدة, عين الدفلى, الجزائر	36.1221322	2.0099799
512	44	العامرة	El Amra	دائرة العامرة, عين الدفلى, الجزائر	36.3463709	1.9430469
513	44	العطاف	El Attaf	دائرة العطاف, عين الدفلى, الجزائر	36.1763753	1.6548415
514	44	العبادية	El Abadia	دائرة العبادية, عين الدفلى, الجزائر	36.3418875	1.6677104
515	44	جندل	Djendel	دائرة جندل, عين الدفلى, الجزائر	36.1792058	2.4850058
516	44	عين الاشياخ	Ain Lechiakh	عين لشياخ, دائرة عين لشياخ, عين الدفلى, الجزائر	36.1220983	2.4054963
517	44	الروينة	Rouina	دائرة الروينة, عين الدفلى, الجزائر	36.1396387	1.7936128
518	44	برج الأمير خالد	Bordj El Emir Khaled	برج الأمير خالد, دائرة برج األمير خالد, عين الدفلى, الجزائر	36.1200332	2.2045088
519	44	بطحية	Bathia	دائرة بطحية, عين الدفلى, 44041, الجزائر	35.9847489	1.857766
520	45	النعامة	Naama	دائرة النعامة, النعامة, 45000, الجزائر	33.2840315	-0.2948217
521	45	المشرية	Mecheria	دائرة مشرية, النعامة, الجزائر	33.5281384	-0.1958471
522	45	عين الصفراء	Ain Sefra	دائرة عين الصفراء, النعامة, الجزائر	32.8260603	-0.4962341
523	45	سفيسيفة	Sfissifa	دائرة صفيصيفة, النعامة, الجزائر	32.7879643	-1.0150328
524	45	مغرار	Moghrar	دائرة مغرار, النعامة, الجزائر	32.4177727	-0.7397488
525	45	عسلة	Asla	دائرة عسلة, النعامة, الجزائر	32.718689	-0.1574112
526	45	مكمن بن عمار	Mekmen Ben Amar	دائرة مكمن بن عمار, النعامة, الجزائر	33.636514	-1.1284987
527	46	عين تموشنت	Ain Temouchent	دائرة عين تموشنت, عين تموشنت, الجزائر	35.2884551	-1.1579737
528	46	حمام بوحجر	Hammam Bou Hadjar	دائرة حمام بوحجر, عين تموشنت, الجزائر	35.3325666	-0.9879773
529	46	عين الأربعاء	Ain Larbaa	دائرة عين الأربعاء, عين تموشنت, الجزائر	35.4141695	-0.7737334
530	46	المالح	El Maleh	دائرة المالح, عين تموشنت, الجزائر	35.3659979	-1.1613897
531	46	العامرية	El Amria	دائرة العامرية, عين تموشنت, الجزائر	35.5182778	-1.0935563
532	46	عين الكيحل	Ain Kihel	دائرة عين الكيحل, عين تموشنت, 46010, الجزائر	35.192487	-1.1147879
533	46	بني صاف	Beni Saf	دائرة بني صاف, عين تموشنت, الجزائر	35.2774738	-1.3656709
534	46	ولهاصة الغرابة	Oulhassa Gheraba	دائرة ولهاصة, عين تموشنت, 46024, الجزائر	35.2247795	-1.4967782
535	47	غرداية	Ghardaia	دائرة غرداية, غرداية, الجزائر	32.5875526	3.7190912
537	47	ضاية بن ضحوة	Dhayet Ben Dhahoua	دائرة ضاية بن ضحوة, غرداية, 47026, الجزائر	32.6599066	3.3483649
538	47	بريان	Berriane	دائرة بريان, غرداية, الجزائر	32.889794	3.7606468
539	47	متليلي	Metlili	دائرة متليلي الشعانبة, غرداية, الجزائر	32.2748258	3.4498756
540	47	القرارة	El Guerrara	دائرة القرارة, غرداية, الجزائر	32.7694359	4.5605514
541	47	زلفانة	Zelfana	دائرة زلفانة, غرداية, 47007, الجزائر	32.4135225	4.3103437
542	47	بونورة	Bounoura	دائرة بونورة, غرداية, الجزائر	32.5361503	3.9651712
545	48	غليزان	Relizane	دائرة غليزان, غليزان, الجزائر	35.6811988	0.5425686
546	48	وادي رهيو	Oued Rhiou	دائرة وادي ارهيو, غليزان, الجزائر	35.9704629	0.9525094
547	48	الحمادنة	El H'madna	دائرة الحمادنة, غليزان, الجزائر	35.8462255	0.659111
548	48	سيدي أمحمد بن علي	Sidi M'hamed Ben Ali	دائرة سيدي محمد بن علي, غليزان, الجزائر	36.1260845	0.7360258
549	48	عمي موسى	Ammi Moussa	دائرة عمي موسى, غليزان, الجزائر	35.826951	0.9667367
550	48	زمورة	Zemmoura	زمورة, دائرة زمورة, غليزان, 48000, الجزائر	35.7176209	0.7540696
551	48	جديوية	Djidiouia	دائرة جديوية, غليزان, الجزائر	35.9625886	0.7273952
552	48	المطمر	El Matmar	دائرة المطمر, غليزان, الجزائر	35.5708259	0.6215484
553	48	عين طارق	Ain Tarek	دائرة عين طارق, غليزان, 48015, الجزائر	35.7302085	1.1809267
554	48	مازونة	Mazouna	دائرة مازونة, غليزان, الجزائر	36.1000894	0.8684377
555	48	يلل	Yellel	دائرة يلل, غليزان, الجزائر	35.6796055	0.3598294
556	48	الرمكة	Ramka	دائرة الرمكة, غليزان, 48024, الجزائر	35.8761311	1.3062371
557	48	منداس	Mendes	مندس, دائرة مندس, غليزان, الجزائر	35.6507899	0.8644816
2	49	شروين	Charouine	دائرة شروين, تيميمون, الجزائر	29.4040975	-0.2678003
5	49	تيميمون	Timimoun	دائرة تيميمون, تيميمون, الجزائر	29.6911885	1.5554457
9	49	تنركوك	Tinerkouk	دائرة تنيركوك, تيميمون, 01013, الجزائر	30.461939	1.0783846
10	49	أوقروت	Aougrout	دائرة أوقروت, تيميمون, الجزائر	28.916786	0.9344106
12	49	تيميمون (ولاية منتدبة)	Timimoun (Wilaya Déléguée)	دائرة تيميمون, تيميمون, الجزائر	29.6911885	1.5554457
11	50	برج باجي مختار	Bordj Badji Mokhtar	دائرة برج باجي مختار, برج باجي مختار, 01010, الجزائر	22.6261461	0.1275817
13	50	برج باجي مختار (ولاية منتدبة)	Bordj Badji Mokhtar (Wilaya Déléguée)	دائرة برج باجي مختار, برج باجي مختار, 01010, الجزائر	22.6261461	0.1275817
103	51	أولاد خضير	Ouled Khodeir	دائرة أولاد خدير, بني عباس, الجزائر	29.2275818	-0.945988
105	51	بني عباس	Beni Abbes	دائرة بني عباس, بني عباس, 08300, الجزائر	30.108921	-2.4622548
107	51	إقلي	Igli	دائرة إقلي, بني عباس, 08021, الجزائر	30.4765448	-2.537182
108	51	تبلبالة	Tabelbala	دائرة تبلبالة, بني عباس, الجزائر	28.9802244	-3.4292902
110	51	الواتة	El Ouata	دائرة الواتة, بني عباس, الجزائر	30.1367103	-1.355485
112	51	كرزاز	Kerzaz	دائرة كرزاز, بني عباس, 08220, الجزائر	29.778764	-1.1020856
114	51	بني عباس (ولاية منتدبة)	Beni Abbes (Wilaya Déléguée)	دائرة بني عباس, بني عباس, 08300, الجزائر	30.108921	-2.4622548
90	52	أولاد جلال	Ouled Djellal	دائرة أولاد جلال, أولاد جلال, الجزائر	34.5917421	4.9445181
91	52	سيدي خالد	Sidi Khaled	دائرة سيدي خالد, أولاد جلال, الجزائر	34.015154	4.8233346
101	52	أولاد جلال (ولاية منتدبة)	Ouled Djellal (Wilaya Déléguée)	دائرة أولاد جلال, أولاد جلال, الجزائر	34.5917421	4.9445181
139	53	إينغر	In Ghar	دائرة إن غار, عين صالح, الجزائر	26.5610025	1.8711775
143	53	عين صالح	In Salah	دائرة عين صالح, عين صالح, الجزائر	27.5585765	3.945705
145	53	عين صالح (ولاية منتدبة)	In Salah (Wilaya Déléguée)	دائرة عين صالح, عين صالح, الجزائر	27.5585765	3.945705
140	54	عين قزام	In Guezzam	دائرة عين قزام, عين قزام, الجزائر	20.390479	5.4831121
142	54	تين زواتين	Tin Zouatine	دائرة تين ظواتين, عين قزام, 11150, الجزائر	20.4349975	3.2038833
144	54	عين قزام (ولاية منتدبة)	In Guezzam (Wilaya Déléguée)	دائرة عين قزام, عين قزام, الجزائر	20.390479	5.4831121
389	55	تقرت	Touggourt	دائرة تقرت, تقرت, الجزائر	33.1035954	5.9537176
391	55	الطيبات	Taibet	دائرة الطيبات, تقرت, الجزائر	32.9854202	6.3922289
392	55	تماسين	Temacine	دائرة تماسين, تقرت, الجزائر	32.9525089	6.0785201
393	55	المقارين	Megarine	دائرة مقارين, تقرت, الجزائر	33.2918236	5.9485865
395	55	تقرت (ولاية منتدبة)	Touggourt (Wilaya Déléguée)	دائرة تقرت, تقرت, الجزائر	33.1035954	5.9537176
414	56	جانت	Djanet	دائرة جانت, جانت, 33100, الجزائر	24.071521	9.6155847
416	56	جانت (ولاية منتدبة)	Djanet (Wilaya Déléguée)	دائرة جانت, جانت, 33100, الجزائر	24.071521	9.6155847
462	57	المغير	El Meghaier	دائرة المغير, المغير, الجزائر	34.1340925	5.7248157
463	57	جامعة	Djamaa	دائرة جامعة, المغير, الجزائر	33.6246215	5.6745587
464	57	المغير (ولاية منتدبة)	El Meghaier (Wilaya Déléguée)	دائرة المغير, المغير, الجزائر	34.1340925	5.7248157
536	58	المنيعة	El Menia	دائرة المنيعة, المنيعة, الجزائر	30.5437321	3.0185968
543	58	المنصورة	Mansourah	منصورة, دائرة منصورة, المنيعة, الجزائر	32.0088523	3.2750023
544	58	المنيعة (ولاية منتدبة)	El Menia (Wilaya Déléguée)	دائرة المنيعة, المنيعة, الجزائر	30.5437321	3.0185968
\.
COPY public.communes (commune_id, daira_id, commune_code, commune_ar, commune_fr, commune_name, commune_latitude, commune_longitude) FROM stdin;
1	1	101	أدرار	Adrar	أدرار، دائرة أدرار، أدرار، 01000، الجزائر	27.8733807	-0.2874884
2	1	122	بودة	Bouda	بودة، دائرة أدرار، أدرار، الجزائر	28.010002	-0.426797
3	1	121	أولاد أحمد تيمي	Ouled Ahmed Timmi	أولاد أحمد تيمي، دائرة أدرار، أدرار، الجزائر	27.8510411	-0.2812795
4	2	103	شروين	Charouine	شروين، دائرة شروين، تيميمون، 1014، الجزائر	29.0186064	-0.2585993
5	2	4910	أولاد عيسى	Ouled Aissa	أولاد عيسى، دائرة شروين، تيميمون، الجزائر	29.4235586	-0.0891357
6	2	124	طالمين	Talmine	طالمين، دائرة شروين، تيميمون، الجزائر	29.3296013	-0.4986259
7	3	104	رقان	Reggane	رقان، دائرة رقان، أدرار، 01200، الجزائر	26.7207267	0.1751507
8	3	118	سالي	Sali	سالي، دائرة رقان، أدرار، 1009، الجزائر	26.9612527	-0.0251553
9	4	126	السبع	Sebaa	السبع، دائرة تسابيت، أدرار، الجزائر	28.2150178	-0.173775
10	4	108	تسابيت	Tsabit	تسابيت، دائرة تسابيت، أدرار، 01015، الجزائر	28.3509683	-0.2161001
11	5	110	أولاد السعيد	Ouled Said	أولاد السعيد، دائرة تيميمون، تيميمون، الجزائر	29.4149964	0.2444383
12	5	109	تيميمون	Timimoun	تيميمون، دائرة تيميمون، تيميمون، الجزائر	29.2605117	0.2285923
13	6	105	إن زغمير	In Zghmir	إن زغمير، دائرة زاوية كنتة، أدرار، الجزائر	27.0953952	-0.1155373
14	6	111	زاوية كنتة	Zaouiet Kounta	زاوية كنتة، دائرة زاوية كنتة، أدرار، 01030، الجزائر	27.2300419	-0.1933113
15	7	119	اقبلي	Akabli	أقبلي، دائرة اولف، أدرار، 1044، الجزائر	26.7133917	1.3691963
16	7	112	أولف	Aoulef	اولف، دائرة اولف، أدرار، 01003، الجزائر	26.9722077	1.0786817
17	7	113	تيمقتن	Timekten	تمقطن، دائرة اولف، أدرار، الجزائر	27.0214579	1.0140877
18	7	106	تيت	Tit	تيط، دائرة اولف، أدرار، 1031، الجزائر	26.9383021	1.4910197
19	8	115	فنوغيل	Fenoughil	فنوغيل، دائرة فنوغيل، أدرار، 00100، الجزائر	27.6060965	-0.3021104
20	8	114	تامنطيط	Tamantit	تامنطيت، دائرة فنوغيل، أدرار، 1038، الجزائر	27.7613334	-0.2657533
21	8	102	تامست	Tamest	تامست، دائرة فنوغيل، أدرار، 01028، الجزائر	27.4237416	-0.2457959
22	9	107	قصر قدور	Ksar Kaddour	قصر قدور، دائرة تنيركوك، تيميمون، الجزائر	29.578491	0.3739728
23	9	116	تنركوك	Tinerkouk	تنيركوك، دائرة تنيركوك، تيميمون، 01013، الجزائر	30.461939	1.3611996
24	10	123	أوقروت	Aougrout	أوقروت، دائرة أوقروت، تيميمون، 1012، الجزائر	28.7074429	0.3406103
25	10	4906	دلدول	Deldoul	دلدول، دائرة أوقروت، تيميمون، الجزائر	34.0499446	3.3681607
26	10	120	المطارفة	Metarfa	المطارفة، دائرة أوقروت، تيميمون، الجزائر	28.5890013	-0.1499377
27	11	125	برج باجي مختار	Bordj Badji Mokhtar	برج باجي مختار، دائرة برج باجي مختار، برج باجي مختار، 01010، الجزائر	21.3258256	0.9528563
28	11	128	تيمياوين	Timiaouine	تيمياوين، دائرة برج باجي مختار، برج باجي مختار، الجزائر	20.4339578	1.8101265
29	14	201	الشلف	Chlef	الشلف، دائرة الشلف، الشلف، 02000، الجزائر	36.164592	1.331499
30	14	233	أم الدروع	Oum Drou	أم الذروع، دائرة الشلف، الشلف، الجزائر	36.1966757	1.3913824
31	14	219	سنجاس	Sendjas	السنجاس، دائرة الشلف، الشلف، 02025، الجزائر	36.0396655	1.4552069
32	15	225	سيدي عبد الرحمن	Sidi Abderrahmane	سيدي عبد الرحمان، دائرة تنس، الشلف، الجزائر	36.4791747	1.1257586
33	15	211	سيدي عكاشة	Sidi Akkacha	سيدى عكاشة، دائرة تنس، الشلف، 02009، الجزائر	36.4649578	1.3052519
34	15	202	تنس	Tenes	تنس، دائرة تنس، الشلف، الجزائر	36.5080818	1.3078072
35	16	235	بني بوعتاب	Beni Bouattab	بنى بوعتاب، دائرة الكريمية، الشلف، الجزائر	35.9902115	1.657264
36	16	204	الكريمية	El Karimia	الكريمية، دائرة الكريمية، الشلف، 02008، الجزائر	36.1121742	1.5534446
37	16	209	حرشون	Harchoun	حرشون، دائرة الكريمية، الشلف، الجزائر	36.1137919	1.5061783
38	17	217	الظهرة	Dahra	الظهرة، دائرة تاوقريت، الشلف، 02036، الجزائر	36.2545642	0.8518821
39	17	206	تاوقريت	Taougrit	تاوقريت، دائرة تاوقريت، الشلف، الجزائر	36.2472325	0.9222293
40	18	207	بني حواء	Beni Haoua	بني حواء، دائرة بني حواء، الشلف، 02017، الجزائر	36.5304451	1.5692626
41	18	234	بريرة	Breira	بريرة، دائرة بني حواء، الشلف، الجزائر	36.4488016	1.6150342
42	18	216	وادي قوسين	Oued Goussine	وادى قوسين، دائرة بني حواء، الشلف، الجزائر	36.4934787	1.4520393
43	19	224	الشطية	Chettia	الشطية، دائرة أولاد فارس، الشلف، الجزائر	36.1929178	1.2491044
44	19	228	الأبيض مجاجة	Labiod Medjadja	الأبيض مجاجة، دائرة أولاد فارس، الشلف، الجزائر	36.2507309	1.3919112
45	19	210	أولاد فارس	Ouled Fares	أولاد فارس، دائرة أولاد فارس، الشلف، 02002، الجزائر	36.2303457	1.2084133
46	20	212	بوقادير	Boukadir	بوقادير، دائرة بوقادير، الشلف، الجزائر	36.0650746	1.1278681
47	20	221	وادي سلي	Oued Sly	وادي سلي، دائرة بوقادير، الشلف، 02011، الجزائر	36.101565	1.1995738
48	20	208	الصبحة	Sobha	صبحة، دائرة بوقادير، الشلف، الجزائر	36.1064562	1.0312961
49	21	203	بنايرية	Benairia	بنايرية، دائرة الزبوجة، الشلف، الجزائر	36.3844273	1.3743329
50	21	231	بوزغاية	Bouzeghaia	بوزغاية، دائرة الزبوجة، الشلف، الجزائر	36.3605876	1.2627232
51	21	220	الزبوجة	Zeboudja	الزبوجة، دائرة الزبوجة، الشلف، الجزائر	36.3540252	1.4302999
52	22	222	أبو الحسن	Abou El Hassane	أبو الحسن، دائرة أبو الحسن، الشلف، الجزائر	36.4145938	1.1938241
53	22	205	تاجنة	Tadjena	تاجنة، دائرة أبو الحسن، الشلف، الجزائر	36.3347	1.117922
54	22	214	تلعصة	Talassa	تلعصة، دائرة أبو الحسن، الشلف، الجزائر	36.4179865	1.0698952
55	23	223	المرسى	El Marsa	المرسى، دائرة المرسى، الشلف، الجزائر	36.400127	0.9153634
56	23	226	مصدق	Moussadek	مصدق، دائرة المرسى، الشلف، الجزائر	36.3510426	1.0168894
57	24	213	بني راشد	Beni Rached	بنى راشد، دائرة وادي الفضة، الشلف، الجزائر	36.2927757	1.5307566
58	24	229	وادي الفضة	Oued Fodda	وادى الفضة، دائرة وادي الفضة، الشلف، الجزائر	36.185966	1.5347489
59	24	218	أولاد عباس	Ouled Abbes	أولاد عباس، دائرة وادي الفضة، الشلف، 02029، الجزائر	36.2147686	1.4860684
60	25	227	الحجاج	El Hadjadj	الحجاج، دائرة أولاد بن عبد القادر، الشلف، الجزائر	36.0041534	1.3721767
61	25	230	أولاد بن عبد القادر	Ouled Ben Abdelkader	أولاد بن عبد القادر، دائرة أولاد بن عبد القادر، الشلف، الجزائر	36.0238897	1.2761855
62	26	232	عين مران	Ain Merane	عين مران، دائرة عين مران، الشلف، الجزائر	36.175626	0.9723668
63	26	215	الهرانفة	Herenfa	الهرنفة، دائرة عين مران، الشلف، الجزائر	36.2428312	1.0602519
64	27	301	الأغواط	Laghouat	الأغواط، دائرة الأغواط، الأغواط، الجزائر	33.8063518	2.8808616
65	28	303	بن ناصر بن شهرة	Benacer Benchohra	بن ناصر بن شهرة، دائرة قصر الحيران، الأغواط، الجزائر	33.7562321	3.0047796
66	28	302	قصر الحيران	Ksar El Hirane	قصر الحيران، دائرة قصر الحيران، الأغواط، 03100، الجزائر	33.7012082	3.2269282
67	29	320	العسافية	El Assafia	العاسفية، دائرة سيدي مخلوف، الأغواط، الجزائر	33.9018768	3.0953642
68	29	304	سيدي مخلوف	Sidi Makhlouf	سيدي مخلوف، دائرة سيدي مخلوف، الأغواط، الجزائر	34.0676281	2.8669111
69	30	305	حاسي الدلاعة	Hassi Delaa	حاسى دلاعة، دائرة حاسي الرمل، الأغواط، 03022، الجزائر	33.4165651	3.5518967
70	30	306	حاسي الرمل	Hassi R'mel	حاسى الرمل، دائرة حاسي الرمل، الأغواط، الجزائر	32.9458855	3.273666
71	31	307	عين ماضي	Ain Madhi	عين ماضي، دائرة عين ماضي، الأغواط، الجزائر	33.797062	2.3059156
72	31	323	الحوايطة	El Houaita	الحوايطة، دائرة عين ماضي، الأغواط، 03040، الجزائر	33.5411006	2.50890549
73	31	309	الخنق	Kheneg	الخنق، دائرة عين ماضي، الأغواط، الجزائر	33.7447402	2.7911348
74	31	308	تاجموت	Tadjemout	تاجموت، دائرة عين ماضي، الأغواط، الجزائر	33.8796356	2.5246794
75	31	318	تاجرونة	Tadjrouna	تاجرونة، دائرة عين ماضي، الأغواط، 03011، الجزائر	33.55447	2.0639215
76	32	311	عين سيدي علي	Ain Sidi Ali	عين سيدي على، دائرة قلتة سيدي سعد، الأغواط، الجزائر	34.1579118	1.5701308
77	32	312	البيضاء	El Beidha	البيضاء، دائرة قلتة سيدي سعد، الأغواط، الجزائر	35.6775878	5.189538
78	32	310	قلتة سيدي سعد	Gueltat Sidi Saad	قلتة سيدي سعد، دائرة قلتة سيدي سعد، الأغواط، الجزائر	34.2701253	1.8420835
79	33	313	بريدة	Brida	بريدة، دائرة بريدة، الأغواط، الجزائر	33.906785	1.7837801
80	33	315	الحاج مشري	Hadj Mechri	حاج مشري، دائرة بريدة، الأغواط، الجزائر	33.9977205	1.5460748
81	33	317	تاويالة	Taouiala	تاويالة، دائرة بريدة، الأغواط، الجزائر	33.8541515	1.845551
82	34	314	الغيشة	El Ghicha	الغيشة، دائرةالغيشة، الأغواط، الجزائر	33.8750888	2.1395264
83	35	319	أفلو	Aflou	آفلو، دائرة آفلو، الأغواط، 03400، الجزائر	34.11252	2.10029
84	35	316	سبقاق	Sebgag	سبقاق، دائرة آفلو، الأغواط، الجزائر	34.0295796	1.9269747
85	35	324	سيدي بوزيد	Sidi Bouzid	سيدي بوزيد، دائرة آفلو، الأغواط، الجزائر	34.3265059	2.195601
86	36	321	وادي مرة	Oued Morra	وادي مرة، دائرة وادي مرة، الأغواط، الجزائر	34.1649241	2.3247059
87	36	322	وادي مزي	Oued M'zi	وادي مزي، دائرة وادي مرة، الأغواط، الجزائر	33.9208548	2.4348727
88	37	427	عين الزيتون	Ain Zitoun	عين الزيتون، دائرة أم البواقي، أم البواقي، 04023، الجزائر	35.7137192	7.0576594
89	37	401	أم البواقي	Oum El Bouaghi	أم البواقي، دائرة أم البواقي، أم البواقي، 04000، الجزائر	35.8687758	7.1150645
90	38	402	عين البيضاء	Ain Beida	عين البيضاء، دائرة عين البيضاء، أم البواقي، الجزائر	35.7952839	7.3894346
91	38	409	بريش	Berriche	بريش، دائرة عين البيضاء، أم البواقي، 04015، الجزائر	35.917798	7.3769813
92	38	418	الزرق	Zorg	الزرق، دائرة عين البيضاء، أم البواقي، الجزائر	35.812986	7.4887122
93	39	403	عين مليلة	Ain M'lila	عين مليلة، دائرة عين مليلة، أم البواقي، الجزائر	36.0375444	6.570986
94	39	428	أولاد قاسم	Ouled Gacem	أولاد قاسم، دائرة عين مليلة، أم البواقي، الجزائر	36.0327241	6.6880676
95	39	410	أولاد حملة	Ouled Hamla	أولاد حملة، دائرة عين مليلة، أم البواقي، الجزائر	36.0795998	6.4720919
96	40	405	العامرية	El Amiria	العامرية، دائرة سيقوس، أم البواقي، الجزائر	36.0718842	6.905992
97	40	406	سيقوس	Sigus	سيقوس، دائرة سيقوس، أم البواقي، الجزائر	36.1239401	6.7854947
98	41	408	عين ببوش	Ain Babouche	عين بابوش، دائرة عين بابوش، أم البواقي، 04020، الجزائر	35.9422315	7.1874854
99	41	415	عين الديس	Ain Diss	عين الديس، دائرة عين بابوش، أم البواقي، 04004، الجزائر	36.0139339	7.0323694
100	42	411	الضلعة	Dhalaa	الضلعة، دائرة دهالة، أم البواقي، الجزائر	35.460285	7.5500058
101	42	414	الجازية	El Djazia	الجازية، دائرة دهالة، أم البواقي، الجزائر	35.6571399	7.5521174
102	43	412	عين كرشة	Ain Kercha	عين كرشة، دائرة عين كرشة، أم البواقي، 04006، الجزائر	35.9233662	6.7022898
103	43	429	الحرملية	El Harmilia	الحرميلية، دائرة عين كرشة، أم البواقي، الجزائر	35.9250906	6.6223907
104	43	413	هنشير تومغني	Hanchir Toumghani	هنشير تومغني، دائرة عين كرشة، أم البواقي، الجزائر	35.9346179	6.7412657
105	44	416	فكيرينة	Fkirina	فكرينة، دائرة فكرينة، أم البواقي، الجزائر	35.6608817	7.2972243
106	44	423	وادي نيني	Oued Nini	وادي نيني، دائرة فكرينة، أم البواقي، الجزائر	35.5721271	7.3490145
107	45	421	بئر الشهداء	Bir Chouhada	بئر الشهداء، دائرة سوق نعمان، أم البواقي، الجزائر	35.9007352	6.2454458
108	45	420	أولاد زواي	Ouled Zouai	أولاد زواي، دائرة سوق نعمان، أم البواقي، الجزائر	35.8402214	6.5114278
109	45	417	سوق نعمان	Souk Naamane	سوق نعمان، دائرة سوق نعمان، أم البواقي، الجزائر	35.8953079	6.3925749
110	46	422	قصر الصباحي	Ksar Sbahi	قصر صباحي، دائرة قصر صباحي، أم البواقي، 04018، الجزائر	36.0614655	7.2530315
111	47	404	بحير الشرقي	Behir Chergui	بحير شرقي، دائرة مسكيانة، أم البواقي، الجزائر	35.8161935	7.7297307
112	47	407	البلالة	El Belala	البلالة، دائرة مسكيانة، أم البواقي، الجزائر	35.6685225	7.7630889
113	47	424	مسكيانة	Meskiana	مسكيانة، دائرة مسكيانة، أم البواقي، الجزائر	35.6291407	7.6694143
114	47	426	الرحية	Rahia	الراحية، دائرة مسكيانة، أم البواقي، الجزائر	35.7528916	7.6289417
115	48	425	عين فكرون	Ain Fekroun	عين فكرون، دائرة عين فكرون، أم البواقي، 04005، الجزائر	35.9420187	6.8728223
116	48	419	الفجوج بوغرارة سعودي	El Fedjoudj Boughrara Sa	الفجوج بوغرارة سعودي، دائرة عين فكرون، أم البواقي، 04042، الجزائر	35.7103668	6.8193521
117	49	501	باتنة	Batna	باتنة، دائرة باتنة، باتنة، الجزائر	35.5544227	6.1767747
118	49	523	فسديس	Fesdis	فسديس، دائرة باتنة، باتنة، 05078، الجزائر	35.6181167	6.2464392
119	49	537	وادي الشعبة	Oued Chaaba	وادي الشعبة، دائرة باتنة، باتنة، الجزائر	35.5238426	6.0346692
120	50	546	حيدوسة	Hidoussa	حيدوسة، دائرة مروانة، باتنة، الجزائر	35.5283105	5.9188903
121	50	528	قصر بلزمة	Ksar Bellezma	قصر بلزمة، دائرة مروانة، باتنة، الجزائر	35.6762717	5.9021516
122	50	504	مروانة	Merouana	مروانة، دائرة مروانة، باتنة، 05300، الجزائر	35.6320555	5.913138
123	50	533	وادي الماء	Oued El Ma	وادي الماء، دائرة مروانة، باتنة، 05016، الجزائر	35.6448731	5.9953423
124	51	558	لازرو	Lazrou	لازرو، دائرة سريانة، باتنة، الجزائر	35.8073846	6.225302
125	51	505	سريانة	Seriana	سريانة، دائرة سريانة، باتنة، الجزائر	35.6925612	6.1850558
126	51	554	زانة البيضاء	Zanet El Beida	زانة البيضاء، دائرة سريانة، باتنة، الجزائر	35.7950928	6.10481
127	52	506	منعة	Menaa	منعة، دائرة منعة، باتنة، الجزائر	35.1762498	6.0039939
128	52	521	تغرغار	L'Adrar Tigharghar	تغرغار، دائرة منعة، باتنة، الجزائر	35.1594725404366	5.97090858473147
129	53	522	عين ياقوت	Ain Yagout	عين ياقوت، دائرة المعذر، باتنة، الجزائر	35.7866324	6.418212
130	53	559	بومية	Boumia	بوميــة، دائرة المعذر، باتنة، الجزائر	35.7060717	6.4674757
131	53	513	جرمة	Djerma	جرمة، دائرة المعذر، باتنة، الجزائر	35.6844999	6.2909032
132	53	507	المعذر	El Madher	المعذر، دائرة المعذر، باتنة، 05015، الجزائر	35.6258746	6.3706722
133	54	512	عيون العصافير	Ouyoun El Assafir	عيون العصا فير، دائرة تازولت، باتنة، الجزائر	35.5556005	6.3083393
134	54	508	تازولت	Tazoult	تازولت، دائرة تازولت، باتنة، 05011، الجزائر	35.4860091	6.2536097
135	55	541	بومقر	Boumagueur	بومقر، دائرة نقاوس، باتنة، 05057، الجزائر	35.5051588	5.5525246
136	55	509	نقاوس	N Gaous	نقاوس، دائرة نقاوس، باتنة، 05600، الجزائر	35.5547284	5.6108516
137	55	524	سفيان	Sefiane	سفيان، دائرة نقاوس، باتنة، 05064، الجزائر	35.4379384	5.5597763
138	56	516	أريس	Arris	أريس، دائرة أريس، باتنة، الجزائر	35.258514	6.3449818
139	56	526	تيغانمين	Tighanimine	تيغانيمين، دائرة أريس، باتنة، الجزائر	35.1853431	6.249225
140	57	519	عين جاسر	Ain Djasser	عين جاسر، دائرة عين جاسر، باتنة، الجزائر	35.8596869	6.0012835
141	57	557	الحاسي	El Hassi	الحاسي، دائرة عين جاسر، باتنة، الجزائر	35.7804724	5.9503611
142	58	529	سقانة	Seggana	سقانة، دائرة سقانة، باتنة، الجزائر	35.3641602	5.5719001
143	58	518	تيلاطو	Tilatou	تيلاطو، دائرة سقانة، باتنة، الجزائر	35.3292158	5.7931239
144	59	531	فم الطوب	Foum Toub	فم الطوب، دائرة اشمول، باتنة، الجزائر	35.404396	6.5503509
145	59	530	إشمول	Ichemoul	إشمول، دائرة اشمول، باتنة، الجزائر	35.3095106	6.5100105
146	59	511	إينوغيسن	Inoughissen	إينوغيسن، دائرة اشمول، باتنة، الجزائر	35.2864812	6.5412422
147	60	535	بوزينة	Bouzina	بوزينة، دائرة بوزينة، باتنة، 05041، الجزائر	35.2648362	6.0988647
148	60	561	لارباع	Larbaa	لارباع، دائرة بوزينة، باتنة، الجزائر	35.3545416	6.1410784
149	61	560	بولهيلات	Boulhilat	بولهيلات، دائرة الشمرة، باتنة، الجزائر	35.737649	6.6305203
150	61	536	الشمرة	Chemora	الشمرة، دائرة الشمرة، باتنة، الجزائر	35.6298861	6.6056111
151	62	542	بريكة	Barika	بريكة، دائرة بريكة، باتنة، الجزائر	35.3846699	5.3702215
152	62	514	بيطام	Bitam	بيطام، دائرة بريكة، باتنة، الجزائر	35.3077781	5.3740815
153	62	555	إمدوكل	M Doukal	أمدوكال، دائرة بريكة، باتنة، الجزائر	35.1216575	5.1821243
154	63	515	عزيل عبد القادر	Azil Abedelkader	عزيل عبد القادر، دائرة الجزار، باتنة، 05130، الجزائر	35.3236825	5.0149826
155	63	543	الجزار	Djezzar	الجزار، دائرة الجزار، باتنة، 06045، الجزائر	35.5082551	5.2676704
156	63	556	أولاد عمار	Ouled Ammar	أولاد عمار، دائرة الجزار، باتنة، الجزائر	35.4622558	5.1560233
157	64	502	غسيرة	Ghassira	غسيرة، دائرة تكوت، باتنة، الجزائر	35.0970768	6.2228071
158	64	517	كيمل	Kimmel	كيمل، دائرة تكوت، باتنة، الجزائر	35.2166875	6.5449007
159	64	544	تكوت	T Kout	تكوت، دائرة تكوت، باتنة، الجزائر	35.1403816	6.3085503
160	65	545	عين التوتة	Ain Touta	عين التوتة، دائرة عين التوتة، باتنة، الجزائر	35.3752089	5.894213
161	65	532	بني فضالة الحقانية	Beni Foudhala El Hakania	بني فضالة الحقانية، دائرة عين التوتة، باتنة، الجزائر	35.3781586	6.0607501
162	65	503	معافة	Maafa	معافة، دائرة عين التوتة، باتنة، الجزائر	35.2663121	5.9018467
163	65	540	أولاد عوف	Ouled Aouf	أولاد عوف، دائرة عين التوتة، باتنة، الجزائر	35.4554535	5.7564355
164	66	552	شير	Chir	شير، دائرة ثنية العابد، باتنة، 05108، الجزائر	35.2179401	6.132079
165	66	548	وادي الطاقة	Oued Taga	وادي الطاقة، دائرة ثنية العابد، باتنة، الجزائر	35.4323373	6.4146079
166	66	547	ثنية العابد	Teniet El Abed	ثنية العابد، دائرة ثنية العابد، باتنة، الجزائر	35.2860292	6.2546389
167	67	549	أولاد فاضل	Ouled Fadel	أولاد فاضل، دائرة تيمقاد، باتنة، الجزائر	35.5558054	6.6785087
168	67	550	تيمقاد	Timgad	تيمقاد، دائرة تيمقاد، باتنة، 05023، الجزائر	35.4938565	6.4705695
169	68	539	القصبات	Gosbat	القصبات، دائرة راس لعيون، باتنة، 05090، الجزائر	35.616384	5.470852
170	68	510	القيقبة	Guigba	القيقبة، دائرة راس لعيون، باتنة، الجزائر	35.7341561	5.5896477
171	68	520	أولاد سلام	Ouled Sellem	أولاد سلام، دائرة راس لعيون، باتنة، 05044، الجزائر	35.8263866	5.8836213
172	68	525	الرحبات	Rahbat	الرحبات، دائرة راس لعيون، باتنة، الجزائر	35.7128568	5.6562846
173	68	551	رأس العيون	Ras El Aioun	رأس العيون، دائرة راس لعيون، باتنة، 05009، الجزائر	35.6758524	5.6515672
174	68	534	تالخمت	Talkhamt	تالخمت، دائرة راس لعيون، باتنة، الجزائر	35.6669798	5.7854012
175	69	527	لمسان	Lemcene	لمسان، دائرة اولاد سي سليمان، باتنة، الجزائر	35.6570774	5.7982758
176	69	553	أولاد سي سليمان	Ouled Si Slimane	أولاد سي سليمان، دائرة اولاد سي سليمان، باتنة، 05066، الجزائر	35.61043	5.6322042
177	69	538	تاكسلانت	Taxlent	تاكسلانت، دائرة اولاد سي سليمان، باتنة، الجزائر	35.6055933	5.800679
178	70	601	بجاية	Bejaia	بجاية، دائرة بجاية، بجاية، 06000، الجزائر	36.7511783	5.0643687
179	70	651	وادي غير	Oued Ghir	وادي غير، دائرة بجاية، بجاية، 06120، الجزائر	36.7106296	4.9782915
180	71	602	أميزور	Amizour	أميزور، دائرة أميزور، بجاية، 06300، الجزائر	36.6439022	4.9036535
181	71	623	بني جليل	Beni Djellil	بني جليل، دائرة أميزور، بجاية، 06082، الجزائر	36.5728807	4.8104334
182	71	603	فرعون	Feraoun	فرعون، دائرة أميزور، بجاية، 06330، الجزائر	36.5580756	4.8660488
183	71	612	سمعون	Smaoun	سمعون، دائرة أميزور، بجاية، 06020، الجزائر	36.6084692	4.8224282
184	72	607	تيمزريت	Timezrit	تيمزريت، دائرة تيمزريت، بجاية، 06019، الجزائر	36.6155736	4.7683245
185	73	641	مالبو	Melbou	ملبو، دائرة سوق الإثنين، بجاية، 06012، الجزائر	36.6403282	5.3626372
186	73	1557	سوق الإثنين	Souk El Tenine	سوق الإثنين، دائرة سوق الإثنين، بجاية، 06012، الجزائر	36.5950832	4.007301
187	73	646	تامريجت	Tamridjet	ثامريجث، دائرة سوق الإثنين، بجاية، 06007، الجزائر	36.5721683	5.3746744
188	74	648	بوخليفة	Boukhelifa	بوخليفة، دائرة تيشي، بجاية، 06101، الجزائر	36.6368914	5.0749708
189	74	633	تالة حمزة	Tala Hamza	ثالة حمزة، دائرة تيشي، بجاية، 06120، الجزائر	36.7029253	5.0394177
190	74	611	تيشي	Tichy	تيشي، دائرة تيشي، بجاية، 06023، الجزائر	36.668951	5.1574875
191	75	628	أيت رزين	Ait R'zine	آيت أرزين، دائرة إغيل علي، بجاية، 06013، الجزائر	36.368882	4.4866713
192	75	617	إغيل علي	Ighil-Ali	إغيل علي، دائرة إغيل علي، بجاية، 06014، الجزائر	36.3378593	4.470196
193	76	647	أيت إسماعيل	Ait-Smail	آيت إسماعيل، دائرة درقينة، بجاية، 06080، الجزائر	36.5536462	5.2297301
194	76	620	درقينة	Darguina	درقينة، دائرة درقينة، بجاية، 06016، الجزائر	36.564307	5.3063118
195	76	631	تاسكريوت	Taskriout	تاسقريوت، دائرة درقينة، بجاية، 06621، الجزائر	36.5558587	5.2799112
196	77	622	أوقاس	Aokas	أوقاس، دائرة أوقاس، بجاية، 06007، الجزائر	36.6376518	5.2453122
197	77	649	تيزي نبربر	Tizi-N'berber	ثيزي نبربر، دائرة أوقاس، بجاية، 06060، الجزائر	36.6124139	5.2169885
198	78	624	أدكار	Adekar	آدكار، دائرة آدكار، بجاية، 06021، الجزائر	36.6929171	4.6734299
199	78	635	بني كسيلة	Beni K'sila	بني كسيلة، دائرة آدكار، بجاية، 06106، الجزائر	36.881989	4.6643892
200	78	604	تاوريرت إغيل	Taourit Ighil	ثاوريرث إغيل، دائرة آدكار، بجاية، 06000، الجزائر	36.6995991	4.6977077
201	79	625	أقبو	Akbou	آقبو، دائرة آقبو، بجاية، 06001، الجزائر	36.4597538	4.5289243
202	79	605	شلاطة	Chellata	شلاطة، دائرة آقبو، بجاية، 06200، الجزائر	36.5187102	4.495462
203	79	615	اغرم	Ighram	إغرم، دائرة آقبو، بجاية، 06057، الجزائر	36.4622509	4.5042534
204	79	606	تامقرة	Tamokra	ثامُقرة، دائرة آقبو، بجاية، 06109، الجزائر	36.3980867	4.6671349
205	80	616	أمالو	Amalou	أمالو، دائرة صدوق، بجاية، 06034، الجزائر	36.4774607	4.63266
206	80	637	بوحمزة	Bouhamza	بوحمزة، دائرة صدوق، بجاية، 06031، الجزائر	36.4450868	4.6855035
207	80	609	مسيسنة	M'cisna	مسيسنة، دائرة صدوق، بجاية، 06038، الجزائر	36.5642493	4.7314768
208	80	626	صدوق	Seddouk	صدوق، دائرة صدوق، بجاية، 06011، الجزائر	36.5472337	4.6894642
209	81	638	بني مليكش	Beni-Mallikeche	بني مليكش، دائرة ثازمالت، بجاية، 06039، الجزائر	36.4471796	4.4102266
210	81	652	بو جليل	Boudjellil	بوجليل، دائرة ثازمالت، بجاية، 06000، الجزائر	36.3498654	4.4141916
211	81	627	تازمالت	Tazmalt	تازمالت، دائرة ثازمالت، بجاية، 06006، الجزائر	36.3885111	4.4000106
212	82	642	أكفادو	Akfadou	أكفادو، دائرة شميني، بجاية، 06411، الجزائر	36.6578395	4.6068165
213	82	629	شميني	Chemini	شميني، دائرة شميني، بجاية، 06770، الجزائر	36.5944018	4.6210413
214	82	630	سوق اوفلا	Souk Oufella	سوق أوفلا، دائرة شميني، بجاية، 06042، الجزائر	36.6054725	4.6382952
215	82	632	طيبان	Tibane	ظيبان، دائرة شميني، بجاية، 06730، الجزائر	36.6135798	4.652601
216	83	634	برباشة	Barbacha	برباشة، دائرة برباشة، بجاية، 06009، الجزائر	36.5734726	4.9693825
217	83	613	كنديرة	Kendira	كنديرة، دائرة برباشة، بجاية، 06371، الجزائر	36.557728	5.0215874
218	84	636	أوزلاقن	Ouzellaguen	أوزلاقن، دائرة أوزلاقن، بجاية، 06010، الجزائر	36.5478525	4.5766984
219	85	643	الفلاي	Leflaye	لفلاي، دائرة سيدي عيش، بجاية، 06043، الجزائر	36.6090456	4.6713413
220	85	621	سيدي عياد	Sidi Ayad	سيدي عياد، دائرة سيدي عيش، بجاية، 06085، الجزائر	36.6119158	4.7151737
221	85	639	سيدي عيش	Sidi-Aich	سيدي عيش، دائرة سيدي عيش، بجاية، 06005، الجزائر	36.6127914	4.6913091
222	85	614	تيفرة	Tifra	تيفرة، دائرة سيدي عيش، بجاية، 06412، الجزائر	36.6663065	4.6974299
223	85	610	تينبدار	Tinebdar	ثينبذار، دائرة سيدي عيش، بجاية، 06720، الجزائر	36.6232839	4.6781911
224	86	640	القصر	El Kseur	القصر، دائرة القصر، بجاية، 06003، الجزائر	36.6794351	4.8523757
225	86	618	فناية الماثن	Fenaia Il Maten	فناية الماثن، دائرة القصر، بجاية، 06018، الجزائر	36.6666299	4.7931048
226	86	619	توجة	Toudja	توجة، دائرة القصر، بجاية، 06030، الجزائر	36.7525317	4.8971215
227	87	645	ذراع القايد	Dra El Caid	ذراع القايد، دائرة خراطة، بجاية، 06074، الجزائر	36.4400561	5.234867
228	87	644	خراطة	Kherrata	خراطة، دائرة خراطة، بجاية، 06004، الجزائر	36.4936262	5.2771041
229	88	650	بني معوش	Benimaouche	بني معوش، دائرة بني معوش، بجاية، 06024، الجزائر	36.4878512	4.787552
230	89	701	بسكرة	Biskra	بسكرة، دائرة بسكرة، بسكرة، الجزائر	34.8508508	5.7286878
231	89	732	الحاجب	El Hadjab	الحاجب، دائرة بسكرة، بسكرة، الجزائر	34.7892294	5.5996001
232	90	710	الشعيبة	Chaiba	الشعيبة، دائرة أولاد جلال، أولاد جلال، الجزائر	34.8334568	4.9194288
233	90	709	الدوسن	Doucen	الدوسن، دائرة أولاد جلال، أولاد جلال، الجزائر	34.5975449	5.1029298
234	90	705	أولاد جلال	Ouled Djellal	أولاد جلال، دائرة أولاد جلال، أولاد جلال، 07400، الجزائر	34.4254103	5.0644342
235	91	5104	بسباس	Besbes	البسباس، دائرة سيدي خالد، أولاد جلال، الجزائر	34.1650307	4.9990113
236	91	706	رأس الميعاد	Ras El Miad	رأس الميعاد، دائرة سيدي خالد، أولاد جلال، الجزائر	34.1838961	4.4510462
237	91	5102	سيدي خالد	Sidi Khaled	سيدي خالد، دائرة سيدي خالد، أولاد جلال، الجزائر	34.3915907	5.0005177
238	92	714	عين الناقة	Ain Naga	عين الناقة، دائرة سيدي عقبة، بسكرة، الجزائر	34.6535415	6.1416099
239	92	704	شتمة	Chetma	شتمة، دائرة سيدي عقبة، بسكرة، الجزائر	34.8447307	5.7939424
240	92	713	الحوش	El Haouch	الحوش، دائرة سيدي عقبة، بسكرة، الجزائر	34.5609494	6.0459519
241	92	711	سيدي عقبة	Sidi Okba	سيدي عقبة، دائرة سيدي عقبة، بسكرة، الجزائر	34.7497613	5.9107849
242	93	712	مشونش	M'chouneche	مشونش، دائرة مشونش، بسكرة، الجزائر	34.9069849	6.0033889
243	94	716	الفيض	El Feidh	الفيض، دائرة زريبة الوادي، بسكرة، الجزائر	34.5005929	6.469635
244	94	733	خنقة سيدي ناجي	Khenguet Sidi Nadji	خنقة سيدي ناجي، دائرة زريبة الوادي، بسكرة، الجزائر	34.8053146	6.7059204
245	94	728	المزيرعة	Meziraa	المزيرعة، دائرة زريبة الوادي، بسكرة، الجزائر	34.7207686	6.2947449
246	94	715	زريبة الوادي	Zeribet El Oued	زريبة الواد، دائرة زريبة الوادي، بسكرة، الجزائر	34.6830199	6.5047333
247	95	718	عين زعطوط	Ain Zaatout	عين زعطوط، دائرة القنطرة، بسكرة، الجزائر	35.146374	5.8373678
248	95	717	القنطرة	El Kantara	القنطرة، دائرة القنطرة، بسكرة، الجزائر	35.2231152	5.7092844
249	96	719	الوطاية	El Outaya	لوطاية، دائرة لوطاية، بسكرة، الجزائر	35.0345657	5.58955
250	97	703	برانيس	Branis	برانيس، دائرة جمورة، بسكرة، الجزائر	34.9947631	5.772251
251	97	720	جمورة	Djemorah	جمورة، دائرة جمورة، بسكرة، 07008، الجزائر	35.0689799	5.8448638
252	98	727	برج بن عزوز	Bordj Ben Azzouz	برج بن عزوز، دائرة طولقة، بسكرة، الجزائر	34.6957162	5.3612562
253	98	729	بوشقرون	Bouchakroun	بوشقرون، دائرة طولقة، بسكرة، 07046، الجزائر	34.7206559	5.4677965
254	98	723	ليشانة	Lichana	ليشانة، دائرة طولقة، بسكرة، 07009، الجزائر	34.7251766	5.4356505
255	98	721	طولقة	Tolga	طولقة، دائرة طولقة، بسكرة، الجزائر	34.73212	5.3830752
256	99	722	ليوة	Lioua	ليوة، دائرة أورلال، بسكرة، 07310، الجزائر	34.6392137	5.4009134
257	99	730	مخادمة	Mekhadma	مخادمة، دائرة أورلال، بسكرة، 07034، الجزائر	34.5644591	5.4612955
258	99	725	مليلي	M'lili	مليلى، دائرة أورلال، بسكرة، الجزائر	34.5760922	5.6243246
259	99	702	أوماش	Oumache	أوماش، دائرة أورلال، بسكرة، الجزائر	34.6952035	5.6991395
260	99	724	أورلال	Ourlal	أورلال، دائرة أورلال، بسكرة، الجزائر	34.5666386	5.5277444
261	100	731	الغروس	El Ghrous	لغروس، دائرة فوغالة، بسكرة، الجزائر	34.7054162	5.2854921
262	100	726	فوغالة	Foughala	فوغالة، دائرة فوغالة، بسكرة، الجزائر	34.7309552	5.3260042
263	102	801	بشار	Bechar	بشار، دائرة بشار، بشار، 08000، الجزائر	31.6165355	-2.2180053
264	103	819	القصابي	Ksabi	القصابي، دائرة أولاد خدير، بني عباس، الجزائر	29.1270304	-0.9856597
265	103	803	أولاد خضير	Ouled-Khodeir	أولاد خدير، دائرة أولاد خدير، بني عباس، الجزائر	29.2565086	-1.0596458
266	104	815	بوكايس	Boukais	بوكايس، دائرة الأحمر، بشار، الجزائر	31.9244504	-2.4678608
267	104	806	لحمر	Lahmar	الأحمر، دائرة الأحمر، بشار، الجزائر	31.8492487	-2.2807576
268	104	816	موغل	Mogheul	موغل، دائرة الأحمر، بشار، الجزائر	32.0233478	-2.2182475
269	105	807	بني عباس	Beni-Abbes	بني عباس، دائرة بني عباس، بني عباس، 08300، الجزائر	30.1317426	-2.169031
270	105	820	تامترت	Tamtert	تامترت، دائرة بني عباس، بني عباس، الجزائر	30.1247014	-1.9016593
271	106	810	القنادسة	Kenadsa	القنادسة، دائرة القنادسة، بشار، 08011، الجزائر	31.5545321	-2.432661
272	106	804	المريجة	Meridja	مريجة، دائرة القنادسة، بشار، الجزائر	31.5491648	-2.9473825
273	107	811	إقلي	Igli	إقلي، دائرة إقلي، بني عباس، 08021، الجزائر	30.4528493	-2.2908264
274	108	812	تبلبالة	Tabelbala	تبلبالة، دائرة تبلبالة، بني عباس، الجزائر	29.4054154	-3.2553664
275	109	813	تاغيت	Taghit	تاغيت، دائرة تاغيت، بشار، 08030، الجزائر	30.9170611	-2.0294754
276	110	814	الواتة	El Ouata	الواتة، دائرة الواتة، بني عباس، الجزائر	29.8608014	-1.8496314
277	111	817	العبادلة	Abadla	العبادلة، دائرة العبادلة، بشار، الجزائر	31.0274839	-2.7104418
278	111	802	عرق فراج	Erg-Ferradj	عرق فراج، دائرة العبادلة، بشار، الجزائر	31.035729	-2.7896737
279	111	809	مشرع هواري بومدين	Machraa-Houari-Boumediene	مشرع هواري بومدين، دائرة العبادلة، بشار، 08027، الجزائر	30.9320605	-2.7375766
280	112	808	بن يخلف	Beni-Ikhlef	بني يخلف، دائرة كرزاز، بني عباس، الجزائر	29.7485147	-1.4355157
281	112	818	كرزاز	Kerzaz	كرزاز، دائرة كرزاز، بني عباس، 08220، الجزائر	29.8816804	-0.8889016
282	112	805	تيمودي	Timoudi	تيمودي، دائرة كرزاز، بني عباس، الجزائر	29.321336	-1.1288101
283	113	821	بني ونيف	Beni-Ounif	بنى ونيف، دائرة بني ونيف، بشار، 08100، الجزائر	32.0501891	-1.2486808
284	115	901	البليدة	Blida	البليدة، دائرة البليدة، البليدة، 09000، الجزائر	36.4705658	2.8274937
285	115	920	بوعرفة	Bouarfa	بوعرفة، دائرة البليدة، البليدة، الجزائر	36.4638905	2.8126394
286	116	903	بوعينان	Bouinan	بوعينان، دائرة بوينان، البليدة، 09450، الجزائر	36.5322102	2.9918496
287	116	902	الشبلي	Chebli	الشبلي، دائرة بوينان، البليدة، الجزائر	36.5774573	3.0090176
288	117	919	بني تامو	Beni-Tamou	بني تامو، دائرة وادي العلايق، البليدة، الجزائر	36.5374705	2.8206529
289	117	910	بن خليل	Benkhelil	بن خليل، دائرة وادي العلايق، البليدة، الجزائر	36.5975244	2.8465063
290	117	904	وادي العلايق	Oued El Alleug	وادي العلايق، دائرة وادي العلايق، البليدة، الجزائر	36.5558374	2.7896358
291	118	921	بني مراد	Beni Mered	بني مراد، دائرة أولاد يعيش، البليدة، 09130، الجزائر	36.523526	2.8616102
292	118	906	الشريعة	Chrea	الشريعة، دائرة أولاد يعيش، البليدة، الجزائر	36.4269205	2.876677
293	118	905	أولاد يعيش	Ouled Yaïch	أولاد يعيش، دائرة أولاد يعيش، البليدة، الجزائر	36.4970451	2.8610493
294	119	907	العفرون	El-Affroun	العفرون، دائرة العفرون، البليدة، الجزائر	36.46975	2.6267421
295	119	918	وادي جر	Oued Djer	وادى جر، دائرة العفرون، البليدة، الجزائر	36.4268459	2.5605348
296	120	924	عين الرمانة	Ain Romana	عين الرمانة، دائرة موزاية، البليدة، الجزائر	36.4062394	2.6913929
297	120	908	الشفة	Chiffa	الشفة، دائرة موزاية، البليدة، الجزائر	36.4622287	2.7409097
298	120	912	موزاية	Mouzaia	موزاية، دائرة موزاية، البليدة، 09210، الجزائر	36.4674416	2.6879953
299	121	925	جبابرة	Djebabra	جبابرة، دائرة مفتاح، البليدة، الجزائر	36.5835753	3.2689028
300	121	914	مفتاح	Meftah	مفتاح، دائرة مفتاح، البليدة، الجزائر	36.6201923	3.2228135
301	122	916	بوفاريك	Boufarik	بوفاريك، دائرة بوفاريك، البليدة، الجزائر	36.5755523	2.9128963
302	122	923	قرواو	Guerrouaou	قرواو، دائرة بوفاريك، البليدة، 09480، الجزائر	36.5264595	2.886115
303	122	911	الصومعة	Soumaa	صومعة، دائرة بوفاريك، البليدة، 09022، الجزائر	36.5184909	2.9084853
304	123	917	الأربعاء	Larbâa	الأربعاء، دائرة الأربعاء، البليدة، الجزائر	36.5648	3.1531
305	123	913	صوحان	Souhane	صوحان، دائرة الأربعاء، البليدة، الجزائر	36.5065702	3.2376389
306	124	922	بوقرة	Bougara	بوقرة، دائرة بوقرة، البليدة، الجزائر	36.5405	3.0844
307	124	909	حمام ملوان	Hammam Elouane	حمام ملوان، دائرة بوقرة، البليدة، الجزائر	36.4869259	3.0446077
308	124	915	اولاد سلامة	Ouled Slama	أولاد سلامة، دائرة بوقرة، البليدة، 09033، الجزائر	36.5534582	3.1153628
309	125	1029	عين الترك	Ain Turk	عين الترك، دائرة البويرة، البويرة، الجزائر	36.3932061	3.8246043
310	125	1008	أيت لعزيز	Ait Laaziz	آيت لعزيز، دائرة البويرة، البويرة، الجزائر	36.4445645	3.8807851
311	125	1001	البويرة	Bouira	البويرة، دائرة البويرة، البويرة، الجزائر	36.3739012	3.9007007
312	126	1044	المقراني	El-Mokrani	المقراني، دائرة سوق الخميس، البويرة، الجزائر	36.4244079	3.6121625
313	126	1004	سوق الخميس	Souk El Khemis	سوق الخمیس، دائرة سوق الخميس، البويرة، 10420، الجزائر	36.3912273	3.631778
314	127	1016	أعمر	Aomar	عمر، دائرة قادرية، البويرة، الجزائر	36.492393	3.7711939
315	127	1026	جباحية	Djebahia	الجباحية، دائرة قادرية، البويرة، الجزائر	36.4768208	3.758111
316	127	1005	قادرية	Kadiria	القادرية، دائرة قادرية، البويرة، 10006، الجزائر	36.5354385	3.6788401
317	128	1012	حيزر	Haizer	حيزر، دائرة حيزر، البويرة، 10063، الجزائر	36.3979925	3.9994448
318	128	1009	تاغزوت	Taghzout	تاغزوت، دائرة حيزر، البويرة، 10063، الجزائر	33.470794	6.7964805
319	129	1023	بودربالة	Bouderbala	بودربالة، دائرة الأخضرية، البويرة، الجزائر	36.5808208	3.5099986
320	129	1034	بوكرم	Boukram	بوكرام، دائرة الأخضرية، البويرة، الجزائر	36.5416035	3.3971591
321	129	1003	قرومة	Guerrouma	قرومة، دائرة الأخضرية، البويرة، الجزائر	36.4326797	3.4277272
322	129	1013	الأخضرية	Lakhdaria	الأخضرية، دائرة الأخضرية، البويرة، 10002، الجزائر	36.5644827	3.5967523
323	129	1014	معلة	Maala	معالة، دائرة الأخضرية، البويرة، الجزائر	36.4943805	3.5892339
324	129	1024	زبربر	Z'barbar (El Isseri )	الزبربر، دائرة الأخضرية، البويرة، الجزائر	36.4726655	3.513905
325	130	1015	الهاشمية	El Hachimia	الهاشمية، دائرة الهاشمية، البويرة، الجزائر	36.2225033	3.8142848
326	130	1045	وادي البردي	Oued El Berdi	وادي البردي، دائرة الهاشمية، البويرة، الجزائر	36.2885851	3.9180743
327	131	1018	برج أوخريص	Bordj Okhriss	برج أوخريص، دائرة برج أوخريص، البويرة، الجزائر	36.0932471	3.9107303
328	131	1042	الحجرة الزرقاء	Hadjera Zerga	الحجرة الزرقاء، دائرة برج أوخريص، البويرة، الجزائر	35.947624	3.8225334
329	131	1011	مزدور	Mezdour	مسدور، دائرة برج أوخريص، البويرة، الجزائر	36.0680635	4.056265
330	131	1028	تاقديت	Taguedite	تاقديت، دائرة برج أوخريص، البويرة، الجزائر	35.953245	3.9556239
331	132	1022	أهل القصر	Ahl El Ksar	أهل القصر، دائرة بشلول، البويرة، الجزائر	36.2528069	4.0414067
332	132	1033	بشلول	Bechloul	بشلول، دائرة بشلول، البويرة، 10012، الجزائر	36.312195	4.0749566
333	132	1019	العجيبة	El Adjiba	العجيبية، دائرة بشلول، البويرة، الجزائر	36.3293456	4.1586858
334	132	1002	الأسنام	El Asnam	الأسنام، دائرة بشلول، البويرة، الجزائر	36.164592	1.331499
335	132	1040	أولاد راشد	Ouled Rached	أولاد راشد، دائرة بشلول، البويرة، الجزائر	36.203503	4.1167725
336	133	1025	عين الحجر	Ain El Hadjar	عین الحجر، دائرة عين بسام، البويرة، 10031، الجزائر	36.3402284	3.8095209
337	133	1041	عين العلوي	Ain Laloui	عين العلوي، دائرة عين بسام، البويرة، 10032، الجزائر	36.3068106	3.750671
338	133	1035	عين بسام	Ain-Bessem	عين بسام، دائرة عين بسام، البويرة، 10400، الجزائر	36.2929113	3.6735417
339	134	1036	بئر غبالو	Bir Ghbalou	بئر غبالو، دائرة بئر غبالو، البويرة، الجزائر	36.2628812	3.5850113
340	134	1021	الخبوزية	El Khabouzia	الخبوزية، دائرة بئر غبالو، البويرة، الجزائر	36.309078	3.5971679
341	134	1010	روراوة	Raouraoua	الروراوة، دائرة بئر غبالو، البويرة، الجزائر	36.2362601	3.6463352
342	135	1027	أغبالو	Aghbalou	أغبالو، دائرة مشدا الله، البويرة، 10007، الجزائر	36.427009	4.352646
343	135	1017	شرفة	Chorfa	شرفة، دائرة مشدا الله، البويرة، 10007، الجزائر	35.4306621	-0.2462883
344	135	1006	حنيف	Hanif	الحانيف، دائرة مشدا الله، البويرة، الجزائر	36.3347997	4.2617798
345	135	1037	أمشدالة	M Chedallah	مشدا الله، دائرة مشدا الله، البويرة، الجزائر	36.3646864	4.2711718
346	135	1030	سحاريج	Saharidj	الصهاريج، دائرة مشدا الله، البويرة، الجزائر	36.3974847	4.2482336
347	135	1043	آث منصور	Ath Mansour	آث منصور، دائرة مشدا الله، البويرة، الجزائر	36.3278259	4.3172601
348	136	1031	الدشمية	Dechmia	الدشمية، دائرة سور الغزلان، البويرة، الجزائر	36.1304762	3.5765765
349	136	1007	ديرة	Dirah	ديرة، دائرة سور الغزلان، البويرة، 28300، الجزائر	36.0022631	3.7215177
350	136	1020	الحاكمية	El-Hakimia	الحاكمية، دائرة سور الغزلان، البويرة، الجزائر	36.0907338	3.7936351
351	136	1039	المعمورة	Maamora	المعمورة، دائرة سور الغزلان، البويرة، الجزائر	36.0331234	3.5514666
352	136	1032	ريدان	Ridane	ريدان، دائرة سور الغزلان، البويرة، الجزائر	36.0738879	3.4620784
353	136	1038	سور الغزلان	Sour El Ghozlane	سور الغزلان، دائرة سور الغزلان، البويرة، الجزائر	36.147376	3.691797
354	137	1109	عين امقل	Ain Amguel	عين أمقل، دائرة تمنراست، تمنراست، الجزائر	23.6909837	5.1509434
355	137	1101	تمنراست	Tamanrasset	تمنراست، دائرة تمنراست، تمنراست، الجزائر	22.7854543	5.5324465
356	138	1102	ابلسة	Abelsa	أبلسة، دائرة أبلسة، تمنراست، الجزائر	22.8895834	4.8469931
357	139	1103	إينغر	In Ghar	إن غار، دائرة إن غار، عين صالح، الجزائر	27.1018319	1.9065264
358	140	1104	عين قزام	Ain Guezzam	عين قزام، دائرة عين قزام، عين قزام، الجزائر	19.5696707	5.7725744
359	141	1105	أدلس	Idles	أدلس، دائرة تاظروك، تمنراست، الجزائر	23.8204317	5.935768
360	141	1106	تاظروك	Tazrouk	تاظروك، دائرة تاظروك، تمنراست، الجزائر	23.4196225	6.2658907
361	142	1107	تين زواتين	Tin Zouatine	تين زواتين، دائرة تين زواتين، عين قزام، 11150، الجزائر	19.9541906	2.9694782
362	143	1108	عين صالح	Ain Salah	عين صالح، دائرة عين صالح، عين صالح، الجزائر	27.1950331	2.4826132
363	143	1110	فقارة الزوى	Foggaret Ezzoua	فقارة الزاوية، دائرة عين صالح، عين صالح، الجزائر	27.3587307	2.8488652
364	146	1201	تبسة	Tebessa	تبسة، دائرة تبسة، تبسة، 12000، الجزائر	35.4035956	8.1212322
365	147	1202	بئر العاتر	Bir-El-Ater	بئر العاتر، دائرة بئر العاتر، تبسة، الجزائر	34.7441882	8.0584012
366	147	1215	العقلة المالحة	El Ogla El Malha	العقلة المالحة، دائرة بئر العاتر، تبسة، الجزائر	35.1331931	8.0066489
367	148	1203	الشريعة	Cheria	الشريعة، دائرة الشريعة، تبسة، الجزائر	35.2706778	7.7527115
368	148	1222	ثليجان	Telidjen	ثليجان، دائرة الشريعة، تبسة، الجزائر	34.839374	7.752124
369	149	1218	بوخضرة	Boukhadra	بوخضرة، دائرة العوينات، تبسة، الجزائر	35.7449518	8.0346837
370	149	1205	العوينات	El-Aouinet	العوينات، دائرة العوينات، تبسة، الجزائر	35.8932925	3.035866
371	150	1228	فركان	Ferkane	فركان، دائرة نقرين، تبسة، الجزائر	34.4930295	7.3645623
372	150	1209	نقرين	Negrine	نقرين، دائرة نقرين، تبسة، 12024، الجزائر	34.4855133	7.5219594
373	151	1210	بئر مقدم	Bir Mokkadem	بٔير المقدم، دائرة بئر مقدم، تبسة، الجزائر	35.3704032	7.8085014
374	151	1216	قريقر	Guorriguer	قوريقر، دائرة بئر مقدم، تبسة، الجزائر	35.4235462	7.5940784
375	151	1208	الحمامات	Hammamet	الحمامات، دائرة بئر مقدم، تبسة، الجزائر	36.8137612	2.9712554
376	152	1217	بكارية	Bekkaria	بكارية، دائرة الكويف، تبسة، الجزائر	35.3746584	8.2407034
377	152	1225	بولحاف الدير	Boulhaf Dyr	بولحاف الدير، دائرة الكويف، تبسة، الجزائر	35.489164	8.0726196
378	152	1211	الكويف	El Kouif	الكويف، دائرة الكويف، تبسة، الجزائر	35.500823	8.321967
379	153	1214	بئر الذهب	Bir Dheheb	بٔير الذھب، دائرة مرسط، تبسة، الجزائر	35.5245771	7.9395054
380	153	1212	مرسط	Morsott	مرسط، دائرة مرسط، تبسة، الجزائر	35.6717654	8.0102728
381	154	1226	بجن	Bedjene	بجن، دائرة العقلة، تبسة، الجزائر	35.3386113	7.4832056
382	154	1227	المزرعة	El Mezeraa	المزرعة، دائرة العقلة، تبسة، الجزائر	35.2627644	7.5767868
383	154	1213	العقلة	El Ogla	العقلة، دائرة العقلة، تبسة، الجزائر	33.2465995	6.9460807
384	154	1204	سطح قنطيس	Stah Guentis	سطح قنطيس، دائرة العقلة، تبسة، الجزائر	34.8335854	7.4997884
385	155	1223	عين الزرقاء	Ain Zerga	عين الزرقاء، دائرة الونزة، تبسة، الجزائر	35.6480159	8.2603257
386	155	1224	المريج	El Meridj	المريج، دائرة الونزة، تبسة، الجزائر	35.8236436	8.2033515
387	155	1219	الونزة	Ouenza	ونزة، دائرة الونزة، تبسة، 12003، الجزائر	35.9445854	8.1369011
388	156	1220	الماء الابيض	El Malabiod	الماء الأبيض، دائرة الماء الأبيض، تبسة، 12014، الجزائر	35.2060924	8.1719694
389	156	1206	الحويجبات	El-Houidjbet	الحويجبات، دائرة الماء الأبيض، تبسة، الجزائر	35.2930512	8.2801524
390	157	1221	أم علي	Oum Ali	أم علي، دائرة أم على، تبسة، الجزائر	35.0113285	8.3007443
391	157	1207	صفصاف الوسرى	Safsaf El Ouesra	صفصاف الوسرة، دائرة أم على، تبسة، الجزائر	34.9564825	8.2071255
392	158	1301	تلمسان	Tlemcen	تلمسان، دائرة تلمسان، تلمسان، 13000، الجزائر	34.881789	-1.316699
393	159	1325	عين النحالة	Ain Nehala	عين نحالة، دائرة عين تالوت، تلمسان، الجزائر	35.032462	-0.9900622
394	159	1303	عين تالوت	Ain Tellout	عين تالوت، دائرة عين تالوت، تلمسان، 13012، الجزائر	34.9299907	-0.9542742
395	160	1315	عين يوسف	Ain Youcef	عين يوسف، دائرة الرمشي، تلمسان، الجزائر	35.0472865	-1.3739319
396	160	1336	بني وارسوس	Beni Ouarsous	بني ورسوس، دائرة الرمشي، تلمسان، الجزائر	35.091454	-1.5830375
397	160	1305	الفحول	El Fehoul	الفحول، دائرة الرمشي، تلمسان، الجزائر	35.1379542	-1.2832125
398	160	1304	الرمشي	Remchi	الرمشي، دائرة الرمشي، تلمسان، الجزائر	35.0617268	-1.4318326
399	160	1322	سبعة شيوخ	Sebaa Chioukh	السبعة شيوخ، دائرة الرمشي، تلمسان، الجزائر	35.1564008	-1.3605746
400	161	1347	بوحلو	Bouhlou	بوحلو، دائرة صبرة، تلمسان، الجزائر	34.8079693	-1.6025722
401	161	1306	صبرة	Sabra	صبرة، دائرة صبرة، تلمسان، الجزائر	34.8260248	-1.530335
402	162	1319	دار يغمراسن	Dar Yaghmoracen	دار يغمراسن، دائرة الغزوات، تلمسان، الجزائر	35.1053188	-1.7741173
403	162	1307	الغزوات	Ghazaouet	الغزوات، دائرة الغزوات، تلمسان، الجزائر	35.093863	-1.86322
404	162	1329	السواحلية	Souahlia	السواحلية، دائرة الغزوات، تلمسان، الجزائر	35.0269936	-1.8970124
405	162	1345	تيانت	Tianet	تيانت، دائرة الغزوات، تلمسان، 13430، الجزائر	35.0522613	-1.838749
406	163	1352	بني صميل	Beni Smiel	بني صميل، دائرة أولاد ميمون، تلمسان، الجزائر	34.7851213	-1.0917147
407	163	1311	وادي الخضر	Oued Lakhdar	الوادي الأخضر، دائرة أولاد ميمون، تلمسان، الجزائر	34.8749626	-1.1341145
408	163	1313	أولاد ميمون	Ouled Mimoun	أولاد ميمون، دائرة أولاد ميمون، تلمسان، 13010، الجزائر	34.904794	-1.0281674
409	164	1342	بني بهدل	Beni Bahdel	بني بهدل، دائرة بني سنوس، تلمسان، الجزائر	34.6937442	-1.5187011
410	164	1317	بني سنوس	Beni Snous	بني سنوس، دائرة بني سنوس، تلمسان، الجزائر	34.6246282	-1.5551957
411	164	1321	العزايل	Azail	العزايل، دائرة بني سنوس، تلمسان، الجزائر	34.6542249	-1.4228284
412	165	1318	باب العسة	Bab El Assa	باب العسة، دائرة باب العسة، تلمسان، الجزائر	34.9661057	-2.0317999
413	165	1308	السواني	Souani	السواني، دائرة باب العسة، تلمسان، الجزائر	34.9221475	-1.9158423
414	165	1333	سوق الثلاثاء	Souk Tleta	سوق الثلاثاء، دائرة باب العسة، تلمسان، الجزائر	35.0270945	-1.9967832
415	166	1331	عين فتاح	Ain Fetah	عين فتاح، دائرة فلاوسن، تلمسان، الجزائر	34.9710827	-1.6437806
416	166	1353	عين الكبيرة	Ain Kebira	العين الكبيرة، دائرة فلاوسن، تلمسان، الجزائر	35.0259971	-1.6817375
417	166	1320	فلاوسن	Fellaoucene	فلاوسن، دائرة فلاوسن، تلمسان، الجزائر	35.0137351	-1.5700733
418	167	1324	بن سكران	Bensekrane	بن سكران، دائرة بن سكران، تلمسان، الجزائر	35.1109	-1.1998396
419	167	1334	سيدي العبدلي	Sidi Abdelli	سيدي العبدلي، دائرة بن سكران، تلمسان، الجزائر	35.044515	-1.1127416
420	168	1326	الحناية	Hennaya	الحناية، دائرة الحناية، تلمسان، الجزائر	36.0955893	4.4743254
421	168	1346	أولاد رياح	Ouled Riyah	أولاد رياح، دائرة الحناية، تلمسان، الجزائر	34.9610292	-1.4980498
422	168	1316	زناتة	Zenata	زناتة، دائرة الحناية، تلمسان، الجزائر	34.9894903	-1.4630565
423	169	1328	حمام بوغرارة	Hammam Boughrara	حمام بوغرارة، دائرة مغنية، تلمسان، 13036، الجزائر	34.8936813	-1.6382574
424	169	1327	مغنية	Maghnia	مغنية، دائرة مغنية، تلمسان، الجزائر	34.847199	-1.729658
425	170	1332	العريشة	El Aricha	العريشة، دائرة سبدو، تلمسان، 13031، الجزائر	34.2240422	-1.2576653
426	170	1310	القور	El Gor	القور، دائرة سبدو، تلمسان، الجزائر	34.5532464	-1.0503708
427	170	1335	سبدو	Sebdou	سبدو، دائرة سبدو، تلمسان، الجزائر	34.6403022	-1.3220383
428	171	1338	بني بوسعيد	Beni Boussaid	بني بوسعيد، دائرة بني بوسعيد، تلمسان، الجزائر	34.6480251	-1.7529879
429	171	1337	سيدي مجاهد	Sidi Medjahed	سيدي مجاهد، دائرة بني بوسعيد، تلمسان، الجزائر	34.7532818	-1.6244529
430	172	1339	مرسى بن مهيدي	Marsa Ben M'hidi	مرسى بن مھيدي، دائرة مرسى بن مهيدي، تلمسان، 13440، الجزائر	35.0817992	-2.2043971
431	172	1330	مسيردة الفواقة	M'sirda Fouaga	مسيردة الفواقة، دائرة مرسى بن مهيدي، تلمسان، 13442، الجزائر	35.0188577	-2.0831565
432	173	1309	جبالة	Djebala	جبالة، دائرة ندرومة، تلمسان، الجزائر	34.9599088	-1.8212834
433	173	1340	ندرومة	Nedroma	ندرومة، دائرة ندرومة، تلمسان، الجزائر	35.0107602	-1.74805
434	174	1343	البويهي	Bouihi	البويھي، دائرة سيدي جيلالي، تلمسان، الجزائر	34.3026316	-1.6021224
435	174	1341	سيدي الجيلالي	Sidi Djillali	سيدي الجيلالي، دائرة سيدي جيلالي، تلمسان، الجزائر	34.4168289	-1.4953807
436	175	1348	بني خلاد	Beni Khellad	بني خلاد، دائرة هنين، تلمسان، الجزائر	35.18283	-1.5846786
437	175	1344	هنين	Honnaine	هنين، دائرة هنين، تلمسان، الجزائر	35.178264	-1.6534421
438	176	1312	عين فزة	Ain Fezza	عين فزة، دائرة شتوان، تلمسان، الجزائر	34.8780405	-1.2348586
439	176	1314	عمير	Amieur	عمير، دائرة شتوان، تلمسان، الجزائر	35.0048057	-1.2377829
440	176	1350	شتوان	Chetouane	شتوان، دائرة شتوان، تلمسان، 13048، الجزائر	34.9207591	-1.2910642
441	177	1349	عين غرابة	Ain Ghoraba	عين غرابة، دائرة منصورة، تلمسان، الجزائر	34.7365837	-1.3976844
442	177	1302	بني مستر	Beni Mester	بني مستار، دائرة منصورة، تلمسان، 13061، الجزائر	34.8704485	-1.4210036
443	177	1351	منصورة	Mansourah	المنصورة، دائرة منصورة، تلمسان، الجزائر	34.8733172	-1.3302647
444	177	1323	تيرني بني هديل	Terny Beni Hediel	تيرني بني هديل، دائرة منصورة، تلمسان، الجزائر	34.7958979	-1.3578281
445	178	1401	تيارت	Tiaret	تيارت، دائرة تيارت، تيارت، الجزائر	35.3659707	1.3184569
446	179	1402	مدروسة	Medroussa	مدروسة، دائرة مدروسة، تيارت، الجزائر	35.1830659	1.1552709
447	179	1412	ملاكو	Mellakou	ملاكو، دائرة مدروسة، تيارت، الجزائر	35.2380662	1.2807715
448	179	1407	سيدي بختي	Sidi Bakhti	سيدي بختي، دائرة مدروسة، تيارت، الجزائر	35.2367811	0.9967505
449	180	1406	عين الذهب	Ain Deheb	عين الذهب، دائرة عين الذهب، تيارت، الجزائر	34.846403	1.5507838
450	180	1436	شحيمة	Chehaima	شحيمة، دائرة عين الذهب، تيارت، الجزائر	34.5446115	1.3907908
451	180	1420	النعيمة	Naima	النعيمة، دائرة عين الذهب، تيارت، الجزائر	34.8070762	1.7094369
452	181	1403	عين بوشقيف	Ain Bouchekif	عين بوشقيف، دائرة الدحموني، تيارت، 14040، الجزائر	35.3307093	1.4846026
453	181	1413	دحموني	Dahmouni	دھمونى، دائرة الدحموني، تيارت، الجزائر	35.4493097	1.4244372
454	182	1422	قرطوفة	Guertoufa	قرطوفة، دائرة رحوية، تيارت، الجزائر	35.4492532	1.167637
455	182	1414	الرحوية	Rahouia	رحوية، دائرة رحوية، تيارت، الجزائر	35.53032	1.0237833
456	183	1405	عين دزاريت	Ain Dzarit	عين دزاريت، دائرة المهدية، تيارت، الجزائر	35.3533903	1.6669943
457	183	1415	مهدية	Mahdia	المھدية، دائرة المهدية، تيارت، الجزائر	35.4569852	1.741478
458	183	1431	الناظورة	Nadorah	الناظورة، دائرة المهدية، تيارت، الجزائر	35.2154942	1.9127933
459	183	1425	السبعين	Sebaine	سبعين، دائرة المهدية، تيارت، الجزائر	35.4589895	1.608022
460	184	1441	الفايجة	Faidja	الفايجة، دائرة السوقر، تيارت، الجزائر	34.8927319	1.961051
461	184	1417	سي عبد الغني	Si Abdelghani	سيدي عبد الغنى، دائرة السوقر، تيارت، الجزائر	35.2087327	1.6768434
462	184	1416	السوقر	Sougueur	السوقر، دائرة السوقر، تيارت، الجزائر	35.186167	1.496745
463	184	1426	توسنينة	Tousnina	توسنينة، دائرة السوقر، تيارت، الجزائر	35.0930304	1.3220813
464	185	1421	مغيلة	Meghila	مغيلة، دائرة مغيلة، تيارت، الجزائر	35.6062255	1.4353918
465	185	1411	السبت	Sebt	السبت، دائرة مغيلة، تيارت، الجزائر	35.6192337	1.3525749
466	185	1423	سيدي حسني	Sidi Hosni	سيدي الحسني، دائرة مغيلة، تيارت، الجزائر	35.5288936	1.5065668
467	186	1418	عين الحديد	Ain El Hadid	عين الحديد، دائرة فرندة، تيارت، الجزائر	35.0554796	0.8856345
468	186	1427	فرندة	Frenda	فرندة، دائرة فرندة، تيارت، الجزائر	35.0655965	1.0566092
469	186	1437	تخمرت	Takhemaret	تاخمرت، دائرة فرندة، تيارت، 14015، الجزائر	35.1072931	0.6833572
470	187	1428	عين كرمس	Ain Kermes	عين كرمس، دائرة عين كرمس، تيارت، الجزائر	34.9288007	1.07039
471	187	1419	جبيلات الرصفاء	Djebilet Rosfa	جبيلات رصفة، دائرة عين كرمس، تيارت، الجزائر	34.8464075	0.7943003
472	187	1410	مادنة	Madna	مادنة، دائرة عين كرمس، تيارت، الجزائر	34.7539462	0.9831648
473	187	1408	مدريسة	Medrissa	مدريسة، دائرة عين كرمس، تيارت، 14013، الجزائر	34.8924859	1.2458048
474	187	1438	سيدي عبد الرحمن	Sidi Abderrahmane	سيدي عبد الرحمن، دائرة عين كرمس، تيارت، 14013، الجزائر	36.4791747	1.1257586
475	188	1429	قصر الشلالة	Ksar Chellala	قصر الشلالة، دائرة قصر الشلالة، تيارت، 14011، الجزائر	35.2143453	2.3129403
476	188	1439	سرغين	Serghine	سرغين، دائرة قصر الشلالة، تيارت، الجزائر	35.2543447	2.4856664
477	188	1409	زمالة الأمير عبد القادر	Zmalet El Emir Abdelkade	زمالة الأمير عبد القادر، دائرة قصر الشلالة، تيارت، 14330، الجزائر	34.894606	2.3099441
478	189	1433	وادي ليلي	Oued Lilli	وادى ليلى، دائرة وادى ليلى، تيارت، الجزائر	35.5070619	1.2673933
479	189	1404	سيدي علي ملال	Sidi Ali Mellal	سيدي علي ملال، دائرة وادى ليلى، تيارت، الجزائر	35.6006223	1.1674239
480	189	1442	تيدة	Tidda	تيدة، دائرة وادى ليلى، تيارت، الجزائر	35.6025161	1.2706208
481	190	1424	جيلالي بن عمار	Djillali Ben Amar	جيلالي بن عمار، دائرة مشرع الصفاء، تيارت، الجزائر	35.4459222	0.8499086
482	190	1434	مشرع الصفا	Mechraa Safa	مشرع الصفاء، دائرة مشرع الصفاء، تيارت، 14145، الجزائر	35.3848636	1.0544339
483	190	1432	تاقدمت	Tagdempt	تاقدمت، دائرة مشرع الصفاء، تيارت، الجزائر	35.3347734	1.2290501
484	191	1557	بوقرة	Bougara	بوقرة، دائرة الحمادية، تيارت، الجزائر	35.5461352	1.9893403
485	191	1435	حمادية	Hamadia	حمادية، دائرة الحمادية، تيارت، الجزائر	35.4584077	1.8723935
486	191	1430	الرشايقة	Rechaiga	الرشايقة، دائرة الحمادية، تيارت، الجزائر	35.312233	2.1203069
487	192	1501	تيزي وزو	Tizi-Ouzou	تيزي وزو، دائرة تيزي وزو، تيزي وزو، الجزائر	36.7137843	4.0493919
488	193	1531	أبي يوسف	Abi-Youcef	أبي يوسف، دائرة عین الحمام، تيزي وزو، الجزائر	36.5384746	4.3438612
489	193	1502	عين الحمام	Ain-El-Hammam	عين الحمام، دائرة عین الحمام، تيزي وزو، 15200، الجزائر	36.5704326	4.3111366
490	193	1527	أيت يحيى	Ait-Yahia	أيت يحي، دائرة عین الحمام، تيزي وزو، الجزائر	36.5992546	4.3434679
491	193	1503	اقبيل	Akbil	أقبيل، دائرة عین الحمام، تيزي وزو، الجزائر	36.5040238	4.310016
492	194	1555	بوجيمة	Boudjima	بوجيمة، دائرة ماكودة، تيزي وزو، الجزائر	36.8047072	4.14884
493	194	1509	ماكودة	Makouda	ماكودة، دائرة ماكودة، تيزي وزو، الجزائر	36.7919734	4.0624221
494	195	1525	عين الزاوية	Ain-Zaouia	عين الزاوية، دائرة ذراع الميزان، تيزي وزو، 15056، الجزائر	36.5502351	3.8948674
495	195	1556	أيت يحي موسى	Ait Yahia Moussa	أيت يحي موسى، دائرة ذراع الميزان، تيزي وزو، الجزائر	36.6379122	3.8862283
496	195	1510	ذراع الميزان	Draa-El-Mizan	ذراع الميزان، دائرة ذراع الميزان، تيزي وزو، الجزائر	36.5350648	3.8380358
497	195	1514	فريقات	Frikat	فريقات، دائرة ذراع الميزان، تيزي وزو، الجزائر	36.5133532	3.8856598
498	196	1526	مكيرة	M'kira	مكيرة، دائرة تيزي غنيف، تيزي وزو، الجزائر	36.6315675	3.7830006
499	196	1511	تيزي غنيف	Tizi-Gheniff	تيزي غنيف، دائرة تيزي غنيف، تيزي وزو، 15020، الجزائر	36.5872274	3.7742759
500	197	1517	إفرحونان	Iferhounene	إيفرحونن، دائرة إيفرحونن، تيزي وزو، الجزائر	36.5209675	4.3695222
501	197	1533	إيليلتن	Illilten	إليلتن، دائرة إيفرحونن، تيزي وزو، 15037، الجزائر	36.5160617	4.3944151
502	197	1563	إمسوحال	Imsouhal	أمسوحال، دائرة إيفرحونن، تيزي وزو، 15024، الجزائر	36.5802779	4.3927117
503	198	1518	عزازقة	Azazga	عزازقة، دائرة عزازڨة، تيزي وزو، 15300، الجزائر	36.744738	4.3716399
504	198	1504	فريحة	Freha	فريحة، دائرة عزازڨة، تيزي وزو، الجزائر	36.757399	4.3194454
505	198	1541	إيفيغاء	Ifigha	إيفيغاء، دائرة عزازڨة، تيزي وزو، الجزائر	36.6714929	4.4137989
506	198	1520	إعكورن	Yakourene	إعكوران، دائرة عزازڨة، تيزي وزو، الجزائر	36.7335937	4.4389944
507	198	1523	زكري	Zekri	زكري، دائرة عزازڨة، تيزي وزو، الجزائر	36.7803397	4.5895193
508	199	1535	أيت عقواشة	Ait Aggouacha	أيت قواشة، دائرة الأربعاء نايث إيراثن، تيزي وزو، الجزائر	36.6178136	4.232488
509	199	1507	إيرجن	Irdjen	إرجن، دائرة الأربعاء نايث إيراثن، تيزي وزو، الجزائر	36.6683028	4.1464762
510	199	1521	الأربعاء ناث إيراثن	Larbaa Nath Irathen	الأربعاء نايث إيراثنن دائرة الأربعاء نايث إيراثن، تيزي وزو، 15002، الجزائر	36.6374918	4.2028466
511	200	1542	أيت أومالو	Ait-Oumalou	أيت أومالو، دائرة تيزي راشد، تيزي وزو، الجزائر	36.6551698	4.2284389
512	200	1522	تيزي راشد	Tizi-Rached	تيزي راشد، دائرة تيزي راشد، تيزي وزو، الجزائر	36.6789662	4.2086164
513	201	1539	أيت عيسى ميمون	Ait-Aissa-Mimoun	آيت عيسى ميمون، دائرة واقنون، تيزي وزو، الجزائر	36.7506544	4.1103247
514	201	1524	واقنون	Ouaguenoun	واقنون، دائرة واقنون، تيزي وزو، الجزائر	36.7588492	4.1844109
515	201	1508	تيميزار	Timizart	تيميزارت، دائرة واقنون، تيزي وزو، الجزائر	36.7978208	4.2461875
516	202	1529	معاتقة	Maatkas	المعاتقة، دائرة المعاتقة، تيزي وزو، الجزائر	36.6107175	3.9701861
517	202	1557	سوق الإثنين	Souk-El-Tenine	سوق الإثنين، دائرة المعاتقة، تيزي وزو، الجزائر	36.5950832	4.007301
518	203	1528	أيت محمود	Ait-Mahmoud	أيت محمود، دائرة بني دوالة، تيزي وزو، 15193، الجزائر	36.6101803	4.119514
519	203	1516	بني زمنزار	Beni Zmenzer	بني زمنزر، دائرة بني دوالة، تيزي وزو، 15029، الجزائر	36.6370642	4.039063
520	203	1515	بني عيسي	Beni-Aissi	بني عيسي، دائرة بني دوالة، تيزي وزو، الجزائر	36.6577045	4.0893302
521	203	1532	بني دوالة	Beni-Douala	بني دوالة، دائرة بني دوالة، تيزي وزو، 15190، الجزائر	36.6188796	4.0824933
522	204	1546	بني زيكي	Beni-Zikki	بني زيكي، دائرة بوزغن، تيزي وزو، الجزائر	36.565846	4.5068005
523	204	1534	بوزقن	Bouzeguene	بوغزن، دائرة بوزغن، تيزي وزو، 15327، الجزائر	36.6170412	4.477024
524	204	1549	إيجار	Idjeur	إجر، دائرة بوزغن، تيزي وزو، 15036، الجزائر	36.673917	4.536323
525	204	1519	إيلولة أومالو	Illoula Oumalou	إيلولة أمالو، دائرة بوزغن، تيزي وزو، الجزائر	36.5649995	4.4487366
526	205	1561	أقني قغران	Agouni-Gueghrane	أقني قغران، دائرة واضية، تيزي وزو، الجزائر	36.5144128	4.1134908
527	205	1565	أيت بوادو	Ait Bouaddou	أيت بوعدو، دائرة واضية، تيزي وزو، الجزائر	36.5032098	4.0612545
528	205	1536	واضية	Ouadhias	واضية، دائرة واضية، تيزي وزو، 15058، الجزائر	36.5494	4.0842
529	205	1551	تيزي نثلاثة	Tizi N'tleta	تيزي نثلاثة، واضية، تيزي وزو، 15058، الجزائر	36.5460983	4.0576122
530	206	1553	أغريب	Aghribs	أغريب، دائرة أزفون، تيزي وزو، 15022، الجزائر	36.8045313	4.3230947
531	206	1513	أيت شافع	Ait-Chafaa	أيت شافع، دائرة أزفون، تيزي وزو، الجزائر	36.8225002	4.5255284
532	206	1544	أقرو	Akerrou	أقرو، دائرة أزفون، تيزي وزو، 15076، الجزائر	36.807439	4.4421846
533	206	1537	أزفون	Azeffoun	أزفون، دائرة أزفون، تيزي وزو، 15045، الجزائر	36.8930725	4.4203917
534	207	1554	إفليسن	Iflissen	إفليسن، دائرة تيقزيرت، تيزي وزو، الجزائر	36.8722167	4.2221877
535	207	1562	ميزرانة	Mizrana	مزرانة، دائرة تيقزيرت، تيزي وزو، 15062، الجزائر	36.8447164	4.0962588
536	207	1538	تيقزيرت	Tigzirt	تيقزيرت، دائرة تيقزيرت، تيزي وزو، الجزائر	36.8926614	4.126179
537	208	1566	أسي يوسف	Assi-Youcef	أسي يوسف، دائرة بوغني، تيزي وزو، 15326، الجزائر	36.5055421	4.0145154
538	208	1540	بوغني	Boghni	بوغني، دائرة بوغني، تيزي وزو، 15003، الجزائر	36.5407471	3.9571285
539	208	1512	بونوح	Bounouh	بونوح، دائرة بوغني، تيزي وزو، 15445، الجزائر	36.493265	3.9375656
540	208	1506	مشطراس	Mechtras	مشطراس، دائرة بوغني، تيزي وزو، 15042، الجزائر	36.5438917	4.011092
541	209	1547	ذراع بن خدة	Draa-Ben-Khedda	ذراع بن خدة، دائرة ذراع بن خدة، تيزي وزو، الجزائر	36.7331343	3.9590903
542	209	1559	سيدي نعمان	Sidi Namane	سيدي نعمان، دائرة ذراع بن خدة، تيزي وزو، الجزائر	36.7586177	3.9814233
543	209	1564	تادمايت	Tadmait	تادمايت، دائرة ذراع بن خدة، تيزي وزو، الجزائر	36.7446573	3.9012256
544	209	1543	تيرمتين	Tirmitine	تيرمتين، دائرة ذراع بن خدة، تيزي وزو، الجزائر	36.6686811	3.9653731
545	210	1530	أيت بومهدي	Ait Boumahdi	أيت بومهدي، دائرة واسيف، تيزي وزو، الجزائر	36.4988813	4.2019993
546	210	1567	أيت تودرت	Ait-Toudert	أيت تودرت، دائرة واسيف، تيزي وزو، الجزائر	36.5203106	4.1844513
547	210	1548	واسيف	Ouacif	واسيف، دائرة واسيف، تيزي وزو، 15015، الجزائر	36.523854	4.2049176
548	211	1558	أيت خليلي	Ait Khellili	أيت خليلي، دائرة مقلع، تيزي وزو، الجزائر	36.6757921	4.30882
549	211	1550	مقلع	Mekla	مقلع، دائرة مقلع، تيزي وزو، الجزائر	36.6876391	4.2681185
550	211	1505	صوامع	Souamaâ	الصوامع، دائرة مقلع، تيزي وزو، الجزائر	36.6422876	4.3422178
551	212	1552	بني يني	Beni-Yenni	بني يني، دائرة بني يني، تيزي وزو، الجزائر	36.5829452	4.1964738
552	212	1560	إبودرارن	Iboudrarene	إبودرارن، دائرة بني يني، تيزي وزو، الجزائر	36.509314	4.2512824
553	212	1545	يطافن	Yatafene	إعطافن، دائرة بني يني، تيزي وزو، الجزائر	36.5519079	4.2557573
554	213	1601	الجزائر الوسطى	Alger Centre	الجزائر الوسطى، دائرة سيدي امحمد، الجزائر	36.7761881	3.0583128
555	213	1603	المدنية	El Madania	المدنية، دائرة سيدي امحمد، الجزائر	36.7420067	3.0665715
556	213	1627	المرادية	El Mouradia	المرادية، دائرة سيدي امحمد، الجزائر	36.7474963	3.0500935
557	213	1602	سيدي امحمد	Sidi M'hamed	سيدي امحمد، دائرة سيدي امحمد، الجزائر	36.7644238	3.0496319
558	214	1605	باب الوادي	Bab El Oued	باب الوادي، دائرة باب الوادي، الجزائر	36.7907677	3.0530812
559	214	1606	بولوغين بن زيري	Bologhine Ibnou Ziri	بولوغين، دائرة باب الوادي، الجزائر	36.8046778	3.0426168
560	214	1607	القصبة	Casbah	القصبة، دائرة باب الوادي، الجزائر، 16307، الجزائر	36.7846766	3.0595865
561	214	1608	وادي قريش	Oued Koriche	وادي قريش، دائرة باب الوادي، الجزائر، 16606، الجزائر	36.7853487	3.0430918
562	214	1625	الرايس حميدو	Rais Hamidou	الرئيس حميدو، دائرة باب الوادي، الجزائر	36.8174128	3.0114701
563	215	1609	بئر مراد رايس	Bir Mourad Rais	بئر مراد رايس، دائرة بئر مراد رايس، الجزائر	36.7393938	3.0500748
564	215	1612	بئر خادم	Birkhadem	بئر خادم، دائرة بئر مراد رايس، الجزائر	36.716075	3.0497361
565	215	1626	جسر قسنطينة	Djasr Kasentina	جسر قسنطينة، دائرة بئر مراد رايس، الجزائر	36.7024722	3.0801951
566	215	1628	حيدرة	Hydra	حيدرة، دائرة بئر مراد رايس، الجزائر	36.7474259	3.0401832
567	215	1645	السحاولة	Sehaoula	سحاولة، دائرة بئر مراد رايس، الجزائر	36.7027016	3.0238994
568	216	1622	ابن عكنون	Ben Aknoun	بن عكنون، دائرة بوزريعة، الجزائر	36.759271	3.0197169
569	216	1632	بني مسوس	Beni Messous	بني مسوس، دائرة بوزريعة، الجزائر	36.7800996	2.9745358
570	216	1611	بوزريعة	Bouzareah	بوزريعة، دائرة بوزريعة، الجزائر	36.790372	3.0166197
571	216	1610	الابيار	El Biar	الأبيار، دائرة بوزريعة، الجزائر	36.7688818	3.030651
572	217	1619	باش جراح	Bachedjerah	باش جراح، دائرة الحراش، الجزائر	36.7230264	3.1130729
573	217	1616	بوروبة	Bourouba	بوروبة، دائرة الحراش، الجزائر	36.7138232	3.1125789
574	217	1613	الحراش	El Harrach	الحراش، دائرة الحراش، الجزائر، 16200، الجزائر	36.7119155	3.1388943
575	217	1615	وادي السمار	Oued Smar	وادي السمار، دائرة الحراش، الجزائر	36.7044199	3.1681561
576	218	1614	براقي	Baraki	براقي، دائرة براقي، الجزائر	36.6700049	3.1003152
577	218	1633	الكاليتوس	Les Eucalyptus	الكاليتوس، دائرة براقي، الجزائر	36.6567143	3.1472616
578	218	1637	سيدي موسى	Sidi Moussa	سيدي موسى، دائرة براقي، الجزائر، 16189، الجزائر	36.6062538	3.0881462
579	219	1631	المغارية	El Magharia	المقارية، دائرة حسين داي، الجزائر	36.7313349	3.1085569
580	219	1617	حسين داي	Hussein Dey	حسين داي، دائرة حسين داي، الجزائر	36.7429388	3.094027
581	219	1618	القبة	Kouba	القبة، دائرة حسين داي، الجزائر	36.7324436	3.0875358
582	219	1604	محمد بلوزداد	Mohamed Belouzdad	بلوزداد، دائرة حسين داي، الجزائر	36.7442413	3.0783959
583	220	1641	عين طاية	Ain Taya	عين طاية، دائرة الدار البيضاء، الجزائر	36.7912902	3.2926194
584	220	1621	باب الزوار	Bab Ezzouar	باب الزوار، دائرة الدار البيضاء، الجزائر	36.7228021	3.1838863
585	220	1642	برج البحري	Bordj El Bahri	برج البحري، دائرة الدار البيضاء، الجزائر، 16046، الجزائر	36.7907949	3.2501775
586	220	1630	برج الكيفان	Bordj El Kiffan	برج الكيفان، دائرة الدار البيضاء، الجزائر	36.747273	3.1908953
587	220	1620	الدار البيضاء	Dar El Beida	الدار البيضاء، دائرة الدار البيضاء، الجزائر	36.7149768	3.2094611
588	220	1643	المرسى	El Marsa	المرسى، دائرة الدار البيضاء، الجزائر، 16115، الجزائر	36.8091281	3.2546039
589	220	1601	المحمدية	Mohammadia	الجزائر، دائرة الجزائر، ولاية الجزائر	36.733333	3.133333
590	221	1636	بئر توتة	Bir Touta	بئر توتة، دائرة بئر توتة، الجزائر	36.6449884	2.9985533
591	221	1635	اولاد شبل	Ouled Chebel	أولاد شبل، دائرة بئر توتة، الجزائر، 16118، الجزائر	36.5981574	2.9949504
592	221	1634	تسالة المرجة	Tessala El Merdja	تسالة المرجة، دائرة بئر توتة، الجزائر	36.6307193	2.9455174
593	222	1639	هراوة	Herraoua	هراوة، دائرة الرويبة، الجزائر	36.7727459	3.3085008
594	222	1640	رغاية	Reghaia	الرويبة، دائرة الرويبة، الجزائر	36.726804	3.3080903
595	222	1638	الرويبة	Rouiba	الرويبة، دائرة الرويبة، الجزائر	36.7364237	3.2826417
596	223	1646	المعالمة	Maalma	محالمة، دائرة زرالدة، الجزائر	36.6823629	2.87765
597	223	1650	الرحمانية	Rahmania	الرحمانية، دائرة زرالدة، الجزائر	36.6805367	2.9064684
598	223	1655	سويدانية	Souidania	سويدانية، دائرة زرالدة، الجزائر، 16097، الجزائر	36.7079748	2.9125592
599	223	1653	سطاوالي	Staoueli	سطاوالي، دائرة زرالدة، الجزائر	36.7532755	2.8881822
600	223	1644	زرالدة	Zeralda	زرالدة، دائرة زرالدة، الجزائر، 16063، الجزائر	36.7120392	2.8407894
601	224	1647	بابا حسن	Baba Hassen	بابا حسن، دائرة درارية، الجزائر	36.6943783	2.9718223
602	224	1648	الدويرة	Douira	دويرة، دائرة درارية، الجزائر	36.6668605	2.9261689
603	224	1649	الدرارية	Draria	درارية، دائرة درارية، الجزائر	36.7137875	3.0016025
604	224	1654	العاشور	El Achour	العاشور، دائرة درارية، الجزائر	36.7341624	2.9905236
605	224	1656	الخرايسية	Khraissia	خرايسية، دائرة درارية، الجزائر	36.6771868	2.98177
606	225	1657	عين بنيان	Ain Benian	عين البنيان، دائرة شراقة، الجزائر، 16202، الجزائر	36.8033059	2.9216786
607	225	1652	الشراقة	Cheraga	الشراقة، دائرة شراقة، الجزائر	36.7669269	2.9602571
608	225	1623	دالي ابراهيم	Dely Ibrahim	دالي إبراھيم، دائرة شراقة، الجزائر	36.7520316	2.9815101
609	225	1624	الحمامات	Hammamet	الحمامات، دائرة شراقة، الجزائر، 16060، الجزائر	36.8137612	2.9712554
610	225	1651	اولاد فايت	Ouled Fayet	أولاد فايت، دائرة شراقة، الجزائر	36.7355249	2.9509064
611	226	1701	الجلفة	Djelfa	الجلفة، دائرة الجلفة، الجلفة، الجزائر	34.6713867	3.2540193
612	227	1705	عين معبد	Ain Maabed	عين معبد، دائرة حاسي بحبح، الجلفة، الجزائر	34.8361526	3.1503724
613	227	1704	حاسي بحبح	Hassi Bahbah	حاسي بحبح، دائرة حاسي بحبح، الجلفة، الجزائر	35.0747536	3.0270488
614	227	1716	حاسي العش	Hassi El Euch	حاسى العش، دائرة حاسي بحبح، الجلفة، الجزائر	35.1526924	3.2484615
615	227	1728	زعفران	Zaafrane	الزعفران، دائرة حاسي بحبح، الجلفة، الجزائر	34.8502549	2.8549624
616	228	1734	عمورة	Amourah	عمورة، دائرة فيض البطمة، الجلفة، الجزائر	34.2107795	4.0019497
617	228	1707	فيض البطمة	Faidh El Botma	فيض البطمة، دائرة فيض البطمة، الجلفة، الجزائر	34.5286598	3.784909
618	228	1724	أم العظام	Oum Laadham	أم العظام، دائرة فيض البطمة، الجلفة، الجزائر	33.7200204	4.5309925
619	229	1732	بنهار	Benhar	بن ھار، دائرة البيرين، الجلفة، الجزائر	35.484908	3.00944
620	229	1708	بيرين	Birine	البيرين، دائرة البيرين، الجلفة، 17014، الجزائر	35.6337386	3.2244016
621	230	1723	عين الشهداء	Ain Chouhada	عين الشهداء، دائرة الادريسية، الجلفة، الجزائر	34.2233597	2.5835274
622	230	1715	دويس	Douis	الدويس، دائرة الادريسية، الجلفة، الجزائر	34.2617665	2.7589342
623	230	1714	الادريسية	El Idrissia	الادريسية، دائرة الادريسية، الجلفة، 17020، الجزائر	34.4486677	2.5312873
624	231	1729	دلدول	Deldoul	دلدول، دائرة مسعد، الجلفة، الجزائر	34.0499446	3.3681607
625	231	1718	قطارة	Guettara	قطارة، دائرة مسعد، الجلفة، الجزائر	33.2917533	4.4125973
626	231	1717	مسعد	Messaad	مسعد، دائرة مسعد، الجلفة، 17400، الجزائر	34.1540811	3.492231
627	231	1706	سد الرحال	Sed Rahal	سد رحال، دائرة مسعد، الجلفة، الجزائر	33.7457193	3.5676602
628	231	1722	سلمانة	Selmana	سلمانة، دائرة مسعد، الجلفة، الجزائر	34.0307982	3.7265198
629	232	1711	الخميس	El Khemis	الخميس، دائرة سيدي لعجال، الجلفة، الجزائر	35.4050761	2.7048777
630	232	1733	حاسي فدول	Hassi Fedoul	حاسي فدول، دائرة سيدي لعجال، الجلفة، الجزائر	35.4367123	2.2141025
631	232	1719	سيدي لعجال	Sidi Laadjel	سيدي لعجال، دائرة سيدي لعجال، الجلفة، 17215، الجزائر	35.4381272	2.5157705
632	233	1735	عين فقه	Aïn Feka	عين أفقه، دائرة حد الصحارى، الجلفة، الجزائر	35.4266507	3.5776041
633	233	1709	بويرة الأحداب	Bouira Lahdab	بويرة الأحداب، دائرة حد الصحارى، الجلفة، 17001، الجزائر	35.2156173	3.1179793
634	233	1720	حد الصحاري	Had Sahary	حد الصحارى، دائرة حد الصحارى، الجلفة، الجزائر	35.3506602	3.3640573
635	234	1725	دار الشيوخ	Dar Chioukh	دار الشيوخ، دائرة دار الشيوخ، الجلفة، 17006، الجزائر	34.8972924	3.4897249
636	234	1713	مليليحة	M'liliha	المليليحة، دائرة دار الشيوخ، الجلفة، الجزائر	34.7195744	3.688974
637	234	1712	سيدي بايزيد	Sidi Baizid	سيدي بايزيد، دائرة دار الشيوخ، الجلفة، الجزائر	35.018807	3.4321688
638	235	1727	بنى يعقوب	Beni Yagoub	بني يعقوب، دائرة الشارف، الجلفة، 17015، الجزائر	34.4658	2.785
639	235	1726	الشارف	Charef	الشارف، دائرة الشارف، الجلفة، 17015، الجزائر	34.6270918	2.8059171
640	235	1703	القديد	El Guedid	القديد، دائرة الشارف، الجلفة، الجزائر	34.6654861	2.5297751
641	236	1730	عين الإبل	Ain El Ibel	عين الابل، دائرة عين الإبل، الجلفة، الجزائر	34.3550616	3.2238301
642	236	1702	مجبارة	Moudjebara	مجبارة، دائرة عين الإبل، الجلفة، الجزائر	34.4873655	3.5093286
643	236	1736	تعظميت	Tadmit	تاعظميت، دائرة عين الإبل، الجلفة، الجزائر	34.2900969	2.9443456
644	236	1710	زكار	Zaccar	زكار، دائرة عين الإبل، الجلفة، 17003، الجزائر	34.4653722	3.345271
645	237	1731	عين وسارة	Ain Oussera	عين وسارة، دائرة عين وسارة، الجلفة، الجزائر	35.4492582	2.9071065
646	237	1721	قرنيني	Guernini	ڨرنيني، دائرة عين وسارة، الجلفة، الجزائر	35.1687715	2.7876915
647	238	1801	جيجل	Jijel	جيجل، دائرة جيجل، جيجل، الجزائر	36.8167305	5.771494
648	239	1803	العوانة	El Aouana	العوانة، دائرة العوانة، جيجل، الجزائر	36.7716565	5.6114699
649	239	1818	سلمى بن زيادة	Selma Benziada	سلمى بن زيادة، دائرة العوانة، جيجل، الجزائر	36.6499954	5.633193
650	240	1802	أراقن سويسي	Erraguene Souissi	إيراقن سويسي، دائرة زيامة منصورية، جيجل، الجزائر	36.5864588	5.5812865
651	240	1804	زيامة منصورية	Ziama Mansouriah	زيامة منصورية، دائرة زيامة منصورية، جيجل، الجزائر	36.6721506	5.4808312
652	241	1819	بوسيف أولاد عسكر	Boussif Ouled Askeur	بوسيف أولاد عسكر، دائرة الطاهير، جيجل، الجزائر	36.663596	6.0177536
653	241	1808	الشحنة	Chahna	الشحنة، دائرة الطاهير، جيجل، الجزائر	36.658667	5.9442005
654	241	1806	الامير عبد القادر	Emir Abdelkader	الأمير عبد القادر، دائرة الطاهير، جيجل، 18038، الجزائر	36.7546904	5.8443228
655	241	1828	وجانة	Oudjana	وجانة، دائرة الطاهير، جيجل، الجزائر	36.6754271	5.8837994
656	241	1805	الطاهير	Taher	الطاهير، دائرة الطاهير، جيجل، الجزائر	36.7712912	5.897589
657	242	1826	برج الطهر	Bordj T'har	برج الطهر، دائرة الشقفة، جيجل، الجزائر	36.7483018	6.0512774
658	242	1807	الشقفة	Chekfa	الشقفة، دائرة الشقفة، جيجل، الجزائر	36.7712723	5.9612456
659	242	1820	القنار نشفي	El Kennar Nouchfi	القنار نشفي، دائرة الشقفة، جيجل، الجزائر	36.8125018	5.9862932
660	242	1813	سيدي عبد العزيز	Sidi Abdelaziz	سيدي عبد العزيز، دائرة الشقفة، جيجل، الجزائر	36.853261	6.051473
661	243	1809	الميلية	El Milia	الميلية، دائرة الميلية، جيجل، الجزائر	36.7514104	6.2744614
662	243	1821	أولاد يحيى خدروش	Ouled Yahia Khadrouch	أولاد يحيى خدروش، دائرة الميلية، جيجل، الجزائر	36.6907198	6.1901373
663	244	1827	أولاد رابح	Ouled Rabah	أولاد رابح، دائرة سيدي معروف، جيجل، الجزائر	36.6216559	6.17312
664	244	1810	سيدي معروف	Sidi Marouf	سيدي معروف، دائرة سيدي معروف، جيجل، 18018، الجزائر	36.6400065	6.2741706
665	245	1815	غبالة	Ghebala	غبالة، دائرة السطارة، جيجل، الجزائر	36.62825	6.388218
666	245	1811	السطارة	Settara	السطارة، دائرة السطارة، جيجل، 18113، الجزائر	36.7052717	6.3591657
667	246	1816	بوراوي بلهادف	Bouraoui Belhadef	بوراوي بلهادف، دائرة العنصر، جيجل، الجزائر	36.6955352	6.09517
668	246	1825	الجمعة بني حبيبي	Djemaa Beni Habibi	الجمعة بني حبيبي، دائرة العنصر، جيجل، 18029، الجزائر	36.8010447	6.0932644
669	246	1812	العنصر	El Ancer	العنصر، دائرة العنصر، جيجل، الجزائر	36.7941635	6.1770786
670	246	1823	خيري واد عجول	Kheïri Oued Adjoul	خيري وادي العجول، دائرة العنصر، جيجل، الجزائر	36.8577899	6.1573925
671	247	1822	بودريعة بني ياجيس	Boudriaa Ben Yadjis	بودريعة بن ياجيس، دائرة جيملة، جيجل، الجزائر	36.5901257	5.7595624
672	247	1817	جيملة	Djimla	جيملة، دائرة جيملة، جيجل، الجزائر	36.582172	5.8973801
673	248	1814	قاوس	Kaous	قاوس، دائرة تاكسنة، جيجل، الجزائر	36.7701723	5.8136168
674	248	1824	تاكسنة	Texenna	تاكسنة، دائرة تاكسنة، جيجل، الجزائر	36.6605708	5.7909778
675	249	1901	سطيف	Setif	سطيف، دائرة سطيف، سطيف، 19000، الجزائر	36.1895852	5.4024656
676	250	1902	عين الكبيرة	Ain El Kebira	عين الكبيرة، دائرة عين الكبيرة، سطيف، الجزائر	36.3648446	5.5069356
677	250	1915	الدهامشة	Dehamcha	الدهامشة، دائرة عين الكبيرة، سطيف، الجزائر	36.3835662	5.5924952
678	250	1924	أولاد عدوان	Ouled Addouane	أولاد عدوان، دائرة عين الكبيرة، سطيف، 19058، الجزائر	36.3375879	5.4374755
679	251	1949	عين السبت	Ain-Sebt	عين السبت، دائرة بني عزيز، سطيف، 19033، الجزائر	36.4949511	5.7185575
680	251	1903	بني عزيز	Beni-Aziz	بني عزيز، دائرة بني عزيز، سطيف، الجزائر	36.4645062	5.6490139
681	251	1912	معاوية	Maaouia	معاوية، دائرة بني عزيز، سطيف، الجزائر	36.375027	5.7118248
682	252	1925	بلاعة	Bellaa	بلاعة، دائرة بير العرش، سطيف، الجزائر	36.220694	5.8690571
683	252	1908	بئر العرش	Bir-El-Arch	بير العرش، دائرة بير العرش، سطيف، الجزائر	36.1303925	5.8392064
684	252	1959	الولجة	El-Ouldja	الولجة، دائرة بير العرش، سطيف، 19670، الجزائر	36.088243	5.9221989
685	252	1945	تاشودة	Tachouda	تاشودة، دائرة بير العرش، سطيف، الجزائر	36.267485	5.7400239
686	253	1916	بابور	Babor	بابور، دائرة بابور، سطيف، الجزائر	36.4898622	5.5378293
687	253	1935	سرج الغول	Serdj-El-Ghoul	سرج الغول، دائرة بابور، سطيف، الجزائر	36.4778394	5.5804802
688	254	1917	قجال	Guidjel	قجال، دائرة قجال، سطيف، الجزائر	36.081278	5.4920263
689	254	1947	أولاد صابر	Ouled Sabor	أولاد صابر، دائرة قجال، سطيف، الجزائر	36.1819425	5.5403857
690	255	1931	بازر سكرة	Bazer-Sakra	بازر سكرة، دائرة العلمة، سطيف، 19045، الجزائر	36.1163229	5.7111139
691	255	1920	العلمة	El Eulma	العلمة، دائرة العلمة، سطيف، الجزائر	36.1529057	5.6911588
692	255	1956	قلتة زرقاء	Guelta Zerka	القلتة الزرقاء، دائرة العلمة، سطيف، الجزائر	36.20575	5.6799343
693	256	1944	بني فودة	Beni Fouda	بني فودة، دائرة جميلة، سطيف، 19023، الجزائر	36.280316	5.553347
694	256	1921	جميلة	Djemila	جميلة، دائرة جميلة، سطيف، الجزائر	36.3146187	5.7371562
695	257	1913	عين لقراج	Ain-Legradj	عين لقراج، دائرة بني ورتيﻻن، سطيف، 19032، الجزائر	36.4111145	4.9033097
696	257	1909	بني شبانة	Beni Chebana	بني شبانة، دائرة بني ورتيﻻن، سطيف، الجزائر	36.4684262	4.8684047
697	257	1922	بني ورتيلان	Beni Ourtilane	بني ورتيﻻن، دائرة بني ورتيﻻن، سطيف، 19011، الجزائر	36.4422585	4.8557425
698	257	1946	بني موحلي	Beni-Mouhli	بني محلي، دائرة بني ورتيﻻن، سطيف، الجزائر	36.5132135	4.8940032
699	258	1914	عين عباسة	Ain Abessa	عين عباسة، دائرة عين ارنات، سطيف، 19110، الجزائر	36.3000482	5.2953337
700	258	1926	عين أرنات	Ain Arnat	عين أرنات، دائرة عين ارنات، سطيف، 19017، الجزائر	36.1849367	5.3144869
701	258	1937	أوريسيا	El Ouricia	أوريسيا، دائرة عين ارنات، سطيف، الجزائر	36.2837674	5.4095661
702	258	1933	مزلوق	Mezloug	مزلوق، دائرة عين ارنات، سطيف، 19130، الجزائر	36.1074201	5.3371932
703	259	1927	عموشة	Amoucha	عموشة، دائرة عموشة، سطيف، الجزائر	36.3766245	5.4181884
704	259	1957	واد البارد	Oued El Bared	واد البارد، دائرة عموشة، سطيف، الجزائر	36.4987475	5.4062315
705	259	1938	تيزي نبشار	Tizi N'bechar	تيزى نبشار، دائرة عموشة، سطيف، 19068، الجزائر	36.4314881	5.3598983
706	260	1928	عين ولمان	Ain Oulmene	عين ولمان، دائرة عين ولمان، سطيف، الجزائر	35.9231689	5.2959232
707	260	1948	قلال	Guellal	قلال، دائرة عين ولمان، سطيف، الجزائر	36.0339934	5.3387839
708	260	1952	قصر الابطال	Kasr El Abtal	قصر الأبطال، دائرة عين ولمان، سطيف، الجزائر	35.9737047	5.2890497
709	260	1904	أولاد سي أحمد	Ouled Si Ahmed	اوﻻد سي احمد، دائرة عين ولمان، سطيف، الجزائر	35.9012597	5.191133
710	261	1951	أيت نوال مزادة	Ait Naoual Mezada	آيت نوال مزادة، دائرة بوعنداس، سطيف، الجزائر	36.5458696	5.0839629
711	261	1954	ايت تيزي	Ait-Tizi	آيت تيزي، دائرة بوعنداس، سطيف، الجزائر	36.5354135	5.1566451
712	261	1930	بوعنداس	Bouandas	بوعنداس، دائرة بوعنداس، سطيف، الجزائر	36.5045875	5.1036159
713	261	1919	بوسلام	Bousselam	بوسلام، دائرة بوعنداس، سطيف، 19124، الجزائر	36.4939112	5.0067912
714	262	1932	حمام السخنة	Hamam Soukhna	حمام السخنة، دائرة حمام السخنة، سطيف، 19066، الجزائر	35.9767593	5.8083856
715	262	1958	الطاية	Taya	الطاية، دائرة حمام السخنة، سطيف، الجزائر	35.9584611	5.9675897
716	262	1960	التلة	Tella	التلة، دائرة حمام السخنة، سطيف، الجزائر	36.00827	5.7188856
717	263	1905	بوطالب	Boutaleb	بوطالب، دائرة صالح باي، سطيف، الجزائر	35.6599645	5.3215529
718	263	1911	الحامة	Hamma	الحامة، دائرة صالح باي، سطيف، 19015، الجزائر	35.6845243	5.3862787
719	263	1910	أولاد تبان	Ouled Tebben	اوﻻد تبان، دائرة صالح باي، سطيف، الجزائر	35.787703	5.0998466
720	263	1923	الرصفة	Rosfa	الرصفة، دائرة صالح باي، سطيف، الجزائر	35.8099925	5.2661899
721	263	1939	صالح باي	Salah Bey	صالح باي، دائرة صالح باي، سطيف، الجزائر	35.8520786	5.2904883
722	264	1940	عين أزال	Ain Azel	عين آزال، دائرة عين آزال، سطيف، 19007، الجزائر	35.8178542	5.5111895
723	264	1918	عين الحجر	Ain Lahdjar	عين الحجر، دائرة عين آزال، سطيف، 19220، الجزائر	35.9404062	5.5408781
724	264	1929	بيضاء برج	Beidha Bordj	بيضا برج، دائرة عين آزال، سطيف، الجزائر	35.837695	5.6318487
725	264	1934	بئر حدادة	Bir Haddada	بير حدادة، دائرة عين آزال، سطيف، الجزائر	35.9630462	5.4308609
726	265	1941	قنزات	Guenzet	قنزات، دائرة قنزات، سطيف، الجزائر	36.3372055	4.8239456
727	265	1936	حربيل	Harbil	حربيل، دائرة قنزات، سطيف، الجزائر	36.3473445	4.9251967
728	266	1906	عين الروى	Ain-Roua	عين الروى، دائرة بوقاعة، سطيف، الجزائر	36.3343734	5.1836626
729	266	1953	بني وسين	Beni Oussine	بني حسين، دائرة بوقاعة، سطيف، الجزائر	36.259056	5.1123686
730	266	1943	بوقاعة	Bougaa	بوقاعة، دائرة بوقاعة، سطيف، 19003، الجزائر	36.3322264	5.0895897
731	267	1907	ذراع قبيلة	Draa-Kebila	ذراع قبيلة، دائرة حمام قرقور، سطيف، 19029، الجزائر	36.4223095	4.9977651
732	267	1950	حمام قرقور	Hammam Guergour	حمام قرقور، دائرة حمام قرقور، سطيف، الجزائر	36.3222697	5.0548526
733	268	1955	ماوكلان	Maouaklane	موكلان، دائرة موكلان، سطيف، الجزائر	36.396686	5.0769769
734	268	1942	تالة إيفاسن	Tala-Ifacene	تالة إيفاسن، دائرة موكلان، سطيف، الجزائر	36.4543155	5.1174953
735	269	2001	سعيدة	Saida	سعيدة، دائرة سعيدة، سعيدة، الجزائر	34.8302067	0.1502692
736	270	2003	عين الحجر	Aïn El Hadjar	عين الحجر، دائرة عين الحجر، سعيدة، الجزائر	34.7574	0.1456
737	270	2005	مولاي العربي	Moulay Larbi	مولاي العربي، دائرة عين الحجر، سعيدة، الجزائر	34.5952995	-0.1984171
738	270	2012	سيدي احمد	Sidi Ahmed	سيدي أحمد، دائرة عين الحجر، سعيدة، الجزائر	34.5372597	0.2266086
739	271	2002	دوي ثابت	Doui Thabet	دوى ثابت، دائرة يوب، سعيدة، الجزائر	34.8930236	-0.0102394
740	271	2006	يوب	Youb	يوب، دائرة يوب، سعيدة، الجزائر	34.921672	-0.208054
741	272	2007	هونت	Hounet	هونت، دائرة سيدي بوبكر، سعيدة، الجزائر	35.118267	-0.1487685
742	272	2004	أولاد خالد	Ouled Khaled	أولاد خالد، دائرة سيدي بوبكر، سعيدة، 20004، الجزائر	34.9220729	0.1765338
743	272	2008	سيدي عمر	Sidi Amar	سيدي عمر، دائرة سيدي بوبكر، سعيدة، 20004، الجزائر	36.5424695	2.3059586
744	272	2009	سيدي بوبكر	Sidi Boubekeur	سيدي بوبكر، دائرة سيدي بوبكر، سعيدة، الجزائر	34.9993322	-0.0258721
745	273	2013	عين السخونة	Ain Sekhouna	العين السخونة، دائرة الحساسنة، سعيدة، الجزائر	34.5054288	0.8490051
746	273	2010	الحساسنة	El Hassasna	الحساسنة، دائرة الحساسنة، سعيدة، الجزائر	34.8228	0.3241
747	273	2011	معمورة	Maamora	معمورة، دائرة الحساسنة، سعيدة، الجزائر	34.6807	0.4999
748	274	2016	عين السلطان	Aïn Soltane	عين السلطان، دائرة أولاد براهيم، سعيدة، الجزائر	34.967	0.3021
749	274	2014	أولاد إبراهيم	Ouled Brahim	أولاد براهيم، دائرة أولاد براهيم، سعيدة، الجزائر	34.9895	0.4779
750	274	2015	تيرسين	Tircine	تيرسين، دائرة أولاد براهيم، سعيدة، الجزائر	34.9688799	0.6163804
751	275	2130	فلفلة	Filfila	فلفلة، دائرة سكيكدة، سكيكدة، 21100، الجزائر	36.8976496	7.0548176
752	275	2137	حمادي كرومة	Hammadi Krouma	حمادي كرومة، دائرة سكيكدة، سكيكدة، الجزائر	36.8441177	6.929106
753	275	2101	سكيكدة	Skikda	سكيكدة، دائرة سكيكدة، سكيكدة، الجزائر	36.8801459	6.9077344
754	276	2102	عين زويت	Ain Zouit	عين زويت، دائرة الحدائق، سكيكدة، الجزائر	36.8992518	6.7934365
755	276	2134	بوشطاطة	Bouchetata	بوشطاطة، دائرة الحدائق، سكيكدة، 21053، الجزائر	36.8168179	6.780452
756	276	2103	الحدائق	El Hadaiek	الحدائق، دائرة الحدائق، سكيكدة، الجزائر	36.8252292	6.8890251
757	277	2106	عين شرشار	Ain Charchar	عين شرشار، دائرة عزابة، سكيكدة، 21006، الجزائر	36.7331778	7.2219657
758	277	2104	عزابة	Azzaba	عزابة، دائرة عزابة، سكيكدة، الجزائر	36.7388133	7.1062378
759	277	2105	جندل سعدي محمد	Djendel Saadi Mohamed	جندل السعدي محمد، دائرة عزابة، سكيكدة، 21037، الجزائر	36.7792138	7.1724216
760	277	2133	الغدير	El Ghedir	الغدير، دائرة عزابة، سكيكدة، الجزائر	36.687176	6.9771347
761	277	2109	السبت	Es Sebt	السبت، دائرة عزابة، سكيكدة، الجزائر	36.6195945	7.0645888
762	278	2107	بكوش لخضر	Bekkouche Lakhdar	بكوش الأخضر، دائرة بن عزوز، سكيكدة، الجزائر	36.6939025	7.3105409
763	278	2108	بن عزوز	Ben Azzouz	بن عزوز، دائرة بن عزوز، سكيكدة، الجزائر	36.8600024	7.2917539
764	278	2138	المرسى	El Marsa	المرسى، دائرة بن عزوز، سكيكدة، الجزائر	37.0289	7.2537
765	279	2111	بني زيد	Beni Zid	بنى زيد، دائرة القل، سكيكدة، 21016، الجزائر	36.9124122	6.4762934
766	279	2131	الشرايع	Cheraia	الشرائع، دائرة القل، سكيكدة، الجزائر	37.0017763	6.5133033
767	279	2110	القل	Collo	القل، دائرة القل، سكيكدة، الجزائر	37.0032596	6.5520738
768	280	2136	خناق مايو	Kheneg Mayoum	خنق مايوم، دائرة أوالد عطية، سكيكدة، الجزائر	37.0090418	6.2844786
769	280	2114	وادي الزهور	Oued Zhour	وادي الزهور، دائرة أوالد عطية، سكيكدة، الجزائر	36.9097648	6.3403579
770	280	2113	أولاد عطية	Ouled Attia	أولاد عطية، دائرة أوالد عطية، سكيكدة، 21012، الجزائر	36.9949643	6.3424894
771	281	2132	قنواع	Kanoua	قنوع، دائرة الزيتونة، سكيكدة، الجزائر	37.0470382	6.4205306
772	281	2115	الزيتونة	Zitouna	الزيتونة، دائرة الزيتونة، سكيكدة، الجزائر	36.9888886	6.4592299
773	282	2116	الحروش	El Arrouch	الحروش، دائرة الحروش، سكيكدة، الجزائر	36.6514052	6.8360907
774	282	2120	مجاز الدشيش	Emdjez Edchich	أمجاز الدشيش، دائرة الحروش، سكيكدة، 21017، الجزائر	36.7051396	6.8043312
775	282	2118	أولاد حبابة	Ouled Habbaba	أولاد حبابة، دائرة الحروش، سكيكدة، الجزائر	36.4916761	6.939741
776	282	2125	صالح بو الشعور	Salah Bouchaour	صالح بو الشعور، دائرة الحروش، سكيكدة، 21022، الجزائر	36.7044252	6.8563693
777	282	2117	زردازة	Zerdezas	زردازة، دائرة الحروش، سكيكدة، الجزائر	36.5864148	6.9120702
778	283	2122	عين بوزيان	Ain Bouziane	عين بوزيان، دائرة سيدي مزغيش، سكيكدة، الجزائر	36.6043041	6.7323529
779	283	2121	بني ولبان	Beni Oulbane	بنى ولبان، دائرة سيدي مزغيش، سكيكدة، الجزائر	36.6439118	6.6281274
780	283	2119	سيدي مزغيش	Sidi Mezghiche	سيدي مزغيش، دائرة سيدي مزغيش، سكيكدة، الجزائر	36.7082508	6.7042844
781	284	2124	بني بشير	Beni Bechir	بنى بشير، دائرة رمضان جمال، سكيكدة، الجزائر	36.8003477	6.9805739
782	284	2123	رمضان جمال	Ramdane Djamel	رمضان جمال، دائرة رمضان جمال، سكيكدة، 21425، الجزائر	36.7558331	6.9259068
783	285	2129	بين الويدان	Bin El Ouiden	بين الويدان، دائرة تمالوس، سكيكدة، الجزائر	36.8081951	6.5668371
784	285	2112	الكركرة	Kerkara	الكركرة، دائرة تمالوس، سكيكدة، 21019، الجزائر	36.9304439	6.5842202
785	285	2126	تمالوس	Tamalous	تمالوس، دائرة تمالوس، سكيكدة، 21005، الجزائر	36.8361791	6.6427952
786	286	2127	عين قشرة	Ain Kechra	عين قشرة، دائرة عين قشرة، سكيكدة، الجزائر	36.801318	6.4610872
787	286	2135	الولجة بولبلوط	Ouldja Boulbalout	الولجة بو البلوط، دائرة عين قشرة، سكيكدة، الجزائر	36.7874067	6.3730027
788	287	2128	أم الطوب	Oum Toub	أم الطوب، دائرة أم الطوب، سكيكدة، الجزائر	36.7003588	6.5076167
789	288	2201	سيدي بلعباس	Sidi Bel-Abbes	سيدي بلعباس، دائرة سيدي بلعباس، سيدي بلعباس، الجزائر	35.1907399	-0.6341153
790	289	2215	عين الثريد	Ain Thrid	عين الثريد، دائرة تسالة، سيدي بلعباس، الجزائر	35.292834	-0.6747741
791	289	2239	السهالة الثورة	Sehala Thaoura	سحالة ثاورة، دائرة تسالة، سيدي بلعباس، الجزائر	35.2229388	-0.859496
792	289	2202	تسالة	Tessala	تسالة، دائرة تسالة، سيدي بلعباس، الجزائر	35.2714054	-0.7980974
793	290	2242	بلعربي	Belarbi	بلعربى، دائرة مصطفى بن إبراهيم، سيدي بلعباس، الجزائر	35.1300317	-0.4490699
794	290	2204	مصطفى بن ابراهيم	Mostefa Ben Brahim	مصطفى بن إبراهيم، دائرة مصطفى بن إبراهيم، سيدي بلعباس، الجزائر	35.1912096	-0.3582163
795	290	2213	تلموني	Tilmouni	تلمونى، دائرة مصطفى بن إبراهيم، سيدي بلعباس، الجزائر	35.1819152	-0.5129355
796	290	2233	زروالة	Zerouala	زروالة، دائرة مصطفى بن إبراهيم، سيدي بلعباس، 22068، الجزائر	35.2429855	-0.4501741
797	291	2232	الضاية	Dhaya	الضاية، دائرة تلاغ، سيدي بلعباس، الجزائر	34.6751729	-0.6207708
798	291	2206	مزاورو	Mezaourou	مزاورو، دائرة تلاغ، سيدي بلعباس، 22025، الجزائر	34.8358064	-0.6532514
799	291	2244	تغاليمت	Teghalimet	تغاليمت، دائرة تلاغ، سيدي بلعباس، الجزائر	34.8871286	-0.5499177
800	291	2205	تلاغ	Telagh	تلاغ، دائرة تلاغ، سيدي بلعباس، الجزائر	34.7797863	-0.5715147
801	292	2225	عين قادة	Ain Kada	عين قادة، دائرة سيدي علي بوسيدي، سيدي بلعباس، الجزائر	35.136963	-0.855253
802	292	2234	لمطار	Lamtar	لمطار، دائرة سيدي علي بوسيدي، سيدي بلعباس، الجزائر	35.0713025	-0.7994003
803	292	2208	سيدي علي بوسيدي	Sidi Ali Boussidi	سيدي على بوسيدى، دائرة سيدي علي بوسيدي، سيدي بلعباس، الجزائر	35.1033943	-0.828937
804	292	2236	سيدي دحو الزاير	Sidi Dahou Zairs	سيدي دحو الزاير، دائرة سيدي علي بوسيدي، سيدي بلعباس، الجزائر	35.1288651	-0.9186248
805	293	2248	بئر الحمام	Bir El Hammam	بئر الحمام، دائرة مرحوم، سيدي بلعباس، الجزائر	34.2656734	-0.3965045
806	293	2210	مرحوم	Marhoum	مرحوم، دائرة مرحوم، سيدي بلعباس، الجزائر	34.3276463	-0.1505129
807	293	2235	سيدي شعيب	Sidi Chaib	سيدي شعيب، دائرة مرحوم، سيدي بلعباس، الجزائر	34.5688408	-0.5433922
808	294	2212	العمارنة	Amarnas	العمارنة، دائرة سيدي لحسن، سيدي بلعباس، الجزائر	35.0992366	-0.6115103
809	294	2227	سيدي خالد	Sidi Khaled	سيدي خالد، دائرة سيدي لحسن، سيدي بلعباس، الجزائر	35.1109546	-0.7175131
810	294	2214	سيدي لحسن	Sidi Lahcene	سيدي لحسن، دائرة سيدي لحسن، سيدي بلعباس، الجزائر	35.1651869	-0.6944968
811	294	2240	سيدي يعقوب	Sidi Yacoub	سيدي يعقوب، دائرة سيدي لحسن، سيدي بلعباس، الجزائر	35.1550151	-0.7741312
812	295	2251	بن عشيبة شلية	Benachiba Chelia	بن شيبة شيلية، دائرة تنيرة، سيدي بلعباس، الجزائر	34.9631365	-0.5637303
813	295	2252	حاسي دحو	Hassi Dahou	حاسى دحو، دائرة تنيرة، سيدي بلعباس، الجزائر	35.1080884	-0.5466622
814	295	2243	وادي سفيون	Oued Sefioun	وادى سفيون، دائرة تنيرة، سيدي بلعباس، الجزائر	35.0667195	-0.3574097
815	295	2217	تنيرة	Tenira	تنبرة، دائرة تنيرة، سيدي بلعباس، الجزائر	35.0199515	-0.5300619
816	296	2224	عين تندمين	Ain Tindamine	عين تندامين، دائرة مولاى سليسن، سيدي بلعباس، الجزائر	34.6886678	-0.7205278
817	296	2219	الحصيبة	El Hacaiba	الحصيبة، دائرة مولاى سليسن، سيدي بلعباس، الجزائر	34.6999542	-0.7616745
818	296	2218	مولاي سليسن	Moulay Slissen	مولاى سليسن، دائرة مولاى سليسن، سيدي بلعباس، الجزائر	34.8304214	-0.8022935
819	297	2222	مرين	Merine	مرين، دائرة مرين، سيدي بلعباس، الجزائر	34.7804163	-0.4511968
820	297	2231	وادي تاوريرة	Oued Taourira	وادى تاوريرة، دائرة مرين، سيدي بلعباس، الجزائر	34.6196729	-0.3373902
821	297	2249	تاودموت	Taoudmout	تاودموت، دائرة مرين، سيدي بلعباس، الجزائر	34.6111865	-0.1178254
822	297	2211	تفسور	Tefessour	تفسور، دائرة مرين، سيدي بلعباس، الجزائر	34.698243	-0.2367994
823	298	2237	وادي السبع	Oued Sebaa	وادى السبع، دائرة رأس الماء، سيدي بلعباس، الجزائر	34.5281346	-0.7107931
824	298	2223	راس الماء	Ras El Ma	رأس الماء، دائرة رأس الماء، سيدي بلعباس، 22005، الجزائر	34.5009186	-0.7850292
825	298	2250	رجم دموش	Redjem Demouche	رجم دموش، دائرة رأس الماء، سيدي بلعباس، الجزائر	34.3385249	-0.8493808
826	299	2228	عين البرد	Ain El Berd	عين البرد، دائرة عين البرد، سيدي بلعباس، الجزائر	35.3671349	-0.5120201
827	299	2216	مكدرة	Makedra	مقدرة، دائرة عين البرد، سيدي بلعباس، الجزائر	35.4405925	-0.430481
828	299	2203	سيدي ابراهيم	Sidi Brahim	سيدي ابراهيم، دائرة عين البرد، سيدي بلعباس، الجزائر	35.260678	-0.567467
829	299	2241	سيدي حمادوش	Sidi Hamadouche	سيدي حمادوش، دائرة عين البرد، سيدي بلعباس، الجزائر	35.3106824	-0.51844
830	300	2230	عين أدن	Ain- Adden	عين عدان، دائرة سفيزف، سيدي بلعباس، الجزائر	35.3292477	-0.2598628
831	300	2238	بوجبهة البرج	Boudjebaa El Bordj	بوجبع البرج، دائرة سفيزف، سيدي بلعباس، الجزائر	35.352307	-0.32418
832	300	2226	مسيد	M'cid	مسيد، دائرة سفيزف، سيدي بلعباس، الجزائر	35.1440413	-0.2606192
833	300	2229	سفيزف	Sfisef	سفيزف، دائرة سفيزف، سيدي بلعباس، الجزائر	35.2355377	-0.2426616
834	301	2209	بدر الدين المقراني	Bedrabine El Mokrani	بدر الدين المقراني، دائرة بن باديس، سيدي بلعباس، الجزائر	34.9876	-0.8298
835	301	2245	بن باديس	Ben Badis	ابن باديس، دائرة بن باديس، سيدي بلعباس، الجزائر	34.9525879	-0.9165478
836	301	2247	شيطوان البلايلة	Chetouane Belaila	شتوان بليلة، دائرة بن باديس، سيدي بلعباس، الجزائر	34.9546858	-0.8265606
837	301	2220	حاسي زهانة	Hassi Zahana	حاسى زهانة، دائرة بن باديس، سيدي بلعباس، الجزائر	35.0256882	-0.8889946
838	302	2207	بوخنفيس	Boukhanafis	بو خنيفيس، دائرة سيدي على بن يوب، سيدي بلعباس، 22008، الجزائر	35.0654075	-0.7231252
839	302	2246	سيدي علي بن يوب	Sidi Ali Benyoub	سيدي على بن يوب، دائرة سيدي على بن يوب، سيدي بلعباس، الجزائر	34.94681	-0.7195938
840	302	2221	طابية	Tabia	طابية، دائرة سيدي على بن يوب، سيدي بلعباس، الجزائر	35.0185617	-0.7356603
841	303	2301	عنابة	Annaba	عنابة، دائرة عنابة، عنابة، 23000، الجزائر	36.8982165	7.7549272
842	303	2308	سرايدي	Seraidi	سرايدي، دائرة عنابة، عنابة، الجزائر	36.9115192	7.6752692
843	304	2302	برحال	Berrahal	برحال، دائرة برحال، عنابة، 23009، الجزائر	36.8353153	7.4597229
844	304	2306	واد العنب	Oued El Aneb	وادي العنب، دائرة برحال، عنابة، الجزائر	36.9345945	7.5212403
845	304	2312	التريعات	Treat	التريعات، دائرة برحال، عنابة، الجزائر	36.9331905	7.4031122
846	305	2303	الحجار	El Hadjar	الحجار، دائرة الحجار، عنابة، الجزائر	36.77505	7.6770911
847	305	2311	سيدي عمار	Sidi Amar	سيدي عمار، دائرة الحجار، عنابة، الحزائر	36.8159	7.7179
848	306	2305	البوني	El Bouni	البوني، دائرة البوني، عنابة، الجزائر	36.8548275	7.7413708
849	307	2309	عين الباردة	Ain El Berda	عين الباردة، دائرة عين الباردة، عنابة، الجزائر	36.672304	7.6360029
850	307	2307	الشرفة	Cheurfa	الشرفة، دائرة عين الباردة، عنابة، الجزائر	36.7215582	7.5772031
851	307	2304	العلمة	El Eulma	العلمة، دائرة عين الباردة، عنابة، الجزائر	36.7396728	7.4914453
852	308	2310	شطايبي	Chetaibi	شطايبي، دائرة شطايبي، عنابة، الجزائر	37.0119395	7.4025879
853	309	2411	بن جراح	Bendjarah	بن جراح، دائرة قالمة، قالمة، 24145، الجزائر	36.3970109	7.3585419
854	309	2401	قالمة	Guelma	قالمة، دائرة قالمة، قالمة، الجزائر	36.465084	7.430647
855	310	2432	عين رقادة	Ain Regada	عين رقادة، دائرة وادي الزناتي، قالمة، الجزائر	36.2799044	7.0765494
856	310	2421	برج صباط	Bordj Sabath	برج صباط، دائرة وادي الزناتي، قالمة، الجزائر	36.4018393	7.0456039
857	310	2404	وادي الزناتي	Oued Zenati	وادي الزناتي، دائرة وادي الزناتي، قالمة، 24300، الجزائر	36.3130761	7.164528
858	311	2423	عين العربي	Ain Larbi	عين العربي، دائرة عين مخلوف، قالمة، الجزائر	36.2850589	7.3882292
859	311	2413	عين مخلوف	Ain Makhlouf	عين مخلوف، دائرة عين مخلوف، قالمة، 24013، الجزائر	36.2427266	7.2491244
860	311	2405	تاملوكة	Tamlouka	تاملوكة، دائرة عين مخلوف، قالمة، الجزائر	36.1592954	7.1399798
861	312	2407	عين صندل	Ain Sandel	عين صندل، دائرة لخزارة، قالمة، الجزائر	36.2430823	7.5132309
862	312	2417	بوحشانة	Bou Hachana	بوحشانة، دائرة لخزارة، قالمة، الجزائر	36.2984694	7.4744504
863	312	2415	لخزارة	Khezaras	لخزارة، دائرة لخزارة، قالمة، 24016، الجزائر	36.3681295	7.5278729
864	313	2410	بلخير	Belkheir	بلخير، دائرة قلعة بوصبع، قالمة، 24100، الجزائر	36.4634182	7.4763788
865	313	2416	بني مزلين	Beni Mezline	بني مزلين، دائرة قلعة بوصبع، قالمة، الجزائر	36.4703791	7.6210166
866	313	2431	بومهرة أحمد	Boumahra Ahmed	بومهرة أحمد، دائرة قلعة بوصبع، قالمة، الجزائر	36.4604068	7.5143095
867	313	2434	جبالة الخميسي	Djeballah Khemissi	جبالة لخميسي، دائرة قلعة بوصبع، قالمة، الجزائر	36.4991084	7.5570042
868	313	2418	قلعة بوصبع	Guelaat Bou Sbaa	قلعة بوصبع، دائرة قلعة بوصبع، قالمة، الجزائر	36.5490691	7.4894268
869	313	2402	نشماية	Nechmaya	نشامية، دائرة قلعة بوصبع، قالمة، 24027، الجزائر	36.6111841	7.5132917
870	314	2412	بوحمدان	Bou Hamdane	بوحمدان، دائرة حمام دباغ، قالمة، الجزائر	36.4637898	7.112547
871	314	2419	حمام دباغ	Hammam Debagh	حمام دباغ، دائرة حمام دباغ، قالمة، الجزائر	36.4602654	7.2676947
872	314	2428	الركنية	Roknia	الركنية، دائرة حمام دباغ، قالمة، الجزائر	36.58132	7.1826574
873	315	2409	الدهوارة	Dahouara	الدهوارة، دائرة حمام النبايل، قالمة، الجزائر	36.3144516	7.7003021
874	315	2422	حمام النبايل	Hammam N'bail	حمام النبايل، دائرة حمام النبايل، قالمة، الجزائر	36.3255156	7.640326
875	315	2433	وادي الشحم	Oued Cheham	وادي الشحم، دائرة حمام النبايل، قالمة، الجزائر	36.3526366	7.7909725
876	316	2414	عين بن بيضاء	Ain Ben Beida	عين بن بيضاء، دائرة بوشقوف، قالمة، 24046، الجزائر	36.5869396	7.6456669
877	316	2425	بوشقوف	Bouchegouf	بوشقوف، دائرة بوشقوف، قالمة، 24200، الجزائر	36.4704821	7.7290561
878	316	2430	مجاز الصفاء	Medjez Sfa	مجاز الصفاء، دائرة بوشقوف، قالمة، الجزائر	36.4441932	7.824483
879	316	2406	وادي فراغة	Oued Ferragha	وادي فراغة، دائرة بوشقوف، قالمة، الجزائر	36.5384712	7.6854268
880	317	2403	بوعاتي محمود	Bouati Mahmoud	بوعاتي محمود، دائرة هيليوبوليس، قالمة، الجزائر	36.6088533	7.3480243
881	317	2420	الفجوج	El Fedjoudj	الفجوج، دائرة هيليوبوليس، قالمة، 24019، الجزائر	36.5042115	7.4013726
882	317	2426	هيليوبوليس	Heliopolis	هيليوبوليس، دائرة هيليوبوليس، قالمة، 24008، الجزائر	36.5306234	7.4348224
883	318	2424	مجاز عمار	Medjez Amar	مجاز عمار، دائرة هواري بومدين، قالمة، الجزائر	36.4816296	7.3214002
884	318	2427	هواري بومدين	Houari Boumedienne	هواري بومدين، دائرة هواري بومدين، قالمة، 24025، الجزائر	36.4145736	7.2867271
885	318	2408	رأس العقبة	Ras El Agba	رأس العقبة، دائرة هواري بومدين، قالمة، الجزائر	36.3685377	7.1986405
886	318	2429	سلاوة عنونة	Sellaoua Announa	سلاوة عنونة، دائرة هواري بومدين، قالمة، الجزائر	36.3481438	7.2852218
887	319	2501	قسنطينة	Constantine	قسنطينة، دائرة قسنطينة، قسنطينة، الجزائر	36.3641642	6.6084281
888	320	2505	ديدوش مراد	Didouche Mourad	ديدوش مراد، دائرة حامة بوزيان، قسنطينة، 25024، الجزائر	36.4413457	6.6358034
889	320	2502	حامة بوزيان	Hamma Bouziane	حامة بوزيان، دائرة حامة بوزيان، قسنطينة، الجزائر	36.4248981	6.6008903
890	321	2508	بني حميدان	Beni Hamidane	بني حميدان، دائرة زيغود يوسف، قسنطينة، الجزائر	36.5069941	6.5489049
891	321	2504	زيغود يوسف	Zighoud Youcef	زيغود يوسف، دائرة زيغود يوسف، قسنطينة، 25200، الجزائر	36.5292375	6.7336958
892	322	2510	عين السمارة	Ain Smara	عين سمارة، دائرة الخروب، قسنطينة، الجزائر	36.266467	6.4969576
893	322	2506	الخروب	El Khroub	الخروب، دائرة الخروب، قسنطينة، الجزائر	36.2603681	6.6970014
894	322	2509	أولاد رحمون	Ouled Rahmoun	أولاد رحمون، دائرة الخروب، قسنطينة، 25301، الجزائر	36.1788485	6.701422
895	323	2507	عين عبيد	Ain Abid	عين عبيد، دائرة عين عبيد، قسنطينة، 25015، الجزائر	36.2489875	6.9419888
896	323	2503	أبن باديس الهرية	Ben Badis	ابن باديس، دائرة عين عبيد، قسنطينة، الجزائر	36.3166261	6.8349785
897	324	2512	ابن زياد	Ibn Ziad	ابن زياد، دائرة ابن زياد، قسنطينة، الجزائر	36.3829267	6.4720589
898	324	2511	بوجريو مسعود	Messaoud Boudjeriou	مسعود بوجريو، دائرة ابن زياد، قسنطينة، الجزائر	36.4255439	6.472258
899	325	2654	ذراع السمار	Draa Esmar	ذراع السمار، دائرة المدية، المدية، الجزائر	36.2749286	2.7183445
900	325	2601	المدية	Medea	المدية، دائرة المدية، المدية، الجزائر	36.265344	2.766957
901	325	2615	تمسقيدة	Tamesguida	تمزقيدة، دائرة المدية، المدية، الجزائر	36.3223888	2.6895235
902	326	2630	بن شكاو	Ben Chicao	بن شكاو، دائرة وزرة، المدية، الجزائر	36.2001615	2.8526038
903	326	2616	الحمدانية	El Hamdania	الحمدانية، دائرة وزرة، المدية، 26140، الجزائر	36.3620816	2.767105
904	326	2602	وزرة	Ouzera	وزرة، دائرة وزرة، المدية، الجزائر	36.2526315	2.8466043
905	326	2613	تيزي مهدي	Tizi Mahdi	تيزي المهدي، دائرة وزرة، المدية، الجزائر	36.2029612	2.7754465
906	327	2604	عين بوسيف	Ain Boucif	عين بوسيف، دائرة عين بوسيف، المدية، 26500، الجزائر	35.8354145	3.1577821
907	327	2657	العوينات	El Ouinet	العوينات، دائرة عين بوسيف، المدية، الجزائر	35.8932925	3.035866
908	327	2617	الكاف الاخضر	Kef Lakhdar	الكاف الأخضر، دائرة عين بوسيف، المدية، الجزائر	35.9282204	3.2928163
909	327	2603	أولاد امعرف	Ouled Maaref	أولاد معرف، دائرة عين بوسيف، المدية، الجزائر	35.8156097	3.0336045
910	327	2631	سيدي دامد	Sidi Demed	سيدي دامد، دائرة عين بوسيف، المدية، الجزائر	35.8706851	3.2547826
911	328	2624	بعطة	Baata	بعطة، دائرة العمارية، المدية، الجزائر	36.3458351	3.1102247
912	328	2607	العمارية	El Omaria	العمارية، دائرة العمارية، المدية، الجزائر	36.2671619	3.0270877
913	328	2612	أولاد إبراهيم	Ouled Brahim	أولاد إبراهيم، دائرة العمارية، المدية، الجزائر	36.2437886	2.9350635
914	329	2656	بئر بن عابد	Bir Ben Laabed	بئر بن عابد، دائرة القلب الكبير، المدية، الجزائر	36.1925121	3.4197517
915	329	2609	القلب الكبير	El Guelbelkebir	القلب الكبير، دائرة القلب الكبير، المدية، الجزائر	36.2556406	3.4168521
916	329	2661	سدراية	Sedraya	سدراية، دائرة القلب الكبير، المدية، الجزائر	36.2345179	3.520256
917	330	2641	عين اقصير	Ain Ouksir	عين القصير، دائرة شلالة العذاورة، المدية، الجزائر	35.8536954	3.4698518
918	330	2618	شلالة العذاورة	Chelalet El Adhaoura	شلالة العذاورة، دائرة شلالة العذاورة، المدية، الجزائر	35.9396178	3.4140092
919	330	2640	شنيقل	Cheniguel	شنيقل، دائرة شلالة العذاورة، المدية، الجزائر	35.9234302	3.5668505
920	330	2623	تفراوت	Tafraout	تافراوت، دائرة شلالة العذاورة، المدية، الجزائر	35.9721175	3.3527874
921	331	2621	بوشراحيل	Bouchrahil	بوشراحيل، دائرة سيدي نعمان، المدية، الجزائر	36.274231	3.19346
922	331	2663	خمس جوامع	Khams Djouamaa	خمس جوامع، دائرة سيدي نعمان، المدية، الجزائر	36.1474693	3.1331309
923	331	2626	سيدي نعمان	Sidi Naamane	سيدي نعمان، دائرة سيدي نعمان، المدية، الجزائر	36.2130983	3.1229449
924	332	2632	عزيز	Aziz	عزيز، دائرة عزيز، المدية، 26040، الجزائر	35.8239347	2.4517089
925	332	2608	دراق	Derrag	دراق، دائرة عزيز، المدية، الجزائر	35.9079962	2.3881316
926	332	2642	أم الجليل	Oum El Djellil	أم الجليل، دائرة عزيز، المدية، الجزائر	35.8304545	2.6669609
927	333	2637	جواب	Djouab	جواب، دائرة السواقي، المدية، الجزائر	36.112315	3.4400244
928	333	2628	سيدي زهار	Sidi Zahar	سيدي زهار، دائرة السواقي، المدية، الجزائر	36.0663761	3.3326983
929	333	2614	سيدي زيان	Sidi Ziane	سيدي زيان، دائرة السواقي، المدية، الجزائر	36.0353418	3.2499783
930	333	2633	السواقي	Souagui	السواقي، دائرة السواقي، المدية، 26020، الجزائر	36.1255019	3.265101
931	334	2635	قصر البخاري	Ksar El Boukhari	قصر البخاري، دائرة قصر البخاري، المدية، 26300، الجزائر	35.8758381	2.7484133
932	334	2649	مفاتحة	M'fatha	مفاتحة، دائرة قصر البخاري، المدية، الجزائر	35.8833487	2.9363668
933	334	2664	السانق	Saneg	سانق، دائرة قصر البخاري، المدية، الجزائر	35.8513982	2.8390673
934	335	2636	العزيزية	El Azizia	العزيزية، دائرة العزيزية، المدية، 26018، الجزائر	36.316014	3.4915483
935	335	2639	مغراوة	Maghraoua	مغراوة، دائرة العزيزية، المدية، الجزائر	36.3829277	3.5291267
936	335	2650	ميهوب	Mihoub	ميهوب، دائرة العزيزية، المدية، الجزائر	36.3863727	3.4540976
937	336	2610	بوعيش	Bouaiche	بوعيش، دائرة الشهبونية، المدية، الجزائر	35.5538128	2.358512
938	336	2651	بوغزول	Boughzoul	بوغزول، دائرة الشهبونية، المدية، الجزائر	35.7030326	2.8431693
939	336	2638	الشهبونية	Chabounia	الشهبونية، دائرة الشهبونية، المدية، الجزائر	35.5415407	2.6037738
940	337	2660	حناشة	Hannacha	حناشة، دائرة وامري، المدية، الجزائر	36.1895198	2.5666083
941	337	2643	عوامري	Ouamri	وامري، دائرة وامري، المدية، 26043، الجزائر	36.2321878	2.5656189
942	337	2629	وادي حربيل	Oued Harbil	وادي حربيل، دائرة وامري، المدية، الجزائر	36.2267996	2.632787
943	338	2659	بوعيشون	Bouaichoune	بوعيشون، دائرة سي المحجوب، المدية، الجزائر	36.1465322	2.6613294
944	338	2627	أولاد بوعشرة	Ouled Bouachra	أولاد بوعشرة، دائرة سي المحجوب، المدية، الجزائر	36.1019093	2.7121868
945	338	2644	سي المحجوب	Si Mahdjoub	سي المحجوب، دائرة سي المحجوب، المدية، الجزائر	36.1613133	2.7215517
946	339	2646	بني سليمان	Beni Slimane	بني سليمان، دائرة بني سليمان، المدية، 26001، الجزائر	36.230723	3.3104153
947	339	2619	بوسكن	Bouskene	بوسكن، دائرة بني سليمان، المدية، الجزائر	36.1951317	3.2157348
948	339	2655	سيدي الربيع	Sidi Rabie	سيدي الربيع، دائرة بني سليمان، المدية، الجزائر	36.2753566	3.3069384
949	340	2647	البرواقية	Berrouaghia	البرواقية، دائرة البرواقية، المدية، الجزائر	36.1352805	2.9172738
950	340	2606	أولاد دايد	Ouled Deid	أولاد دايد، دائرة البرواقية، المدية، الجزائر	36.112135	3.0142787
951	340	2620	الربعية	Rebaia	الربعية، دائرة البرواقية، المدية، الجزائر	36.0278906	3.1381565
952	341	2662	مجبر	Medjebar	مجبر، دائرة سغوان، المدية، الجزائر	35.951996	2.8222098
953	341	2648	سغوان	Seghouane	سغوان، دائرة سغوان، المدية، الجزائر	36.0008943	2.905162
954	341	2645	ثلاث دوائر	Tlatet Eddouair	ثلاثة الدوائر، دائرة سغوان، المدية، الجزائر	35.9805903	2.9637406
955	341	2634	الزبيرية	Zoubiria	الزبيرية، دائرة سغوان، المدية، الجزائر	36.0697903	2.9044757
956	342	2605	العيساوية	Aissaouia	العيساوية، دائرة تابلاط، المدية، الجزائر	36.4192489	3.2148733
957	342	2653	الحوضان	El Haoudane	الحوضين، دائرة تابلاط، المدية، 26005، الجزائر	36.4694702	3.2994088
958	342	2611	مزغنة	Mezerana	مزغنة، دائرة تابلاط، المدية، الجزائر	36.3602788	3.3589456
959	342	2652	تابلاط	Tablat	تابلاط، دائرة تابلاط، المدية، 26004، الجزائر	36.4127653	3.3097893
960	343	2625	بوغار	Boghar	بوغار، دائرة أولاد عنتر، المدية، الجزائر	35.910616	2.7173772
961	343	2658	أولاد عنتر	Ouled Antar	أولاد عنتر، دائرة أولاد عنتر، المدية، الجزائر	35.9461818	2.6009942
962	343	2622	أولاد هلال	Ouled Hellal	أولاد هلال، دائرة أولاد عنتر، المدية، الجزائر	35.9668362	2.531823
963	344	2701	مستغانم	Mostaganem	مستغانم، دائرة مستغانم، مستغانم، 27000، الجزائر	35.928808	0.089978
964	345	2705	عين نويسي	Ain-Nouissy	عين نويسى، دائرة عين نويسي، مستغانم، الجزائر	35.8037574	0.0444501
965	345	2703	فرناقة	Fornaka	فرناكة، دائرة عين نويسي، مستغانم، الجزائر	35.7519675	-0.0167043
966	345	2732	الحسيان (بني ياحي	Hassiane	الحسيان، دائرة عين نويسي، مستغانم، الجزائر	35.7371347	0.0985145
967	346	2706	حاسي ماماش	Hassi Mameche	حاسي مماش، دائرة حاسي مماش، مستغانم، 27100، الجزائر	35.8607135	0.0734609
968	346	2727	مزغران	Mazagran	مزغران، دائرة حاسي مماش، مستغانم، 27120، الجزائر	35.8964789	0.0729531
969	346	2704	ستيدية	Stidia	ستيدية، دائرة حاسي مماش، مستغانم، الجزائر	35.8329584	-0.0035725
970	347	2707	عين تادلس	Ain-Tedles	عين تادلس، دائرة عين تادلس، مستغانم، 27001، الجزائر	35.9990969	0.294879
971	347	2709	وادي الخير	Oued El Kheir	وادى الخير، دائرة عين تادلس، مستغانم، 27220، الجزائر	35.9398123	0.3849409
972	347	2710	سيدي بلعطار	Sidi Belaattar	سيدي بلعطار، دائرة عين تادلس، مستغانم، 27001، الجزائر	36.0261372	0.2738849
973	347	2708	سور	Sour	سور، دائرة عين تادلس، مستغانم، الجزائر	35.9586043	0.315475
974	348	2728	عين بودينار	Ain-Boudinar	عين بودينار، دائرة خير الدين، مستغانم، الجزائر	35.9885604	0.2157357
975	348	2711	خير الدين	Kheir-Eddine	خير الدين، دائرة خير الدين، مستغانم، الجزائر	35.9811156	0.1684521
976	348	2702	صيادة	Sayada	صيادة، دائرة خير الدين، مستغانم، الجزائر	35.9334016	0.13593
977	349	2726	أولاد مع الله	Ouled-Maalah	أولاد مع الله، دائرة سيدي علي، مستغانم، الجزائر	36.0426274	0.5915932
978	349	2712	سيدي علي	Sidi Ali	سيدي على، دائرة سيدي علي، مستغانم، 27002، الجزائر	36.0997945	0.4206226
979	349	2729	تزقايت	Tazgait	تزقايت، دائرة سيدي علي، مستغانم، الجزائر	36.1273895	0.5439889
980	350	2713	بن عبد المالك رمضان	Benabdelmalek Ramdane	عبد المالك رمضان، دائرة سيدي لخضر، مستغانم، 27008، الجزائر	36.1052802	0.2734995
981	350	2714	حجاج	Hadjadj	حجاج، دائرة سيدي لخضر، مستغانم، الجزائر	36.0953239	0.3256437
982	350	2716	سيدي لخضر	Sidi-Lakhdar	سيدي لخضر، دائرة سيدي لخضر، مستغانم، 27007، الجزائر	36.1607829	0.4381432
983	351	2717	عشعاشة	Achaacha	عشعاشة، دائرة عشعاشة، مستغانم، الجزائر	36.2445994	0.6355803
984	351	2718	خضرة	Khadra	خضراء، دائرة عشعاشة، مستغانم، الجزائر	36.2541082	0.5747888
985	351	2715	نكمارية	Nekmaria	نقمارية، دائرة عشعاشة، مستغانم، الجزائر	36.1788972	0.6295316
986	351	2725	أولاد بوغالم	Ouled Boughalem	أولاد بوغالم، دائرة عشعاشة، مستغانم، 27027، الجزائر	36.2918819	0.6967613
987	352	2719	بوقيراط	Bouguirat	بوقيراط، دائرة بوقيراط، مستغانم، الجزائر	35.7502319	0.2566146
988	352	2730	صفصاف	Safsaf	صفصاف، دائرة بوقيراط، مستغانم، الجزائر	35.8657308	0.4045066
989	352	2720	سيرات	Sirat	سيرات، دائرة بوقيراط، مستغانم، الجزائر	35.731748	0.172439
990	352	2724	السوافلية	Souaflia	السوافلية، دائرة بوقيراط، مستغانم، الجزائر	35.8460196	0.3123305
991	353	2721	عين سيدي الشريف	Ain-Sidi Cherif	عين سيدي الشريف، دائرة ماسرى، مستغانم، الجزائر	35.8143961	0.139876
992	353	2723	منصورة	Mansourah	منصورة، دائرة ماسرى، مستغانم، الجزائر	35.8627101	0.2441362
993	353	2722	ماسرة	Mesra	ماسرى، دائرة ماسرى، مستغانم، 27018، الجزائر	35.8372794	0.1693314
994	353	2731	الطواهرية	Touahria	الطواهيرية، دائرة ماسرى، مستغانم، الجزائر	35.8067484	0.2257048
995	354	2801	المسيلة	M'sila	المسيلة، دائرة المسيلة، المسيلة، 28000، الجزائر	35.7087553	4.5371552
996	355	2803	حمام الضلعة	Hammam Dalaa	حمام الضلعة، دائرة حمام الضلعة، المسيلة، الجزائر	35.9281238	4.3742303
997	355	2819	ونوغة	Ouanougha	ونوغة، دائرة حمام الضلعة، المسيلة، الجزائر	35.9322252	4.1825026
998	355	2828	أولاد منصور	Ouled Mansour	أولاد منصور، دائرة حمام الضلعة، المسيلة، الجزائر	35.7314426	4.3867504
999	355	2805	تارمونت	Tarmount	تارمونت، دائرة حمام الضلعة، المسيلة، الجزائر	35.8190907	4.2859961
1000	356	2802	المعاضيد	Maadid	المعاضيد، دائرة أولاد دراج، المسيلة، الجزائر	35.7974467	4.7564949
1001	356	2806	المطارفة	M'tarfa	المطارفة، دائرة أولاد دراج، المسيلة، الجزائر	35.6888728	4.6525054
1002	356	2814	أولاد عدي لقبالة	Ouled Addi Guebala	أولاد عدى القبالة، دائرة أولاد دراج، المسيلة، 28021، الجزائر	35.675496	4.9072115
1003	356	2804	أولاد دراج	Ouled Derradj	أولاد دراج، دائرة أولاد دراج، المسيلة، 28022، الجزائر	35.6721703	4.7876916
1004	356	2840	السوامع	Souamaa	السوامع، دائرة أولاد دراج، المسيلة، الجزائر	35.5252039	4.7270053
1005	357	2826	الحوامد	El Houamed	الحوامد، دائرة خبانة، المسيلة، الجزائر	35.167244	4.5596132
1006	357	2807	خبانة	Khoubana	خبانة، دائرة خبانة، المسيلة، الجزائر	35.3244534	4.4831929
1007	357	2808	مسيف	M'cif	مسيف، دائرة خبانة، المسيلة، الجزائر	35.3263152	4.7370018
1008	358	2809	شلال	Chellal	شلال، دائرة شلال، المسيلة، الجزائر	35.5138695	4.3785487
1009	358	2832	خطوطي سد الجير	Khettouti Sed-El-Jir	خطوطي سد الجير، دائرة شلال، المسيلة، الجزائر	35.6790742	4.2599517
1010	358	2829	معاريف	Maarif	معاريف، دائرة شلال، المسيلة، الجزائر	35.3750725	4.2721827
1011	358	2810	أولاد ماضي	Ouled Madhi	أولاد ماضي، دائرة شلال، المسيلة، الجزائر	35.4901754	4.6041787
1012	359	2813	عين الخضراء	Ain Khadra	عين الخضراء، دائرة مقرة، المسيلة، 28008، الجزائر	35.5393686	4.9718744
1013	359	2815	بلعايبة	Belaiba	بلعايبة، دائرة مقرة، المسيلة، 28026، الجزائر	35.527774	5.1546938
1014	359	2812	برهوم	Berhoum	برهوم، دائرة مقرة، المسيلة، 28130، الجزائر	35.654979	5.0344441
1015	359	2830	دهاهنة	Dehahna	دھاھنة، دائرة مقرة، المسيلة، الجزائر	35.7334477	5.0300374
1016	359	2811	مقرة	Magra	مقرة، دائرة مقرة، المسيلة، الجزائر	35.6163647	5.1014147
1017	360	2845	بني يلمان	Beni Ilmane	بنى يلمان، دائرة سيدي عيسى، المسيلة، الجزائر	35.9483559	4.1197605
1018	360	2831	بوطي السايح	Bouti Sayeh	بوطى السايح، دائرة سيدي عيسى، المسيلة، الجزائر	35.6411261	3.6930562
1019	360	2816	سيدي عيسى	Sidi Aissa	سيدي عيسى، دائرة سيدي عيسى، المسيلة، 28003، الجزائر	35.8838359	3.7803723
1020	361	2817	عين الحجل	Ain El Hadjel	عين الحجل، دائرة عين الحجل، المسيلة، الجزائر	35.6179388	3.8654197
1021	361	2818	سيدي هجرس	Sidi Hadjeres	سيدي ھجرس، دائرة عين الحجل، المسيلة، الجزائر	35.7013305	4.0641659
1022	362	2820	بوسعادة	Bou Saada	بوسعادة، دائرة بوسعادة، المسيلة، الجزائر	35.2133123	4.1809702
1023	362	2827	الهامل	El Hamel	الهامل، دائرة بوسعادة، المسيلة، الجزائر	35.1308796	4.0879174
1024	362	2846	ولتام	Oulteme	ولتام، دائرة بوسعادة، المسيلة، الجزائر	35.1186463	4.3743574
1025	363	2835	بن زوه	Benzouh	بنزوه، دائرة أولاد سيدي ابراھيم، المسيلة، الجزائر	35.4567182	4.1027402
1026	363	3423	أولاد سيدي ابراهيم	Ouled Sidi Brahim	أولاد سيدي ابراھيم، دائرة أولاد سيدي ابراھيم، المسيلة، الجزائر	35.3510379	4.1387382
1027	364	2822	سيدي عامر	Sidi Ameur	سيدي عامر، دائرة سيدي عامر، المسيلة، الجزائر	35.3651917	3.8257007
1028	364	2823	تامسة	Tamsa	تامسة، دائرة سيدي عامر، المسيلة، الجزائر	35.1733735	3.9276122
1029	365	2824	بن سرور	Ben Srour	بن سرور، دائرة بن سرور، المسيلة، الجزائر	34.991345	4.5550981
1030	365	2834	محمد بوضياف	Mohamed Boudiaf	محمد بوضياف، دائرة بن سرور، المسيلة، الجزائر	34.8991073	4.4297754
1031	365	2825	أولاد سليمان	Ouled Slimane	أولاد سليمان، دائرة بن سرور، المسيلة، 28031، الجزائر	34.9270365	4.8569699
1032	365	2833	زرزور	Zarzour	الزرزور، دائرة بن سرور، المسيلة، الجزائر	35.0959978	4.8107617
1033	366	2841	عين الملح	Ain El Melh	عين الملح، دائرة عين الملح، المسيلة، الجزائر	34.8470491	4.1634964
1034	366	2837	عين فارس	Ain Fares	عين فارس، دائرة عين الملح، المسيلة، الجزائر	34.7390358	4.4770598
1035	366	2844	عين الريش	Ain Rich	عين الريش، دائرة عين الملح، المسيلة، الجزائر	34.4921828	4.047132
1036	366	2836	بئر فضة	Bir Foda	بير الفضة، دائرة عين الملح، المسيلة، الجزائر	34.815708	3.8554247
1037	366	2838	سيدي امحمد	Sidi M'hamed	سيدي محمد، دائرة عين الملح، المسيلة، 28066، الجزائر	34.7645361	4.315028
1038	367	2842	امجدل	Medjedel	مجدل، دائرة مجدل، المسيلة، 28016، الجزائر	35.1467087	3.6793899
1039	367	2839	مناعة	Menaa	أولاد عطية، دائرة مجدل، المسيلة، الجزائر	35.1438754	3.6958744
1040	368	2847	جبل مساعد	Djebel Messaad	جبل مسعد، دائرة جبل مسعد، المسيلة، الجزائر	34.9930304	4.0907504
1041	368	2843	سليم	Slim	سليم، دائرة جبل مسعد، المسيلة، الجزائر	34.8953467	3.7350935
1042	369	2901	معسكر	Mascara	معسكر، دائرة معسكر، معسكر، الجزائر	35.394081	0.1379568
1043	370	2902	بوحنيفية	Bouhanifia	بوحنيفية، دائرة بوحنيفية، معسكر، الجزائر	35.3151029	-0.0486241
1044	370	2938	القطنة	El Guettana	القيطنة، دائرة بوحنيفية، معسكر، الجزائر	35.4084418	-0.0524258
1045	370	2904	حسين	Hacine	حاسين، دائرة بوحنيفية، معسكر، الجزائر	35.4572062	-0.0024555
1046	371	2940	القرط	El Keurt	القرط، دائرة تيزي، معسكر، 29500، الجزائر	35.3809268	0.0921516
1047	371	2913	فروحة	Froha	فروحة، دائرة تيزي، معسكر، الجزائر	35.2760601	0.120643
1048	371	2903	تيزي	Tizi	تيزي، دائرة تيزي، معسكر، الجزائر	35.3161396	0.0739093
1049	372	2947	السهايلية	Sehailia	سحايلية، دائرة تيغنيف، معسكر، الجزائر	35.4445377	0.3951904
1050	372	2908	سيدي قادة	Sidi Kada	سيدي قادة، دائرة تيغنيف، معسكر، الجزائر	35.328545	0.3394322
1051	372	2906	تيغنيف	Tighennif	تغنيف، دائرة تيغنيف، معسكر، الجزائر	35.4143144	0.3292328
1052	373	2907	الحشم	El Hachem	الهاشم، دائرة الهاشم، معسكر، الجزائر	35.3696326	0.4923778
1053	373	2945	نسمط	Nesmoth	نسموط، دائرة الهاشم، معسكر، الجزائر	35.2544674	0.378734
1054	373	2909	زلامطة	Zelamta	زلامطة، دائرة الهاشم، معسكر، الجزائر	35.2910738	0.4762221
1055	374	2911	عين فراح	Ain Ferah	عين فراح، دائرة وادي الأبطال، معسكر، الجزائر	35.382409	0.7830416
1056	374	2910	وادي الأبطال	Oued El Abtal	وادي الأبطال، دائرة وادي الأبطال، معسكر، الجزائر	35.4552913	0.687517
1057	374	2946	سيدي عبد الجبار	Sidi Abdeldjebar	سيدي عبد الجبار، دائرة وادي الأبطال، معسكر، الجزائر	35.4633055	0.5186087
1058	375	2912	غريس	Ghriss	غريس، دائرة غريس، معسكر، 29006، الجزائر	35.2481745	0.1604511
1059	375	2915	ماقضة	Makhda	ماقضة، دائرة غريس، معسكر، الجزائر	35.1888989	0.2709283
1060	375	2905	ماوسة	Maoussa	ماوسة، دائرة غريس، معسكر، الجزائر	35.3782884	0.2457041
1061	375	2914	المطمور	Matemore	مطمور، دائرة غريس، معسكر، الجزائر	35.2983101	0.2051306
1062	375	2916	سيدي بوسعيد	Sidi Boussaid	سيدي بوسعيد، دائرة غريس، معسكر، الجزائر	35.2733671	0.2986103
1063	376	2917	البرج	El Bordj	البرج، دائرة البرج، معسكر، الجزائر	35.5025471	0.3340476
1064	376	2921	المنور	El Menaouer	المناور، دائرة البرج، معسكر، الجزائر	35.528555	0.4340311
1065	376	2920	خلوية	Khalouia	خلوية، دائرة البرج، معسكر، الجزائر	35.464391	0.2984598
1066	377	2918	عين فكان	Ain Fekan	عين فكان، دائرة عين فكان، معسكر، الجزائر	35.1763942	-0.024915
1067	377	2925	عين فراس	Ain Frass	عين فراس، دائرة عين فكان، معسكر، الجزائر	35.2052754	-0.1553257
1068	378	2942	قرجوم	Guerdjoum	قرجوم، دائرة وادي التاغية، معسكر، الجزائر	35.1799173	0.0712493
1069	378	2922	وادي التاغية	Oued Taria	وادي التاغية، دائرة وادي التاغية، معسكر، الجزائر	35.1178344	0.0886967
1070	379	2923	عوف	Aouf	عوف، دائرة عوف، معسكر، 29021، الجزائر	35.1251194	0.3578556
1071	379	2919	بنيان	Benian	بنيان، دائرة عوف، معسكر، الجزائر	35.0836488	0.2313191
1072	379	2941	غروس	Gharrous	غروس، دائرة عوف، معسكر، الجزائر	35.1414431	0.4672959
1073	380	2924	عين فارس	Ain Fares	عين فارس، دائرة عين فارس، معسكر، الجزائر	35.4813571	0.24453
1074	380	2939	المأمونية	El Mamounia	المامونية، دائرة عين فارس، معسكر، الجزائر	35.4247978	0.141363
1075	381	2937	بوهني	Bou Henni	بوهني، دائرة سيق، معسكر، 29022، الجزائر	35.561548	-0.0885759
1076	381	2943	الشرفاء	Chorfa	الشرفة، دائرة سيق، معسكر، الجزائر	35.4306621	-0.2462883
1077	381	2926	سيق	Sig	سيق، دائرة سيق، معسكر، 29300، الجزائر	35.5305119	-0.1906822
1078	382	2928	العلايمية	Alaimia	العلايمية، دائرة عقاز، معسكر، الجزائر	35.6739515	-0.2205391
1079	382	2927	عقاز	Oggaz	عقاز، دائرة عقاز، معسكر، الجزائر	35.5621748	-0.2588196
1080	382	2944	رأس عين عميروش	Ras El Ain Amirouche	رأس العين عميروش، دائرة عقاز، معسكر، الجزائر	35.6242444	-0.2129037
1081	383	2929	القعدة	El Gaada	القعدة، دائرة زهانة، معسكر، الجزائر	35.4266234	-0.3129183
1082	383	2930	زهانة	Zahana	زھانة، دائرة زهانة، معسكر، الجزائر	35.517616	-0.410225
1083	384	2934	الغمري	El Ghomri	الغمري، دائرة المحمدية، معسكر، الجزائر	35.6883106	0.2069806
1084	384	2933	فراقيق	Ferraguig	فرقيق، دائرة المحمدية، معسكر، الجزائر	35.53306	0.15514
1085	384	2936	مقطع الدوز	Mocta-Douz	مقطع دوز، دائرة المحمدية، معسكر، الجزائر	35.6059715	-0.0456595
1086	384	2931	المحمدية	Mohammadia	المحمدية، دائرة المحمدية، معسكر، 29002، الجزائر	35.5892003	0.0670398
1087	384	2935	سجرارة	Sedjerara	سجرارة، دائرة المحمدية، معسكر، الجزائر	35.6299882	0.2132915
1088	384	2932	سيدي عبد المومن	Sidi Abdelmoumene	سيدي عبد المومن، دائرة المحمدية، معسكر، الجزائر	35.6528372	0.0137958
1089	385	3001	ورقلة	Ouargla	ورقلة، دائرة ورقلة، ورقلة، الجزائر	31.94467	5.320958
1090	385	3005	الرويسات	Rouissat	الرويسات، دائرة ورقلة، ورقلة، 30038، الجزائر	31.9239554	5.3498372
1091	386	3003	انقوسة	N'goussa	النقوسة، دائرة النقوسة، ورقلة، 30000، الجزائر	32.3433899	5.3404048
1092	387	3004	حاسي مسعود	Hassi Messaoud	حاسي مسعود، دائرة حاسي مسعود، ورقلة، الجزائر	31.6957444	6.0604297
1093	388	3002	عين البيضاء	Ain Beida	عين البيضاء، دائرة سيدي خويلد، ورقلة، 30019، الجزائر	31.9258632	5.3972585
1094	388	3012	حاسي بن عبد الله	Hassi Ben Abdellah	حاسي بن عبد الله، دائرة سيدي خويلد، ورقلة، الجزائر	32.0253808	5.469246
1095	388	3011	سيدي خويلد	Sidi Khouiled	سيدي خويلد، دائرة سيدي خويلد، ورقلة، الجزائر	31.9786887	5.4190448
1096	389	3008	النزلة	Nezla	النزلة، دائرة حاسي مسعود، ورقلة، الجزائر	30.7491366	6.4856091
1097	389	3007	تبسبست	Tebesbest	تبسبست، دائرة تقرت، تقرت، الجزائر	33.115308	6.0818339
1098	389	3013	تقرت	Touggourt	تقرت، دائرة تقرت، تقرت، الجزائر	33.1098968	6.066102
1099	389	3009	الزاوية العابدية	Zaouia El Abidia	الزاوية العابدية، دائرة تقرت، تقرت، الجزائر	33.1328718	6.082352
1100	390	3020	العالية	El Alia	العالية، دائرة الحجيرة، ورقلة، الجزائر	32.6971008	5.4258631
1101	390	3014	الحجيرة	El-Hadjira	الحجيرة، دائرة الحجيرة، ورقلة، 30053، الجزائر	32.6130464	5.5152002
1102	391	3017	بن ناصر	Benaceur	بن ناصر، دائرة الطيبات، تقرت، الجزائر	33.1105213	6.4421107
1103	391	3018	المنقر	M'naguer	المنقر، دائرة الطيبات، تقرت، الجزائر	33.1267306	6.3527057
1104	391	3015	الطيبات	Taibet	الطيبات، دائرة الطيبات، تقرت، الجزائر	33.0979751	6.4050945
1105	392	3006	بلدة اعمر	Blidet Amor	بليدة عامر، دائرة تماسين، تقرت، الجزائر	32.9417127	5.9744271
1106	392	3016	تماسين	Temacine	تماسين، دائرة تماسين، تقرت، الجزائر	33.0104035	6.012687
1107	393	3019	المقارين	Megarine	مقارين، دائرة مقارين، تقرت، الجزائر	33.1930214	6.0932032
1108	393	5511	سيدي سليمان	Sidi Slimane	سيدي سليمان، دائرة مقارين، تقرت، الجزائر	33.2918236	5.9485865
1109	394	3021	البرمة	El Borma	البرمة، دائرة البرمة، ورقلة، الجزائر	31.5948858	9.1635246
1110	396	3101	وهران	Oran	وهران، دائرة وهران، وهران، الجزائر	35.7044415	-0.6502981
1111	397	3120	بن فريحة	Ben Freha	بن فريحة، دائرة قديل، وهران، 31063، الجزائر	35.6937209	-0.4186546
1112	397	3102	قديل	Gdyel	قديل، دائرة قديل، وهران، الجزائر	35.7824852	-0.4242038
1113	397	3121	حاسي مفسوخ	Hassi Mefsoukh	حاسي مفسوخ، دائرة قديل، وهران، الجزائر	35.8006933	-0.3765323
1114	398	3103	بئر الجير	Bir El Djir	بئر الجير، دائرة بئر الجير، وهران، الجزائر	35.719874	-0.5675118
1115	398	3119	حاسي بن عقبة	Hassi Ben Okba	حاسي بن عقبة، دائرة بئر الجير، وهران، الجزائر	35.726419	-0.4671047
1116	398	3104	حاسي بونيف	Hassi Bounif	حاسي بونيف، دائرة بئر الجير، وهران، 31028، الجزائر	35.6912811	-0.4979622
1117	399	3117	الكرمة	El Kerma	الكرمة، دائرة السانية، وهران، 31026، الجزائر	35.6186807	-0.5798446
1118	399	3105	السانية	Es Senia	السانية، دائرة السانية، وهران، الجزائر	35.6500999	-0.6241804
1119	399	3113	سيدي الشحمي	Sidi Chami	سيدي الشحمي، دائرة السانية، وهران، 31071، الجزائر	35.6579939	-0.5220152
1120	400	3106	أرزيو	Arzew	أرزيو، دائرة أرزيو، وهران، 31200، الجزائر	35.856348	-0.313678
1121	400	3122	سيدي بن يبقى	Sidi Ben Yebka	سيدي بن يبقى، دائرة أرزيو، وهران، الجزائر	35.8292874	-0.3934316
1122	401	3126	عين البية	Ain Biya	عين البية، دائرة بطيوة، وهران، الجزائر	35.8133273	-0.2871248
1123	401	3107	بطيوة	Bethioua	بطيوة، دائرة بطيوة، وهران، الجزائر	35.805837	-0.267936
1124	401	3108	مرسى الحجاج	Marsat El Hadjadj	مرسى الحجاج، دائرة بطيوة، وهران، الجزائر	35.7948853	-0.1652125
1125	402	3109	عين الترك	Ain Turk	عين الترك، دائرة عين الترك، وهران، الجزائر	35.7383522	-0.7549296
1126	402	3116	بوسفر	Bousfer	بوسفر، دائرة عين الترك، وهران، الجزائر	35.7012331	-0.8103918
1127	402	3110	العنصر	El Ancor	العنصر، دائرة عين الترك، وهران، الجزائر	35.6848518	-0.8699583
1128	402	3115	المرسى الكبير	Mers El Kebir	المرسى الكبير، دائرة عين الترك، وهران، 31014، الجزائر	35.7277218	-0.7085452
1129	403	3114	بوفاتيس	Boufatis	بوفاطيس، دائرة وادي تليلات، وهران، الجزائر	35.6791406	-0.4117684
1130	403	3118	البراية	El Braya	البرية، دائرة وادي تليلات، وهران، 31070، الجزائر	35.6291461	-0.5191909
1131	403	3111	وادي تليلات	Oued Tlelat	وادي تليلات، دائرة وادي تليلات، وهران، الجزائر	35.5519239	-0.4522604
1132	403	3112	طفراوي	Tafraoui	طفراوي، دائرة وادي تليلات، وهران، الجزائر	35.444756	-0.5542336
1133	404	3125	عين الكرمة	Ain Kerma	عين الكرمة، دائرة بوتليليس، وهران، الجزائر	35.6409571	-0.9749528
1134	404	3124	بوتليليس	Boutlelis	بوتليليس، دائرة بوتليليس، وهران، الجزائر	35.5729399	-0.8998452
1135	404	3123	مسرغين	Messerghin	مسرغين، دائرة بوتليليس، وهران، الجزائر	35.6179905	-0.7343553
1136	405	3201	البيض	El Bayadh	البيض، دائرة البيض، البيض، الجزائر	33.684319	1.0182453
1137	410	3210	بوقطب	Bougtoub	بوقطب، دائرة بوقطب، البيض، 32010، الجزائر	34.0405202	0.087067
1138	406	3202	رقاصة	Rogassa	الرقاصة، دائرة الرقاصة، البيض، الجزائر	34.0182474	0.9262211
1139	408	3222	سيدي طيفور	Sidi Tiffour	سيدي طيفور، دائرة بوعلام، البيض، الجزائر	33.6242805	1.7336176
1140	409	3209	اربوات	Arbaouat	عربوات، دائرة الأبيض سيدي الشيخ، البيض، الجزائر	33.0882649	0.5812401
1141	407	3204	بريزينة	Brezina	بريزينة، RN 107، برزينة، دائرة برزينة، البيض، الجزائر	33.0053275	1.2465973
1142	406	3217	الشقيق	Cheguig	الشقيق، دائرة الرقاصة، البيض، الجزائر	33.9829587	1.1229566
1143	412	3214	شلالة	Chellala	شلالة، دائرة شلالة، البيض، الجزائر	33.0170236	0.0896971
1144	410	3211	الخيثر	El Kheither	الخيثر، دائرة بوقطب، البيض، الجزائر	34.2165075	0.1304246
1145	412	3219	المحرة	El Mehara	المحرة، دائرة شلالة، البيض، 32002، الجزائر	33.2678794	0.2035833
1146	407	3205	الغاسول	Ghassoul	غسول، دائرة برزينة، البيض، الجزائر	33.4924106	1.2592332
1147	406	3212	الكاف الأحمر	Kef El Ahmar	كاف لحمر، دائرة الرقاصة، البيض، الجزائر	33.8504062	0.6332841
1148	408	3206	بوعلام	Boualem	بوعلام، دائرة بوعلام، البيض، الجزائر	33.7281417	1.5345064
1149	409	3216	البنود	El Bnoud	لبنود، دائرة الأبيض سيدي الشيخ، البيض، الجزائر	32.3096365	0.2450916
1150	407	3215	كراكدة	Krakda	كراكدة، دائرة برزينة، البيض، الجزائر	33.3629581	1.0442275
1151	408	3203	ستيتن	Stitten	ستيتن، دائرة بوعلام، البيض، الجزائر	33.7563995	1.2241683
1152	413	3301	إيليزي	Illizi	إليزي، دائرة إليزي، إليزي، 33000، الجزائر	26.504191	8.479926
1153	414	3305	برج الحواس	Bordj El Haouass	برج الحواس، دائرة جانت، جانت، الجزائر	24.8785596	8.4429548
1154	414	3302	جانت	Djanet	جانت، دائرة جانت، جانت، 33100، الجزائر	24.5538847	9.484194
1155	415	3304	برج عمر إدريس	Bordj Omar Driss	برج عمر إدريس، دائرة عين أمناس، إليزي، 33003، الجزائر	28.1210578	6.820793
1156	415	3303	دبداب	Debdeb	الدبداب، دائرة عين أمناس، إليزي، 33200، الجزائر	29.966978	9.424233
1157	415	3306	إن أمناس	In Amenas	عين أمناس، دائرة عين أمناس، إليزي، 22300، الجزائر	28.0386648	9.5761505
1158	417	3401	برج بوعريرج	Bordj Bou Arreridj	برج بوعريريج، الجزائر	36.0962029	4.6602742
1159	418	3430	عين تسرة	Ain Tesra	عين تسرة، دائرة رأس الوادي، برج بوعريريج، الجزائر	36.0179598	4.9695974
1160	418	3417	أولاد أبراهم	Ouled Brahem	أولاد براهم، دائرة رأس الوادي، برج بوعريريج، الجزائر	35.896618	5.0804017
1161	418	3402	رأس الوادي	Ras El Oued	رأس الوادي، دائرة رأس الوادي، برج بوعريريج، 34001، الجزائر	35.9445677	5.0319396
1162	419	3403	برج زمورة	Bordj Zemmoura	برج زمورة، دائرة برج زمورة، برج بوعريريج، الجزائر	36.2690807	4.8402663
1163	419	3418	أولاد دحمان	Ouled Dahmane	أولاد دحمان، دائرة برج زمورة، برج بوعريريج، الجزائر	36.2303398	4.7756321
1164	419	3429	تسامرت	Tassamert	تاسمرت، دائرة برج زمورة، برج بوعريريج، الجزائر	36.274077	4.7966871
1165	420	3406	بن داود	Ben Daoud	بن داود، دائرة المنصورة، برج بوعريريج، 34039، الجزائر	36.0515335	4.1723061
1166	420	3405	المهير	El M'hir	المهير، دائرة المنصورة، برج بوعريريج، 34019، الجزائر	36.093581	4.3000475
1167	420	3434	حرازة	Haraza	حرازة، دائرة المنصورة، برج بوعريريج، الجزائر	36.1554527	4.2252617
1168	420	3404	المنصورة	Mansoura	منصورة، دائرة المنصورة، برج بوعريريج، الجزائر	36.1003544	4.4715751
1169	420	3423	أولاد سيدي ابراهيم	Ouled Sidi-Brahim	أولاد سيدي إبراهيم، دائرة المنصورة، برج بوعريريج، الجزائر	36.2252854	4.334863
1170	421	3408	عين تاغروت	Ain Taghrout	عين تاغروت، دائرة عين تاغروت، برج بوعريريج، الجزائر	36.1445264	5.1132662
1171	421	3426	تيكستار	Tixter	تكستار، دائرة عين تاغروت، برج بوعريريج، الجزائر	36.0291573	5.1117578
1172	422	3412	بليمور	Belimour	بليمور، دائرة برج الغدير، برج بوعريريج، 34025، الجزائر	35.9800722	4.8818115
1173	422	3409	برج الغدير	Bordj Ghedir	برج الغدير، دائرة برج الغدير، برج بوعريريج، 34004، الجزائر	35.8991893	4.899182
1174	422	3428	العناصر	El Annasseur	العناصر، دائرة برج الغدير، برج بوعريريج، 34030، الجزائر	36.0404413	4.8186386
1175	422	3432	غيلاسة	Ghailasa	غيلاسة، دائرة برج الغدير، برج بوعريريج، الجزائر	35.847568	4.9083006
1176	422	3421	تقلعيت	Taglait	تقلعيت، دائرة برج الغدير، برج بوعريريج، الجزائر	35.7719161	5.0011451
1177	423	3427	العش	El Euch	العش، دائرة الحمادية، برج بوعريريج، الجزائر	35.8990321	4.5984311
1178	423	3411	الحمادية	Elhammadia	الحمادية، دائرة الحمادية، برج بوعريريج، 34050، الجزائر	35.9698468	4.7715689
1179	423	3422	القصور	Ksour	القصور، دائرة الحمادية، برج بوعريريج، الجزائر	35.9853663	4.565032
1180	423	3433	الرابطة	Rabta	الرابطة، دائرة الحمادية، برج بوعريريج، الجزائر	35.9101108	4.7830133
1181	424	3407	الياشير	El Achir	اليشير، دائرة مجانة، برج بوعريريج، 34195، الجزائر	36.0632388	4.6294961
1182	424	3419	حسناوة	Hasnaoua	حسناوة، دائرة مجانة، برج بوعريريج، الجزائر	36.160523	4.825215
1183	424	3413	مجانة	Medjana	مجانة، دائرة مجانة، برج بوعريريج، الجزائر	36.1311024	4.669174
1184	424	3414	ثنية النصر	Teniet En Nasr	ثنية النصر، دائرة مجانة، برج بوعريريج، الجزائر	36.2054586	4.4959144
1185	425	3425	القلة	Colla	القلة، دائرة الجعافرة، برج بوعريريج، الجزائر	36.2468046	4.6643641
1186	425	3415	جعافرة	Djaafra	جعافرة، دائرة الجعافرة، برج بوعريريج، الجزائر	36.2895829	4.6261691
1187	425	3416	الماين	El Main	الماين، دائرة الجعافرة، برج بوعريريج، 34018، الجزائر	36.382437	4.7442746
1188	425	3424	تفرق	Tefreg	تفرڨ، دائرة الجعافرة، برج بوعريريج، الجزائر	36.300658	4.7143979
1189	426	3431	بئر قاصد علي	Bir Kasdali	بئر قصد علي، دائرة بئر قصد علي، برج بوعريريج، الجزائر	36.1314462	5.007946
1190	426	3420	خليل	Khelil	خلـيل، دائرة بئر قصد علي، برج بوعريريج، الجزائر	36.236203	5.0157162
1191	426	3410	سيدي أمبارك	Sidi-Embarek	سيدي امبارك، دائرة بئر قصد علي، برج بوعريريج، الجزائر	36.1181276	4.9041488
1192	427	3501	بومرداس	Boumerdes	بومرداس، دائرة بومرداس، بومرداس، الجزائر	36.7590403	3.473102
1193	427	3516	قورصو	Corso	قورصو، دائرة بومرداس، بومرداس، 35014، الجزائر	36.7547423	3.4433833
1194	427	3512	تيجلابين	Tidjelabine	تيجلابين، دائرة بومرداس، بومرداس، 35021، الجزائر	36.7321389	3.4956358
1195	428	3502	بودواو	Boudouaou	بودواو، دائرة بودواو، بومرداس، 35400، الجزائر	36.727203	3.408382
1196	428	3527	بودواو البحري	Boudouaou El Bahri	بودواو البحري، دائرة بودواو، بومرداس، الجزائر	36.7721989	3.4044018
1197	428	3519	بوزقزة قدارة	Bouzegza Keddara	بوزقزة قدارة، دائرة بودواو، بومرداس، الجزائر	36.6250914	3.4807733
1198	428	3532	الخروبة	El Kharrouba	الخروبة، دائرة بودواو، بومرداس، الجزائر	36.6564534	3.4068647
1199	428	3528	أولاد هداج	Ouled Hedadj	أولاد هداج، دائرة بودواو، بومرداس، 35043، الجزائر	36.7100229	3.335038
1200	429	3504	برج منايل	Bordj Menaiel	برج منايل، دائرة برج منايل، بومرداس، 35001، الجزائر	36.7432364	3.7175665
1201	429	3508	جنات	Djinet	جنات، دائرة برج منايل، بومرداس، 35210، الجزائر	36.8779905	3.720138
1202	429	3529	لقاطة	Leghata	لقاطة، دائرة برج منايل، بومرداس، الجزائر	36.7892398	3.683419
1203	429	3510	زموري	Zemmouri	زموري، دائرة برج منايل، بومرداس، الجزائر	36.7864064	3.6012209
1204	430	3505	بغلية	Baghlia	بغلية، دائرة بغلية، بومرداس، 35055، الجزائر	36.7959552	3.8675211
1205	430	3506	سيدي داود	Sidi Daoud	سيدي داود، دائرة بغلية، بومرداس، 35404، الجزائر	36.8567267	3.8581586
1206	430	3520	تاورقة	Taourga	تورقة، دائرة بغلية، بومرداس، الجزائر	36.7935601	3.9500124
1207	431	3507	الناصرية	Naciria	الناصرية، دائرة الناصرية، بومرداس، الجزائر	36.7471933	3.836858
1208	431	3521	أولاد عيسى	Ouled Aissa	اولاد عيسى، دائرة الناصرية، بومرداس، الجزائر	36.80526	3.8139896
1209	432	3513	شعبة العامر	Chabet El Ameur	شعبة العامر، دائرة يسر، بومرداس، 35008، الجزائر	36.6344133	3.6790599
1210	432	3509	يسر	Isser	يسر، دائرة يسر، بومرداس، الجزائر	36.6935557	3.6915459
1211	432	3511	سي مصطفى	Si Mustapha	سي مصطفى، دائرة يسر، بومرداس، الجزائر	36.7336375	3.6253479
1212	432	3515	تيمزريت	Timezrit	تيمزريت، دائرة يسر، بومرداس، الجزائر	36.6724554	3.8067799
1213	433	3524	عمال	Ammal	عمال، دائرة الثنية، بومرداس، الجزائر	36.6333486	3.5913032
1214	433	3525	بني عمران	Beni Amrane	بني عمران، دائرة الثنية، بومرداس، 35006، الجزائر	36.6678481	3.5918611
1215	433	3526	سوق الحد	Souk El Had	سوق الحد، دائرة الثنية، بومرداس، الجزائر	36.6900929	3.5915362
1216	433	3514	الثنية	Thenia	الثنية، دائرة الثنية، بومرداس، الجزائر	36.724986	3.556935
1217	434	3503	أعفير	Afir	عفير، دائرة دلس، بومرداس، الجزائر	36.8423443	3.9871505
1218	434	3522	بن شود	Ben Choud	بن شود، دائرة دلس، بومرداس، 35033، الجزائر	36.8641433	3.8801313
1219	434	3523	دلس	Dellys	دلس، دائرة دلس، بومرداس، الجزائر	36.915798	3.913104
1220	435	3530	حمادي	Hammedi	حمادي، دائرة خميس الخشنة، بومرداس، الجزائر	36.6800253	3.2596049
1221	435	3531	خميس الخشنة	Khemis El Khechna	خميس الخشنة، دائرة خميس الخشنة، بومرداس، 35010، الجزائر	36.6505384	3.3317211
1222	435	3518	الاربعطاش	Larbatache	لربعطاش، دائرة خميس الخشنة، بومرداس، 35017، الجزائر	36.6379144	3.3710566
1223	435	3517	أولاد موسى	Ouled Moussa	أولاد موسى، دائرة خميس الخشنة، بومرداس، 35012، الجزائر	36.6857409	3.3642924
1224	436	3606	عين العسل	Ain El Assel	عين العسل، دائرة الطارف، الطارف، الجزائر	36.7865309	8.3825736
1225	436	3604	بوقوس	Bougous	بوقوس، دائرة الطارف، الطارف، الجزائر	36.6582252	8.3707314
1226	436	3601	الطارف	El Tarf	الطارف، دائرة الطارف، الطارف، 36000، الجزائر	36.7667186	8.3169418
1227	436	3620	الزيتونة	Zitouna	الزيتونة، دائرة الطارف، الطارف، الجزائر	36.6577517	8.2343814
1228	437	3621	عين الكرمة	Ain Kerma	عين الكرمة، دائرة بوحجار، الطارف، الجزائر	36.563333	8.1984116
1229	437	3602	بوحجار	Bouhadjar	بوحجار، دائرة بوحجار، الطارف، الجزائر	36.5034174	8.1060862
1230	437	3623	حمام بني صالح	Hammam Beni Salah	حمام بني صالح، دائرة بوحجار، الطارف، الجزائر	36.5193221	8.035929
1231	437	3622	وادي الزيتون	Oued Zitoun	واد الزيتون، دائرة بوحجار، الطارف، الجزائر	36.4666104	8.0576006
1232	438	3603	بن مهيدي	Ben M Hidi	بن مهيدي، دائرة بن مهيدي، الطارف، الجزائر	36.7704579	7.9053142
1233	438	3610	بريحان	Berrihane	بريحان، دائرة بن مهيدي، الطارف، 36027، الجزائر	36.8376854	8.1257847
1234	438	3618	الشط	Echatt	الشط، دائرة بن مهيدي، الطارف، 36003، الجزائر	36.8303087	7.8727514
1235	439	3607	العيون	El Aioun	العيون، دائرة القالة، الطارف، الجزائر	36.826658	8.6013044
1236	439	3605	القالة	El Kala	القالة، دائرة القالة، الطارف، الجزائر	36.8953504	8.4420993
1237	439	3624	رمل السوق	Raml Souk	رمل السوق، دائرة القالة، الطارف، الجزائر	36.7878718	8.5351897
1238	439	3609	السوارخ	Souarekh	السوارخ، دائرة القالة، الطارف، 36020، الجزائر	36.8823518	8.5660285
1239	440	3608	بوثلجة	Bouteldja	بوثلجة، دائرة بوثلجة، الطارف، الجزائر	36.7855823	8.1990268
1240	440	3612	الشافية	Chefia	الشافية، دائرة بوثلجة، الطارف، الجزائر	36.6597886	8.1068702
1241	440	3611	بحيرة الطيور	Lac Des Oiseaux	بحيرة الطيور، دائرة بوثلجة، الطارف، الجزائر	36.7759247	8.1185433
1242	441	3615	شبيطة مختار	Chebaita Mokhtar	شبيطة مختار، دائرة الذرعان، الطارف، الجزائر	36.755843	7.7407291
1243	441	3614	شحاني	Chihani	الشيحاني، دائرة الذرعان، الطارف، الجزائر	36.6473548	7.7780261
1244	441	3613	الذرعان	Drean	الذرعان، الذرعان، الطارف، 36200، الجزائر	36.6851201	7.7470888
1245	442	3617	عصفور	Asfour	عصفور، دائرة البسباس، الطارف، الجزائر	36.6450055	7.9718849
1246	442	3616	البسباس	Besbes	البسباس، دائرة البسباس، الطارف، الجزائر	36.6972275	7.8449992
1247	442	3619	زريزر	Zerizer	زريزر، دائرة البسباس، الطارف، الجزائر	36.7222365	7.9065934
1248	443	3702	أم العسل	Oum El Assel	أم العسل، دائرة تندوف، تندوف، الجزائر	28.6144725	-6.9804945
1249	443	3701	تندوف	Tindouf	تندوف، دائرة تندوف، تندوف، الجزائر	27.6718402	-8.1397297
1250	444	3812	أولاد بسام	Ouled Bessam	أولاد بسام، دائرة تسمسيلت، تسمسيلت، الجزائر	35.6987743	1.8240855
1251	444	3801	تيسمسيلت	Tissemsilt	تسمسيلت، دائرة تسمسيلت، تسمسيلت، 38000، الجزائر	35.604813	1.810476
1252	445	3805	بني شعيب	Beni Chaib	بنى شعيب، دائرة برج بونعامة، تسمسيلت، الجزائر	35.8244324	1.796315
1253	445	3822	بني لحسن	Beni Lahcene	بنى لحسن، دائرة برج بونعامة، تسمسيلت، الجزائر	35.7913877	1.7162134
1254	445	3802	برج بونعامة	Bordj Bounaama	برج بونعامة، دائرة برج بونعامة، تسمسيلت، 38001، الجزائر	35.8505025	1.6170851
1255	445	3820	سيدي سليمان	Sidi Slimane	سيدي سليمان، دائرة برج بونعامة، تسمسيلت، الجزائر	35.8504992	1.7262967
1256	446	3815	سيدي بوتوشنت	Sidi Boutouchent	سيدي بوتوشنت، دائرة ثنية الأحد، تسمسيلت، الجزائر	35.8232714	1.9223329
1257	446	3803	ثنية الاحد	Theniet El Had	ثنية الأحد، دائرة ثنية الأحد، تسمسيلت، 38200، الجزائر	35.8739691	2.0240828
1258	447	3821	بوقائد	Boucaid	بوقائد، دائرة الأزهرية، تسمسيلت، 38005، الجزائر	35.8902865	1.6184584
1259	447	3816	الأربعاء	Larbaa	الاربعاء، دائرة الأزهرية، تسمسيلت، الجزائر	35.9086939	1.4639964
1260	447	3804	الأزهرية	Lazharia	الأزهرية، دائرة الأزهرية، تسمسيلت، الجزائر	35.957524	1.567879
1261	448	3806	لرجام	Lardjem	لرجام، دائرة لرجام، تسمسيلت، الجزائر	35.7480295	1.5480772
1262	448	3807	الملعب	Melaab	ملعب، دائرة لرجام، تسمسيلت، الجزائر	35.7176605	1.3230934
1263	448	3808	سيدي العنتري	Sidi Lantri	سيدي العنترى، دائرة لرجام، تسمسيلت، الجزائر	35.6936399	1.5032488
1264	448	3819	تملاحت	Tamellahet	تملاحت، دائرة تماسين، تقرت، الجزائر	33.0090644	6.0098295
1265	449	3809	برج الأمير عبد القادر	Bordj El Emir Abdelkader	برج الأمير عبد القادر، دائرة برج الأمير عبد القادر، تسمسيلت، الجزائر	35.8222005	2.23692
1266	449	3814	اليوسفية	Youssoufia	يوسوفية، دائرة برج الأمير عبد القادر، تسمسيلت، الجزائر	35.8960794	2.126545
1267	450	3811	خميستي	Khemisti	خميستى، دائرة خميستى، تسمسيلت، 38100، الجزائر	35.680409	1.9488389
1268	450	3810	العيون	Layoune	العيون، دائرة خميستى، تسمسيلت، الجزائر	35.6683622	2.0645059
1269	451	3813	عماري	Ammari	عماري، دائرة عماري، تسمسيلت، الجزائر	35.6145964	1.6524176
1270	451	3817	المعاصم	Maacem	المعاصم، دائرة عماري، تسمسيلت، الجزائر	35.6415775	1.5435717
1271	451	3818	سيدي عابد	Sidi Abed	سيدي عابد، دائرة عماري، تسمسيلت، الجزائر	35.7103134	1.6770723
1272	452	3901	الوادي	El-Oued	الوادي، دائرة الوادي، الوادي، الجزائر	33.3611766	6.8603492
1273	452	3907	كوينين	Kouinine	كوينين، دائرة الوادي، الوادي، الجزائر	33.4037855	6.8264542
1274	453	3925	العقلة	El Ogla	العقلة، دائرة الرباح، الوادي، الجزائر	33.2465995	6.9460807
1275	453	3905	النخلة	Nakhla	النخلة، دائرة الرباح، الوادي، الجزائر	33.2763121	6.9515739
1276	453	3902	الرباح	Robbah	الرباح، دائرة الرباح، الوادي، 39017، الجزائر	33.282566	6.9039771
1277	454	3904	البياضة	Bayadha	البياضة، دائرة البياضة، الوادي، 39150، الجزائر	33.3278311	6.8885733
1278	455	3906	قمار	Guemar	قمار، دائرة قمار، الوادي، الجزائر	33.4916197	6.7977914
1279	455	3920	ورماس	Ourmes	ورماس، دائرة قمار، الوادي، الجزائر	33.353029	6.539482
1280	455	3910	تغزوت	Taghzout	تغزوت، دائرة قمار، الوادي، 39040، الجزائر	33.470794	6.7964805
1281	456	3909	الحمراية	Hamraia	الحمراية، دائرة الرقيبة، الوادي، الجزائر	34.1103311	6.2299381
1282	456	3908	الرقيبة	Reguiba	الرقيبة، دائرة الرقيبة، الوادي، الجزائر	33.5653009	6.7114196
1283	457	3911	الدبيلة	Debila	الدبيلة، دائرة الدبيلة، الوادي، الجزائر	33.5059503	6.9376019
1284	457	3912	حساني عبد الكريم	Hassani Abdelkrim	حساني عبد الكريم، دائرة الدبيلة، الوادي، الجزائر	33.4771663	6.8948804
1285	458	3913	حاسي خليفة	Hassi Khalifa	حاسي خليفة، دائرة حاسي خليفة، الوادي، الجزائر	33.5630338	6.9953023
1286	458	3917	الطريفاوي	Trifaoui	الطريفاوي، دائرة حاسي خليفة، الوادي، 39044، الجزائر	33.4474446	7.0621988
1287	459	3919	بن قشة	Ben Guecha	بن قشة، دائرة الطالب العربي، الوادي، الجزائر	34.1119474	7.2871813
1288	459	3915	دوار الماء	Douar El Maa	دوار الماء، دائرة الطالب العربي، الوادي، 39024، الجزائر	33.3738476	7.6857696
1289	459	3914	الطالب العربي	Taleb Larbi	طالب العربي، دائرة الطالب العربي، الوادي، 39019، الجزائر	33.728911	7.5176604
1290	460	3918	المقرن	Magrane	المقرن، دائرة المقرن، الوادي، الجزائر	33.5625599	6.930939
1291	460	3916	سيدي عون	Sidi Aoun	سيدي عون، دائرة المقرن، الوادي، الجزائر	33.8391534	6.8108559
1292	461	3926	اميه وانسة	Mih Ouansa	اميه ونسة، دائرة اميه ونسة، الوادي، الجزائر	33.1995461	6.7096899
1293	461	3903	وادي العلندة	Oued El Alenda	وادي العلندة، دائرة اميه ونسة، الوادي، الجزائر	33.2308061	6.7613731
1294	462	3927	المغير	El-M'ghaier	المغير، دائرة المغير، المغير، الجزائر	33.9496809	5.921089
1295	462	3929	أم الطيور	Oum Touyour	أم الطيور، دائرة المغير، المغير، الجزائر	34.1523583	5.8337623
1296	462	3923	سيدي خليل	Sidi Khelil	سيدي خليل، دائرة المغير، المغير، الجزائر	33.8381103	5.9603994
1297	462	3921	سطيل	Still	اسطيل، دائرة المغير، المغير، الجزائر	34.2591866	5.9149716
1298	463	3928	جامعة	Djamaa	جامعة، دائرة جامعة، المغير، الجزائر	33.5304325	5.9892386
1299	463	3922	المرارة	M'rara	مرارة، دائرة جامعة، المغير، الجزائر	33.4762319	5.6606773
1300	463	3930	سيدي عمران	Sidi Amrane	سيدي عمران، دائرة جامعة، المغير، الجزائر	33.4972965	6.0111235
1301	463	3924	تندلة	Tenedla	تندلة، دائرة جامعة، المغير، الجزائر	33.6734168	6.0331753
1302	465	4001	خنشلة	Khenchela	خنشلة، دائرة خنشلة، خنشلة، الجزائر	35.430154	7.145711
1303	466	4003	قايس	Kais	قايس، دائرة قايس، خنشلة، الجزائر	35.4956337	6.9235555
1304	466	4010	الرميلة	Remila	الرميلة، دائرة قايس، خنشلة، الجزائر	35.5871075	6.9034374
1305	466	4007	تاوزيانت	Taouzianat	تاوزيانت، دائرة قايس، خنشلة، الجزائر	35.5107604	6.8087111
1306	467	4004	بغاي	Baghai	بغاي، دائرة الحامة، خنشلة، الجزائر	35.5232847	7.1140725
1307	467	4005	الحامة	El Hamma	الحامة، دائرة الحامة، خنشلة، الجزائر	35.4716036	7.0856456
1308	467	4015	انسيغة	Ensigha	انسيغة، دائرة الحامة، خنشلة، الجزائر	35.3960059	7.1427291
1309	467	4014	طامزة	Tamza	طامزة، دائرة الحامة، خنشلة، الجزائر	35.2514688	6.9973328
1310	468	4006	عين الطويلة	Ain Touila	عين الطويلة، دائرة عين الطويلة، خنشلة، الجزائر	35.4793116	7.3748585
1311	468	4002	متوسة	M'toussa	متوسة، دائرة عين الطويلة، خنشلة، الجزائر	35.5660771	7.25696
1312	469	4008	بوحمامة	Bouhmama	بوحمامة، دائرة بوحمامة، خنشلة، 40007، الجزائر	35.3188013	6.7466351
1313	469	4021	شلية	Chelia	شلية، دائرة بوحمامة، خنشلة، الجزائر	35.3642294	6.7793901
1314	469	4018	مصارة	M'sara	أمصارة، دائرة بوحمامة، خنشلة، الجزائر	35.2394325	6.5726279
1315	469	4019	يابوس	Yabous	يابوس، دائرة بوحمامة، خنشلة، الجزائر	35.407649	6.6416748
1316	470	4011	ششار	Chechar	ششار، دائرة ششار، خنشلة، الجزائر	35.0383313	7.0042609
1317	470	4012	جلال	Djellal	جلال، دائرة ششار، خنشلة، الجزائر	34.8766294	6.854011
1318	470	4009	الولجة	El Oueldja	الولجة، دائرة ششار، خنشلة، الجزائر	34.9192926	6.6819692
1319	470	4020	خيران	Khirane	خيران، دائرة ششار، خنشلة، الجزائر	34.9979402	6.7614136
1320	471	4013	بابار	Babar	بابار، دائرة بابار، خنشلة، 40006، الجزائر	35.1688559	7.1054786
1321	472	4017	المحمل	El Mahmal	المحمل، دائرة اولاد رشاش، خنشلة، 40012، الجزائر	35.3751785	7.2115567
1322	472	4016	أولاد رشاش	Ouled Rechache	أولاد رشاش، دائرة اولاد رشاش، خنشلة، الجزائر	35.2972988	7.3548369
1323	473	4101	سوق أهراس	Souk Ahras	سوق أهراس، دائرة سوق أهراس، سوق أهراس، 41000، الجزائر	36.282865	7.9537896
1324	474	4118	عين سلطان	Ain Soltane	عين السلطان، دائرة سدراتة، سوق أهراس، الجزائر	36.1796759	7.3594933
1325	474	4123	خميسة	Khemissa	خميسة، دائرة سدراتة، سوق أهراس، الجزائر	36.1948087	7.6514541
1326	474	4102	سدراتة	Sedrata	سدراتة، دائرة سدراتة، سوق أهراس، 41200، الجزائر	36.1356466	7.53412
1327	475	4103	الحنانشة	Hanencha	الحنانشة، دائرة المشروحة، سوق أهراس، الجزائر	36.2603074	7.7930747
1328	475	4104	المشروحة	Machroha	المشروخة، دائرة المشروحة، سوق أهراس، الجزائر	36.3565124	7.8387478
1329	476	4117	عين الزانة	Ain Zana	عين الزانة، دائرة اولاد إدريس، سوق أهراس، الجزائر	36.4018987	8.2093288
1330	476	4105	أولاد إدريس	Ouled Driss	أولاد ادريس، دائرة اولاد إدريس، سوق أهراس، الجزائر	36.3574912	8.0255425
1331	477	4109	الدريعة	Drea	الدريعة، دائرة تاورة، سوق أهراس، الجزائر	36.1222482	7.8838947
1332	477	4108	تاورة	Taoura	تاورة، دائرة تاورة، سوق أهراس، الجزائر	36.167061	8.042039
1333	477	4107	الزعرورية	Zaarouria	الزعرورية، دائرة تاورة، سوق أهراس، الجزائر	36.2256214	7.9582241
1334	478	4110	الحدادة	Haddada	الحدادة، دائرة الحدادة، سوق أهراس، الجزائر	36.2306963	8.3377472
1335	478	4111	الخضارة	Khedara	لخضارة، دائرة الحدادة، سوق أهراس، الجزائر	36.2941847	8.2581363
1336	478	4113	أولاد مومن	Ouled Moumen	أولاد مؤمن، دائرة الحدادة، سوق أهراس، الجزائر	36.3402803	8.3163387
1337	479	4112	المراهنة	Merahna	المراهنة، دائرة المراهنة، سوق أهراس، 41005، الجزائر	36.1978548	8.1556144
1338	479	4119	ويلان	Ouillen	ويلان، دائرة المراهنة، سوق أهراس، الجزائر	36.2277726	8.065158
1339	479	4120	سيدي فرج	Sidi Fredj	سيدي فرج، دائرة المراهنة، سوق أهراس، الجزائر	36.1530958	8.1952696
1340	480	4114	بئر بوحوش	Bir Bouhouche	بئر بوحوش، دائرة بئر بوحوش، سوق أهراس، الجزائر	36.0142141	7.4290603
1341	480	4121	سافل الويدان	Safel El Ouiden	سافل الويدان، دائرة بئر بوحوش، سوق أهراس، الجزائر	35.9296248	7.4940406
1342	480	4126	الزوابي	Zouabi	الزوابى، دائرة بئر بوحوش، سوق أهراس، الجزائر	36.1205251	7.3986683
1343	481	4115	مداوروش	M'daourouche	مداوروش، دائرة مداوروش، سوق أهراس، 41001، الجزائر	36.0773091	7.8212383
1344	481	4122	الراقوبة	Ragouba	الرقوبة، دائرة مداوروش، سوق أهراس، 41002، الجزائر	36.1282719	7.6714933
1345	481	4106	تيفاش	Tiffech	تيفاش، دائرة مداوروش، سوق أهراس، الجزائر	36.1906399	7.7858197
1346	482	4124	وادي الكبريت	Oued Kebrit	وادى الكبريت، دائرة أم الغظائم، سوق أهراس، الجزائر	35.9229948	7.917529
1347	482	4116	أم العظايم	Oum El Adhaim	أم الغظائم، دائرة أم الغظائم، سوق أهراس، 41019، الجزائر	36.0283173	7.6041509
1348	482	4125	ترقالت	Terraguelt	ترقالت، دائرة أم الغظائم، سوق أهراس، الجزائر	35.8842976	7.5980674
1349	483	4201	تيبازة	Tipaza	تيبازة، دائرة تيبازة، تيبازة، 42000، الجزائر	36.5918129	2.4482168
1350	484	4208	حجوط	Hadjout	حجوط، دائرة حجوط، تيبازة، الجزائر	36.5121198	2.4142888
1351	484	4216	مراد	Merad	مراد، دائرة حجوط، تيبازة، الجزائر	36.4763774	2.4272954
1352	485	4202	مناصر	Menaceur	مناصر، دائرة سيدي عمار، تيبازة، الجزائر	36.5000414	2.2236309
1353	485	4211	الناظور	Nador	الناظور، دائرة سيدي عمار، تيبازة، الجزائر	36.5693907	2.3935492
1354	485	4209	سيدي عامر	Sidi-Amar	سيدي عمار، دائرة سيدي عمار، تيبازة، الجزائر	36.5424695	2.3059586
1355	486	4207	أغبال	Aghbal	أغبال، دائرة قوراية، تيبازة، الجزائر	36.5028413	1.8458849
1356	486	4210	قوراية	Gouraya	قوراية، دائرة قوراية، تيبازة، 42007، الجزائر	36.5720127	1.9057978
1357	486	4222	مسلمون	Messelmoun	مسلمون، دائرة قوراية، تيبازة، الجزائر	36.5626559	2.0022623
1358	487	4214	شرشال	Cherchell	شرشال، دائرة شرشال، تيبازة، الجزائر	36.6075021	2.1901982
1359	487	4228	حجرة النص	Hadjret Ennous	حجرة النص، دائرة شرشال، تيبازة، 42029، الجزائر	36.5730902	2.0534126
1360	487	4221	سيدي غيلاس	Sidi Ghiles	سيدي غيلاس، دائرة شرشال، تيبازة، الجزائر	36.5833323	2.1225093
1361	487	4226	سيدي سميان	Sidi Semiane	سيدي سميان، دائرة شرشال، تيبازة، الجزائر	36.4998942	2.066288
1362	488	4227	بني ميلك	Beni Mileuk	بني ميلك، دائرة الداموس، تيبازة، الجزائر	36.4444593	1.7172136
1363	488	4215	الداموس	Damous	الداموس، دائرة الداموس، تيبازة، 42014، الجزائر	36.5487437	1.7055525
1364	488	4203	الأرهاط	Larhat	الأرهاط، دائرة الداموس، تيبازة، الجزائر	36.556746	1.8030812
1365	489	4204	دواودة	Douaouda	دواودة، دائرة فوكة، تيبازة، الجزائر	36.6737396	2.7900902
1366	489	4217	فوكة	Fouka	فوكة، دائرة فوكة، تيبازة، الجزائر	36.6615612	2.7421167
1367	490	4213	عين تاقورايت	Ain Tagourait	عين تقورايت، دائرة بو إسماعيل، تيبازة، 42023، الجزائر	36.6027844	2.6090961
1368	490	4220	بوهارون	Bou Haroun	بوهارون، دائرة بو إسماعيل، تيبازة، 42009، الجزائر	36.6248757	2.657232
1369	490	4218	بواسماعيل	Bou Ismail	بو إسماعيل، دائرة بو إسماعيل، تيبازة، الجزائر	36.642758	2.6899362
1370	490	4206	خميستي	Khemisti	خميستي، دائرة بو إسماعيل، تيبازة، 42016، الجزائر	36.625387	2.6797524
1371	491	4219	أحمر العين	Ahmer El Ain	أحمر العين، دائرة حمر العين، تيبازة، 42005، الجزائر	36.4773708	2.5646996
1372	491	4205	بورقيقة	Bourkika	بورقيقة، دائرة حمر العين، تيبازة، الجزائر	36.4942993	2.4775236
1373	491	4223	سيدي راشد	Sidi Rached	سيدي راشد، دائرة حمر العين، تيبازة، 42250، الجزائر	36.5625526	2.5324546
1374	492	4225	الحطاطبة	Attatba	حطاطبة، دائرة القليعة، تيبازة، الجزائر	36.5730416	2.6766452
1375	492	4212	الشعيبة	Chaiba	الشعيبة، دائرة القليعة، تيبازة، 42410، الجزائر	36.6095154	2.7330752
1376	492	4224	القليعة	Kolea	القليعة، دائرة القليعة، تيبازة، الجزائر	36.6373657	2.769126
1377	493	4325	عين التين	Ain Tine	عين التين، دائرة ميلة، ميلة، 43016، الجزائر	36.4155335	6.3282212
1378	493	4301	ميلة	Mila	ميلة، دائرة ميلة، ميلة، الجزائر	36.451941	6.262331
1379	493	4327	سيدي خليفة	Sidi Khelifa	سيدي خليفة، دائرة ميلة، ميلة، الجزائر	36.3635685	6.261707
1380	494	4302	فرجيوة	Ferdjioua	فرجيوة، دائرة فرجيوة، ميلة، الجزائر	36.4073812	5.9419603
1381	494	4331	يحي بني قشة	Yahia Beniguecha	يحيى بنى قشة، دائرة فرجيوة، ميلة، الجزائر	36.3907169	5.9940093
1382	495	4305	عين الملوك	Ain Mellouk	عين الملوك، دائرة شلغوم العيد، ميلة، 43015، الجزائر	36.273988	6.1447568
1383	495	4303	شلغوم العيد	Chelghoum Laid	شلغوم العيد، دائرة شلغوم العيد، ميلة، الجزائر	36.1605629	6.1673286
1384	495	4304	وادي العثمانية	Oued Athmenia	وادي العثمانية، دائرة شلغوم العيد، ميلة، الجزائر	36.266171	6.3117791
1385	496	4326	مشيرة	El Mechira	المشيرة، تلاغمة، ميلة، الجزائر	36.0144775	6.2388792
1386	496	4307	وادي سقان	Oued Seguen	وادي سقان، تلاغمة، ميلة، 43031، الجزائر	36.1811194	6.3883093
1387	496	4306	التلاغمة	Teleghma	التلاغمة، تلاغمة، ميلة، الجزائر	36.1180204	6.3581086
1388	497	4309	بن يحي عبد الرحمن	Benyahia Abderrahmane	بن يحيى عبد الرحمان، دائرة تاجنانت، ميلة، الجزائر	36.2158595	6.0103474
1389	497	4312	أولاد اخلوف	Ouled Khalouf	أولاد خلوف، دائرة تاجنانت، ميلة، الجزائر	35.98497	6.0735927
1390	497	4308	تاجنانت	Tadjenanet	تاجنانت، دائرة تاجنانت، ميلة، الجزائر	36.1192994	5.9857948
1391	498	4311	أحمد راشدي	Ahmed Rachedi	أحمد راشدي، دائرة وادي النجاء، ميلة، الجزائر	36.3585275	6.1519309
1392	498	4310	وادي النجاء	Oued Endja	وادي النجاء، دائرة وادي النجاء، ميلة، 43006، الجزائر	36.4296241	6.1218697
1393	498	4328	زغاية	Zeghaia	زغاية، دائرة وادي النجاء، ميلة، 43012، الجزائر	36.480762	6.1673842
1394	499	4314	بوحاتم	Bouhatem	بوحاتم، دائرة بوحاتم، ميلة، 43001، الجزائر	36.314608	6.0521801
1395	499	4320	دراحي بوصلاح	Derrahi Bousselah	دراحي بوصلاح، دائرة بوحاتم، ميلة، الجزائر	36.3119325	5.9292319
1396	500	4315	الرواشد	Rouached	الرواشد، دائرة الرواشد، ميلة، 43009، الجزائر	36.4581588	6.0391589
1397	500	4313	تيبرقنت	Tiberguent	تبرقنت، دائرة الرواشد، ميلة، 43035، الجزائر	36.3978575	6.0587121
1398	501	4317	القرارم قوقة	Grarem Gouga	القرارم قوقة، دائرة القرارم قوقة، ميلة، الجزائر	36.5152648	6.3261322
1399	501	4324	حمالة	Hamala	حمالة، دائرة القرارم قوقة، ميلة، الجزائر	36.571449	6.3391852
1400	502	4332	الشيقارة	Chigara	الشيقارة، دائرة سيدي مروان، ميلة، الجزائر	36.5602361	6.2247181
1401	502	4318	سيدي مروان	Sidi Merouane	سيدي مروان، دائرة سيدي مروان، ميلة، الجزائر	36.5170082	6.2594941
1402	503	4321	مينار زارزة	Minar Zarza	مينار زرزة، دائرة تسدان حدادة، ميلة، 43036، الجزائر	36.5344008	5.9115909
1403	503	4319	تسدان حدادة	Tassadane Haddada	تسدان حدادة، دائرة تسدان حدادة، ميلة، الجزائر	36.5016155	5.8787288
1404	504	4322	اعميرة اراس	Amira Arres	عميرة أراس، دائرة ترعي باينان، ميلة، 43017، الجزائر	36.551664	6.0558151
1405	504	4323	ترعي باينان	Terrai Bainen	ترعي باينان، دائرة ترعي باينان، ميلة، الجزائر	36.549944	6.1384689
1406	504	4316	تسالة لمطاعي	Tassala Lematai	تسالة لمطاعي، دائرة ترعي باينان، ميلة، الجزائر	36.5693012	5.9884624
1407	505	4330	عين البيضاء أحريش	Ain Beida Harriche	عين البيضاء حريش، دائرة عين البيضاء حريش، ميلة، الجزائر	36.3959678	5.8941024
1408	505	4329	العياضي برباس	El Ayadi Barbes	العياضي برباس، دائرة عين البيضاء حريش، ميلة، الجزائر	36.4357774	5.8197886
1409	506	4401	عين الدفلى	Ain-Defla	عين الدفلى، دائرة عين الدفلى، عين الدفلى، 44000، الجزائر	36.2656797	1.9701666
1410	507	4425	بن علال	Ben Allal	بن علال، دائرة مليانة، عين الدفلى، الجزائر	36.311118	2.1639492
1411	507	4402	مليانة	Miliana	مليانة، دائرة مليانة، عين الدفلى، الجزائر	36.3047698	2.226821
1412	508	4403	بومدفع	Boumedfaa	بومدفع، دائرة بومدفع، عين الدفلى، الجزائر	36.3700317	2.4732963
1413	508	4427	الحسينية	Hoceinia	حسينية، دائرة بومدفع، عين الدفلى، الجزائر	36.3099757	2.397241
1414	509	4404	خميس مليانة	Khemis-Miliana	خميس مليانة، دائرة خميس مليانة، عين الدفلى، الجزائر	36.2601716	2.2196633
1415	509	4424	سيدي الأخضر	Sidi-Lakhdar	سيدي الأخضر، دائرة خميس مليانة، عين الدفلى، 44027، الجزائر	36.2656357	2.1617628
1416	510	4426	عين البنيان	Ain-Benian	عين بنيان، دائرة حمام ريغة، عين الدفلى، الجزائر	36.3518312	2.3909376
1417	510	4423	عين التركي	Ain-Torki	عين تركي، دائرة حمام ريغة، عين الدفلى، الجزائر	36.3348803	2.3032371
1418	510	4405	حمام ريغة	Hammam-Righa	حمام ريغة، دائرة حمام ريغة، عين الدفلى، الجزائر	36.3827173	2.4009305
1419	511	4409	بوراشد	Bourached	بوراشد، دائرة جليدة، عين الدفلى، 44044، الجزائر	36.16983	1.9321167
1420	511	4407	جليدة	Djelida	جليدة، دائرة جليدة، عين الدفلى، 44100، الجزائر	36.2027341	2.0795157
1421	511	4429	جمعة أولاد الشيخ	Djemaa Ouled Cheikh	جمعة ولاد الشيخ، دائرة جليدة، عين الدفلى، الجزائر	36.0770321	2.0045972
1422	512	4406	عريب	Arib	عريب، دائرة العامرة، عين الدفلى، الجزائر	36.2919441	2.0683322
1423	512	4408	العامرة	El-Amra	العامرة، دائرة العامرة، عين الدفلى، الجزائر	36.3050171	1.8482739
1424	512	4430	المخاطرية	Mekhatria	المختارية، دائرة العامرة، عين الدفلى، 44140، الجزائر	36.3025793	1.9597495
1425	513	4410	العطاف	El-Attaf	العطاف، دائرة العطاف، عين الدفلى، الجزائر	36.2244328	1.6725159
1426	513	4435	تبركانين	Tiberkanine	تيبركانين، دائرة العطاف، عين الدفلى، الجزائر	36.1746084	1.6274197
1427	514	4433	عين بويحيى	Ain-Bouyahia	عين بويحيى، دائرة العبادية، عين الدفلى، 44360، الجزائر	36.2878137	1.7658713
1428	514	4411	العبادية	El-Abadia	العبادية، دائرة العبادية، عين الدفلى، 44006، الجزائر	36.2750279	1.6854432
1429	514	4432	تاشتة زقاغة	Tacheta Zegagha	تاشتة زقاغة، دائرة العبادية، عين الدفلى، الجزائر	36.3751106	1.6134371
1430	515	4428	بربوش	Birbouche	بربوش، دائرة جندل، عين الدفلى، الجزائر	36.1115707	2.4965145
1431	515	4412	جندل	Djendel	جندل، دائرة جندل، عين الدفلى، الجزائر	36.2192263	2.4153796
1432	515	4413	وادي الشرفاء	Oued Chorfa	وادي الشرفاء، دائرة جندل، عين الدفلى، الجزائر	36.1655491	2.5546056
1433	516	4414	عين الاشياخ	Ain-Lechiakh	عين لشياخ، دائرة عين لشياخ، عين الدفلى، الجزائر	36.1220983	2.4054963
1434	516	4420	عين السلطان	Ain-Soltane	عين سلطان، دائرة عين لشياخ، عين الدفلى، الجزائر	36.2450669	2.2976522
1435	516	4415	واد الجمعة	Oued Djemaa	وادي الجمعة، دائرة عين لشياخ، عين الدفلى، الجزائر	36.040892	2.3710713
1436	517	4434	الماين	El-Maine	الماين، دائرة الروينة، عين الدفلى، الجزائر	36.0507861	1.7574583
1437	517	4416	الروينة	Rouina	الروينة، دائرة الروينة، عين الدفلى، الجزائر	36.2448216	1.8055909
1438	517	4417	زدين	Zeddine	زدين، دائرة الروينة، عين الدفلى، 44031، الجزائر	36.1562103	1.8201697
1439	518	4419	بئر ولد خليفة	Bir-Ould-Khelifa	بئر أولاد خليفة، دائرة برج األمير خالد، عين الدفلى، الجزائر	36.1807064	2.2276595
1440	518	4422	برج الأمير خالد	Bordj-Emir-Khaled	برج الأمير خالد، دائرة برج األمير خالد، عين الدفلى، الجزائر	36.1200332	2.2045088
1441	518	4421	طارق بن زياد	Tarik-Ibn-Ziad	طارق بن زياد، دائرة برج األمير خالد، عين الدفلى، 44029، الجزائر	35.9886074	2.1444273
1442	519	4431	بطحية	Bathia	بطحية، دائرة بطحية، عين الدفلى، 44041، الجزائر	35.9159891	1.8400969
1443	519	4436	بلعاص	Belaas	بلعاص، دائرة بطحية، عين الدفلى، الجزائر	35.9825995	1.8510081
1444	519	4418	الحسانية	Hassania	الحسنية، دائرة بطحية، عين الدفلى، الجزائر	35.939897	1.9282929
1445	520	4501	النعامة	Naama	النــعـامـة، دائرة النعامة، النعامة، 45000، الجزائر	33.2647342	-0.3110393
1446	521	4509	عين بن خليل	Ain Ben Khelil	عين بن خليل، دائرة مشرية، النعامة، الجزائر	33.160057	-0.9420284
1447	521	4512	البيوض	El Biodh	البيود، دائرة مشرية، النعامة، الجزائر	33.7636135	-0.1306774
1448	521	4502	المشرية	Mecheria	المشرية، دائرة مشرية، النعامة، الجزائر	33.5428415	-0.2750524
1449	522	4503	عين الصفراء	Ain Sefra	عين الصفراء، دائرة عين الصفراء، النعامة، 45200، الجزائر	32.7568151	-0.577859
1450	522	4504	تيوت	Tiout	تيوت، دائرة عين الصفراء، النعامة، 45210، الجزائر	32.7750253	-0.4136828
1451	523	4505	سفيسيفة	Sfissifa	صفيصيفة، دائرة صفيصيفة، النعامة، الجزائر	32.7879643	-1.0150328
1452	524	4508	جنين بورزق	Djenienne Bourezg	جنيان بورزق، دائرة مغرار، النعامة، الجزائر	32.3725656	-0.8044918
1453	524	4506	مغرار	Moghrar	مغرار، دائرة مغرار، النعامة، الجزائر	32.4487848	-0.537516
1454	525	4507	عسلة	Asla	عسلة، دائرة عسلة، النعامة، الجزائر	32.718689	-0.1574112
1455	526	4511	القصدير	Kasdir	قصدير، دائرة مكمن بن عمار، النعامة، الجزائر	33.7094366	-1.358688
1456	526	4510	مكمن بن عمار	Makmen Ben Amar	مكمن بن عمار، دائرة مكمن بن عمار، النعامة، الجزائر	33.8449135	-0.7605891
1457	527	4601	عين تموشنت	Ain Temouchent	عين تموشنت، دائرة عين تموشنت، عين تموشنت، 46000، الجزائر	35.3048421	-1.1457771
1458	527	4612	سيدي بن عدة	Sidi Ben Adda	سيدي بن عدة، دائرة عين تموشنت، عين تموشنت، 46013، الجزائر	35.3042768	-1.1815248
1459	528	4611	شنتوف	Chentouf	شنتوف، دائرة حمام بوحجر، عين تموشنت، 46020، الجزائر	35.3043747	-1.0291377
1460	528	4604	حمام بوحجر	Hammam Bou Hadjar	حمام بوحجر، دائرة حمام بوحجر، عين تموشنت، الجزائر	35.3790296	-0.9711585
1461	528	4621	الحساسنة	Hassasna	الحساسنة، دائرة حمام بوحجر، عين تموشنت، الجزائر	35.2474885	-0.9447994
1462	528	4606	وادي برقش	Oued Berkeche	وادي برقش، دائرة حمام بوحجر، عين تموشنت، الجزائر	35.2085599	-0.9691829
1463	529	4609	عين الأربعاء	Ain El Arbaa	عين الأربعاء، دائرة عين الأربعاء، عين تموشنت، 46009، الجزائر	35.4058264	-0.8811572
1464	529	4616	وادي الصباح	Oued Sebbah	وادي الصباح، دائرة عين الأربعاء، عين تموشنت، الجزائر	35.4036087	-0.802459
1465	529	4615	سيدي بومدين	Sidi Boumediene	سيدي بومدين، دائرة عين الأربعاء، عين تموشنت، الجزائر	35.3384692	-0.888869
1466	529	4610	تامزورة	Tamzoura	تامزوغة، دائرة عين الأربعاء، عين تموشنت، 46240، الجزائر	35.4111211	-0.6582825
1467	530	4602	شعبة اللحم	Chaabat El Ham	شعبة اللحم، دائرة المالح، عين تموشنت، 46160، الجزائر	35.3367018	-1.1020618
1468	530	4614	المالح	El Maleh	المالح، دائرة المالح، عين تموشنت، 46007، الجزائر	35.3853087	-1.095815
1469	530	4622	أولاد الكيحل	Ouled Kihal	اولاد كيحل، دائرة المالح، عين تموشنت، الجزائر	35.3685532	-1.2348973
1470	530	4608	تارقة	Terga	تارقة، دائرة المالح، عين تموشنت، الجزائر	35.4181291	-1.1782222
1471	531	4605	بوزجار	Bouzedjar	بوزجار، دائرة العامرية، عين تموشنت، الجزائر	35.5802687	-1.14895
1472	531	4619	العامرية	El Amria	العامرية، دائرة العامرية، عين تموشنت، الجزائر	35.5248267	-1.0145245
1473	531	4628	المساعيد	El Messaid	المساعيد، دائرة العامرية، عين تموشنت، 46006، الجزائر	35.5432729	-1.121375
1474	531	4620	حاسي الغلة	Hassi El Ghella	حاسي الغلة، دائرة العامرية، عين تموشنت، 46012، الجزائر	35.4548282	-1.0546776
1475	531	4617	أولاد بوجمعة	Ouled Boudjemaa	أولاد بوجمعة، دائرة العامرية، عين تموشنت، الجزائر	35.4718663	-1.1926145
1476	532	4607	أغلال	Aghlal	آغلال، دائرة عين الكيحل، عين تموشنت، الجزائر	35.2024599	-1.0817802
1477	532	4603	عين الكيحل	Ain Kihal	عين الكيحل، دائرة عين الكيحل، عين تموشنت، الجزائر	35.219587	-1.1969828
1478	532	4618	عين الطلبة	Ain Tolba	عين الطلبة، دائرة عين الكيحل، عين تموشنت، 46010، الجزائر	35.2416188	-1.2485001
1479	532	4613	عقب الليل	Aoubellil	عقب الليل، دائرة عين الكيحل، عين تموشنت، الجزائر	35.145968	-1.0094137
1480	533	4623	بني صاف	Beni Saf	بني صاف، دائرة بني صاف، عين تموشنت، 46001، الجزائر	35.3025458	-1.382036
1481	533	4627	الأمير عبد القادر	Emir Abdelkader	الأمير عبد القادر، دائرة بني صاف، عين تموشنت، 46320، الجزائر	35.2190668	-1.4055361
1482	533	4624	سيدي صافي	Sidi Safi	سيدي الصافي، دائرة بني صاف، عين تموشنت، 46025، الجزائر	35.279924	-1.3137781
1483	534	4625	ولهاصة الغرابة	Oulhaca El Gheraba	ولهاصة الغرابة، دائرة ولهاصة، عين تموشنت، الجزائر	35.2332708	-1.505403
1484	534	4626	سيدي ورياش	Sidi Ouriache	سيدي ورياش، دائرة ولهاصة، عين تموشنت، 46024، الجزائر	35.188205	-1.5070125
1485	535	4701	غرداية	Ghardaia	غرداية، دائرة غرداية، غرداية، الجزائر	32.485855	3.677104
1486	536	4702	المنيعة	El Meniaa	المنيعة، دائرة المنيعة، المنيعة، الجزائر	30.5836683	2.8830889
1487	536	4712	حاسي القارة	Hassi Gara	حاسي قارة، دائرة المنيعة، المنيعة، الجزائر	30.5574275	2.8984311
1488	537	4703	ضاية بن ضحوة	Dhayet Bendhahoua	ضاية بن ضحوة، دائرة ضاية بن ضحوة، غرداية، 47026، الجزائر	32.5348228	3.6082436
1489	538	4704	بريان	Berriane	بريان، دائرة بريان، غرداية، الجزائر	32.8256322	3.7639006
1490	539	4705	متليلي	Metlili	متليلي الشعانبة، دائرة متليلي الشعانبة، غرداية، الجزائر	32.2605169	3.6259116
1491	539	4709	سبسب	Sebseb	سبسب، دائرة متليلي الشعانبة، غرداية، 47025، الجزائر	32.1674106	3.587195
1492	540	4706	القرارة	El Guerrara	القرارة، دائرة القرارة، غرداية، الجزائر	32.7885786	4.4882869
1493	541	4708	زلفانة	Zelfana	زلفانة، دائرة زلفانة، غرداية، 47007، الجزائر	32.3936629	4.2268033
1494	542	4710	بونورة	Bounoura	بونورة، دائرة بونورة، غرداية، الجزائر	32.4856037	3.7049786
1495	542	4707	العطف	El Atteuf	العطف، دائرة بونورة، غرداية، 47012، الجزائر	32.476746	3.7471239
1496	543	4711	حاسي الفحل	Hassi Fehal	حاسي الفحل، دائرة منصورة، المنيعة، الجزائر	31.605285	3.6742627
1497	543	4713	المنصورة	Mansoura	منصورة، دائرة منصورة، المنيعة، الجزائر	32.042151	3.2634621
1498	545	4835	بن داود	Bendaoud	بن داود، دائرة غليزان، غليزان، الجزائر	35.7191834	0.5198795
1499	545	4801	غليزان	Relizane	غليزان، دائرة غليزان، غليزان، الجزائر	35.7381193	0.5547673
1500	546	4829	لحلاف	Lahlef	لحلف، دائرة وادي ارهيو، غليزان، الجزائر	35.8932512	0.9795402
1501	546	4837	مرجة سيدي عابد	Merdja Sidi Abed	مرجة سيدي عابد، دائرة وادي ارهيو، غليزان، الجزائر	36.0017883	1.0074682
1502	546	4821	واريزان	Ouarizane	واريزان، دائرة وادي ارهيو، غليزان، الجزائر	36.0444332	0.8959531
1503	546	4802	وادي رهيو	Oued-Rhiou	وادي رهيو، دائرة وادي ارهيو، غليزان، الجزائر	35.9607535	0.9180664
1504	547	4807	الحمادنة	El H'madna	الحمادنة، دائرة الحمادنة، غليزان، الجزائر	35.9062679	0.7761842
1505	547	4826	وادي الجمعة	Oued El Djemaa	وادي الجمعة، دائرة الحمادنة، غليزان، الجزائر	35.7959797	0.6816434
1506	548	4830	بني زنطيس	Beni Zentis	بني زنتيس، دائرة سيدي محمد بن علي، غليزان، الجزائر	36.1115307	0.6639245
1507	548	4809	مديونة	Mediouna	مديونة، دائرة سيدي محمد بن علي، غليزان، الجزائر	36.1246927	0.7483582
1508	548	4808	سيدي أمحمد بن علي	Sidi M'hamed Benali	سيدي امحمد بن علي، دائرة سيدي محمد بن علي، غليزان، الجزائر	36.1438111	0.8480987
1509	549	4811	عمي موسى	Ammi Moussa	عمي موسى، دائرة عمي موسى، غليزان، الجزائر	35.8702048	1.1081265
1510	549	4833	الحاسي	El Hassi	الحاسي، دائرة عمي موسى، غليزان، الجزائر	35.7299684	1.0183628
1511	549	4836	الولجة	El Ouldja	العلجة، دائرة عمي موسى، غليزان، الجزائر	35.9072479	1.1227422
1512	549	4805	أولاد يعيش	Ouled Aiche	أولاد يعيش، دائرة عمي موسى، غليزان، الجزائر	35.8266939	0.9631855
1513	550	4813	بني درقن	Beni Dergoun	بني درقن، دائرة زمورة، غليزان، الجزائر	35.7933416	0.801238
1514	550	4832	دار بن عبد الله	Dar Ben Abdelah	دار بن عبد الله، دائرة زمورة، غليزان، الجزائر	35.6981857	0.6876224
1515	550	4812	زمورة	Zemmoura	زمورة، دائرة زمورة، غليزان، 48000، الجزائر	35.7167661	0.7595645
1516	551	4814	جديوية	Djidiouia	جديوية، دائرة جديوية، غليزان، الجزائر	35.9272152	0.830558
1517	551	4816	حمري	Hamri	الحمري، دائرة جديوية، غليزان، الجزائر	36.0188911	0.6895328
1518	551	4838	أولاد سيدي الميهوب	Ouled Sidi Mihoub	أولاد سيدي ميهوب، دائرة جديوية، غليزان، الجزائر	35.9738265	0.6927849
1519	552	4803	بلعسل بوزقزة	Belaassel Bouzagza	بلعسل بوزقزة، دائرة المطمر، غليزان، 48150، الجزائر	35.8211586	0.4905896
1520	552	4817	المطمر	El-Matmar	المطمر، دائرة المطمر، غليزان، 48009، الجزائر	35.7309261	0.4611475
1521	552	4810	سيدي خطاب	Sidi Khettab	سيدي خطاب، دائرة المطمر، غليزان، الجزائر	35.9105034	0.5113687
1522	552	4818	سيدي امحمد بن عودة	Sidi M'hamed Benaouda	سيدي بن عودة، دائرة المطمر، غليزان، الجزائر	35.6032636	0.5903252
1523	553	4819	عين طارق	Ain-Tarek	عين طارق، دائرة عين طارق، غليزان، 48015، الجزائر	35.781388	1.1302226
1524	553	4834	حد الشكالة	Had Echkalla	حد الشقالة، دائرة عين طارق، غليزان، الجزائر	35.6805929	1.1375791
1525	554	4815	القطار	El-Guettar	القطارة، دائرة مازونة، غليزان، الجزائر	36.0879043	0.8168474
1526	554	4822	مازونة	Mazouna	مازونة، دائرة مازونة، غليزان، الجزائر	36.1262742	0.8801926
1527	555	4824	عين الرحمة	Ain Rahma	عين الرحمة، دائرة يلل، غليزان، الجزائر	35.6237721	0.393045
1528	555	4823	القلعة	Kalaa	قلعة، دائرة يلل، غليزان، الجزائر	35.5817849	0.3285197
1529	555	4804	سيدي سعادة	Sidi Saada	سيدي سعادة، دائرة يلل، غليزان، الجزائر	35.675994	0.3414394
1530	555	4825	يلل	Yellel	يلل، دائرة يلل، غليزان، الجزائر	35.7217352	0.3571077
1531	556	4827	الرمكة	Ramka	الرمكة، دائرة الرمكة، غليزان، 48024، الجزائر	35.8669131	1.2836132
1532	556	4831	سوق الحد	Souk El Had	سوق الحد، دائرة الرمكة، غليزان، الجزائر	35.9539516	1.247012
1533	557	4828	منداس	Mendes	مندس، دائرة مندس، غليزان، الجزائر	35.6507899	0.8644816
1534	557	4820	وادي السلام	Oued Essalem	وادي السالم، دائرة مندس، غليزان، الجزائر	35.5798979	0.9252497
1535	557	4806	سيدي لزرق	Sidi Lazreg	سيدي لزرق، دائرة مندس، غليزان، 48065، الجزائر	35.6459245	0.7790301
1536	409	3207	الأبيض سيدي الشيخ	El Abiodh Sidi Cheikh	الأبيض سيدي الشيخ، دائرة الأبيض سيدي الشيخ، البيض، الجزائر	32.9113067	0.6467552
1537	410	3220	توسمولين	Tismouline	توسمولين، دائرة بوقطب، البيض، الجزائر	33.6507694	0.3135179
1540	408	3221	سيدي سليمان	Sidi Slimane	سيدي سليمان، دائرة بوعلام، البيض، الجزائر	33.834049	1.7297467
1539	408	3218	سيدي اعمر	Sidi Ameur	سيدي اعمر، دائرة بوعلام، البيض، الجزائر	33.7696248	1.4331381
1538	409	3208	عين العراك	Ain El Orak	عين العراك، دائرة الأبيض سيدي الشيخ، البيض، الجزائر	33.4118119	0.7401801
1541	411	3213	بوسمغون	Boussemghoun	بوسمغون، دائرة بوسمغون، البيض، الجزائر	32.8677385	0.0229821
\.
